{
  "tiktok-community-guidelines": {
    "policy_name": "Tiktok Community Guidelines",
    "initial_summary": "## TikTok Competitor Community Guidelines Summary\n\nThis document outlines a comprehensive set of community guidelines for a TikTok-like platform, effective May 17, 2024.  Key areas covered include:\n\n* **Content Moderation:**  The platform employs a three-pronged approach: removing violating content, restricting age-inappropriate content (for users under 18), and making ineligible for recommendation (For You feed) content that doesn't meet platform standards.\n\n* **Prohibited Content:**  A wide range of prohibited content is detailed, encompassing: violence, hate speech, sexual abuse, harassment, self-harm, dangerous activities, misinformation, scams, regulated goods (alcohol, firearms, etc.), and violations of privacy and security.  Specific examples are provided within each category, though the document notes that these are not exhaustive.\n\n* **Community Empowerment:** The platform provides users with tools and resources to manage their experience, including safety settings, filtering options, and reporting mechanisms.\n\n* **Enforcement:** While the specifics of enforcement aren't detailed, the document implies a combination of automated and human moderation to address policy violations.\n\nThe guidelines aim to create a safe and welcoming environment while balancing creative expression and the prevention of harm.  The full guidelines are categorized for easier navigation, with additional information and examples available for each section.\n",
    "last_update_summary": "Here's a summary of the new TikTok Community Guidelines for a Product Manager:\n\n### Summary of New TikTok Community Guidelines (Effective May 17, 2024)\n\nThis diff indicates a new version of TikTok's Community Guidelines. The most significant updates for Product are around policy structure and enforcement mechanisms:\n\n*   **Dual Standard Framework**: Clearly differentiates between \"rules\" (content that violates policy and will be removed) and \"standards\" (content that is permitted but may be ineligible for the For You Feed (FYF) recommendation due to not meeting quality or suitability criteria).\n*   **Formalized 4-Tiered Moderation Approach**: Explicitly outlines the various actions taken against content:\n    1.  **Remove**: Content violating core rules (public or private).\n    2.  **Restrict**: Content not suitable for youth (age-gating to 18+).\n    3.  **Make Ineligible for FYF**: Content not meeting recommendation standards (demotion).\n    4.  **Empower**: Provides users with information, tools, and resources (e.g., labels, \"opt-in\" screens, warnings, safety toolkit, account controls).\n*   **Enhanced Policy Granularity**: The detailed table of contents indicates comprehensive coverage across areas like Youth Safety, Mental & Behavioral Health, Sensitive & Mature Themes, and Regulated Goods. Notably, a specific section for **\"Edited Media and AI-Generated Content (AIGC)\"** has been added under \"Integrity and Authenticity,\" reflecting a focus on emerging content forms.\n*   **Emphasis on Transparency**: The policy highlights the availability of definitions, examples, and clarifications under each section, and refers to dedicated pages for FYF eligibility and youth safety summaries.\n\n**Key takeaway for PMs**: This update introduces a more structured and transparent approach to content moderation, particularly by formalizing the distinction between removal and FYF eligibility, and by clearly defining the range of enforcement actions. Product teams should ensure features and user-facing communications align with these explicit moderation tiers and policy nuances.",
    "last_updated": "2025-07-21T06:42:10.156994Z"
  },
  "tiktok-live-moderation": {
    "policy_name": "Tiktok Live Moderation",
    "initial_summary": "# TikTok LIVE Moderation Policy Summary\n\nThis document details TikTok's approach to content moderation during LIVE streams.  Key features include:\n\n* **Creator Controls:** Creators can add moderators, control audience age (18+), filter comments, block keywords, mute, and block viewers directly from the LIVE settings or chat.  This applies to both mobile app and web browser access (via LIVE Studio or OBS Studio for broadcasting; not required for moderation).\n\n* **Moderator Permissions:** Moderators, granted permission by the creator, can mute, block viewers, and report comments violating Community Guidelines.  The level of control a moderator has is determined by the creator.\n\n* **User Actions:**  Viewers can be reported, muted (temporarily), or blocked (preventing future LIVE viewership and other interactions with the creator).  Notifications are sent to muted/blocked users.\n\n* **Accessibility:** Moderation tools are accessible both within the LIVE settings and directly from the LIVE chat interface on both the mobile app and web browser.\n",
    "last_update_summary": "### Summary: New TikTok LIVE Moderation Policy Page\n\nThis diff introduces a **new, comprehensive policy page for \"Moderating on TikTok LIVE\"**, effective July 21, 2025. This document outlines the roles, responsibilities, and specific actions available to both creators and designated moderators to manage LIVE streams effectively and safely.\n\n**Key Takeaways for Product Management:**\n\n*   **Empowers Creators & Moderators:** The policy clearly defines the tools available for managing viewer behavior and comments on LIVE, including options to **report, mute, or block viewers** who violate Community Guidelines.\n*   **Creator Controls:** Creators have ultimate control, able to:\n    *   Add and remove moderators before or during a LIVE.\n    *   Set **Audience Controls** (e.g., limit to 18+ viewers).\n    *   Manage **Comment Settings** (allow/filter comments, block keywords).\n    *   View and manage lists of **Muted and Blocked Accounts**.\n*   **Moderator Capabilities:** Designated moderators can assist by reporting, muting, or blocking viewers, and managing comment settings, providing critical support for larger LIVEs.\n*   **Platform Consistency (with nuances):** Moderation actions are detailed for both the **TikTok app** and **web browser**, with specific UI steps provided for each. While core capabilities are similar, the navigation and access points differ.\n*   **Clear Notification for Punishments:** Viewers are explicitly notified if they are muted or blocked, ensuring transparency.\n*   **Impact of Blocking:** Blocking a viewer extends beyond the current LIVE, preventing them from watching any of the creator's LIVE videos and interacting via posts, profile, or DMs.\n\nThis new policy aims to enhance safety and moderation capabilities on TikTok LIVE by providing clear guidelines and operational steps for both creators and their moderation teams.",
    "last_updated": "2025-07-21T06:42:18.585139Z"
  },
  "tiktok-shop-prohibited-products": {
    "policy_name": "Tiktok Shop Prohibited Products",
    "initial_summary": "## Competitor Policy Summary: TikTok Shop Academy (US)\n\nThis document appears to be incomplete or broken.  The provided text only shows a heading related to boosting sales on TikTok Shop Academy and a JavaScript error message.  **No actual policy information is present.**  Therefore, no meaningful summary of their policy can be provided.  Further investigation is needed to obtain the actual policy document.\n",
    "last_update_summary": "**Summary for Product Manager: Competitor Policy Page Analysis**\n\nThis diff indicates the creation of a *new file* for a competitor's \"prohibited products\" policy page (dated 2025-07-20).\n\n**Key Changes:**\n\n*   **New Page Created:** A new policy page `tiktok-shop-prohibited-products` has been added.\n*   **Placeholder Content:** The page's content is currently a generic \"JavaScript not enabled\" message, suggesting it's an unpopulated placeholder or a technical error page, rather than an active policy.\n*   **No Policy Content Detected:** There are no actual policy rules or guidelines present in this version of the page.\n\n**Impact:**\n\nCurrently, there is no substantive policy information to analyze. This appears to be a technical setup or placeholder for a future policy page. We should monitor this URL for updates to identify actual policy content when it becomes available.",
    "last_updated": "2025-07-20T23:50:56.579760Z"
  },
  "whatnot-blocking-a-user": {
    "policy_name": "Whatnot Blocking A User",
    "initial_summary": "## Whatnot User Blocking Policy Summary\n\nThis document details Whatnot's user blocking functionality.  Users can block others to prevent:\n\n* Following\n* Direct messaging\n* Profile viewing\n* Livestream interaction (bookmarking, joining, chatting)\n* Future purchases from listings\n\nExisting orders are unaffected by blocking.  Blocking is currently permanent.  There's no list of blocked users.  Being removed from a livestream is different from being blocked by a user.  Users can report violations of Community Guidelines separately.\n",
    "last_update_summary": "### Competitor Policy Analysis: Whatnot - \"Blocking a User\" (New Policy)\n\n**Key Policy Details:**\n\nThis document is a *newly published policy page* (dated June 11, 2025) detailing the functionality and implications of blocking another user on Whatnot. As this is a `diff` from `/dev/null`, the entire content represents a new policy introduction.\n\n**Functionality & Impact of Blocking:**\nBlocking a user on Whatnot prevents them from:\n*   Following you.\n*   Direct messaging you within the app.\n*   Viewing your profile.\n*   Bookmarking, joining, and chatting in your livestreams.\n*   Making *future* purchases from your marketplace listings (existing orders are honored).\n\n**Process:**\nUsers can block another user by going to their profile, tapping the three-dot icon (top right), and selecting \"Block User.\"\n\n**Key Considerations / Limitations:**\n*   **No Blocked User List:** Users *cannot* currently see a list of all the users they have blocked.\n*   **Permanence:** The policy explicitly states, \"currently blocking is permanent!\" implying unblocking is either difficult, not supported, or not easily discoverable. (The \"How do I unblock\" FAQ does mention searching for the user and selecting \"Unblock\" from their profile menu, which contradicts the \"permanent\" statement, suggesting a potential internal inconsistency or a high friction for unblocking).\n*   **Distinct from Reporting:** The policy clarifies that blocking is different from reporting a user for Community Guideline violations, which involves the Trust and Safety team.\n*   **Livestream Bans vs. Blocking:** It differentiates being removed from a livestream (temporary for that stream by a host/mod) from being blocked by another user (more comprehensive and persistent).",
    "last_updated": "2025-07-21T06:42:28.791001Z"
  },
  "whatnot-buyer-protection": {
    "policy_name": "Whatnot Buyer Protection",
    "initial_summary": "# Whatnot Buyer Protection Policy Summary\n\n**Key Points:**\n\n* **Refund Eligibility:** Whatnot offers buyer protection for incomplete/incorrect items, items not as described/inauthentic, and packages not received.  Refunds are generally granted within 30 days of purchase or 14 days of delivery (7 days for certain categories like coins, sneakers, luxury goods; 2 days for plants).  Whatnot may require item return in original condition.  German buyers pay return shipping.\n\n* **Refund Exclusions:**  Consumables (opened/consumed items, breaks except for missing/damaged items), tips, refused deliveries, uncollected packages, unpaid customs fees, exchange rate losses, chargebacks, digital content, off-platform transactions, and instances of suspected fraud are excluded.  Returning the wrong item also voids a refund.\n\n* **Time Limits & Exceptions:**  Specific shorter deadlines apply for certain high-value categories and counterfeit claims (30 days from receipt). Extensions may be granted for international orders, pre-orders, custom orders, and due to natural disasters.  \"Delivered\" but not received items require contact within 14 days.\n\n* **EU/UK Right of Withdrawal:** EU/UK buyers have a 14-day right of withdrawal, requiring item return within 14 days of cancellation.  Buyers are responsible for return shipping costs. This right doesn't apply to breaks, surprise products, or certain unsuitable goods (hygiene, mixed, sealed software/media, customized items, perishable goods).\n\n\n* **High-Value Loss Reimbursement:** A separate policy exists for high-value card losses in breaks, potentially reimbursing market value.\n\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of Whatnot's new Buyer Protection Policy for a Product Manager:\n\n---\n\n### Whatnot Buyer Protection Policy: New Policy Overview\n\nThis diff introduces Whatnot's comprehensive Buyer Protection Policy (effective May 16, 2025), outlining conditions for buyer refunds. This appears to be a *newly published or completely overhauled* policy, rather than incremental changes.\n\n**Key Highlights:**\n\n*   **Commitment:** Aims to provide a trustworthy buying experience, covering buyers in rare events of issues.\n*   **How to Get Help:** Buyers must submit a request through the app.\n*   **Covered Issues:** Refunds are generally offered for:\n    *   Incomplete or incorrect items\n    *   Items Not as Described or Inauthentic (damaged, expired, defective, counterfeit, not matching condition)\n    *   Package not received (lost, delayed, not shipped, misdelivered, or marked \"delivered\" but not received)\n    *   Other issues like incorrect sales tax or additional postage charged.\n*   **General Claim Timeline:** Requests must be submitted by the **earlier of 30 days from purchase or 14 days from delivery**.\n*   **Category-Specific Timelines:**\n    *   **7 days from delivery / 30 days from purchase:** Coins & Money, Sports Cards, Sneakers & Streetwear, Trading Card Games, Luxury Goods.\n    *   **2 days from delivery / 30 days from purchase:** Plants.\n    *   **30 days from receipt:** Counterfeit claims.\n    *   **14 days from delivery:** If item marked delivered but not received.\n*   **Returns:** Whatnot may require returns; items must be in the same condition. Opening products or removing tags may disqualify or reduce refunds. German buyers pay return shipping costs (deducted from refund).\n*   **Key Exclusions (No Refund):**\n    *   **Consumable Products:** Generally, if consumed or opened (e.g., Breaks - except for missing/damaged/delayed/incorrect items).\n    *   **Tips to sellers.**\n    *   **Refusing delivery** or **failing to pickup** packages.\n    *   **Refusal to pay customs fees** (fees paid are also not refundable).\n    *   **Exchange rate fluctuations.**\n    *   **Chargebacks** initiated with financial institutions.\n    *   **Digital Content** (e.g., PDFs).\n    *   **Potential fraud/abuse** of policy (at Whatnot's discretion).\n    *   **Incorrect item returned** by the buyer.\n    *   **Off-platform transactions.**\n*   **High Value Loss Reimbursement:** Specific policy exists for Sports/Trading Cards in breaks (reimbursement based on market value for missing cards).\n*   **EU/UK Right of Withdrawal:** For consumers buying from professional sellers, a statutory right to cancel within 14 days of receipt and return (buyer pays return shipping). Specific exclusions apply (e.g., Breaks, unsealed hygienics, customized goods).\n\nThis policy establishes clear guidelines for buyer protection, refund eligibility, and important exclusions, with specific considerations for high-value items and international consumer rights.",
    "last_updated": "2025-07-21T06:42:40.222782Z"
  },
  "whatnot-enforcement-actions": {
    "policy_name": "Whatnot Enforcement Actions",
    "initial_summary": "## Whatnot's Trust & Safety Policy: Summary for Product Managers\n\nWhatnot's policy enforces Community Guidelines with penalties escalating based on violation severity and account history.  Violations are cumulative, meaning repeated offenses, even minor ones, can lead to a permanent ban.\n\n**Key Actions & Penalties:**\n\n* **Warnings:** For minor infractions, with guidance provided.\n* **Suspensions:** Temporary account access loss (2 or 7 days).\n* **Selling Access Revoked:**  Loss of ability to sell or go live.\n* **Ban:** Permanent account termination for serious or repeated violations.\n* **Discovery Restriction:** Temporary reduced visibility in feeds/recommendations.\n* **Other Penalties:** Loss of access to features like Direct Messages.\n\n**Account Health & Performance:**\n\n* An Account Health dashboard tracks Seller Performance Rates (fulfillment, shipping) and Policy Standing.\n* Poor performance in either area can result in warnings and penalties.\n* Policy Standing has five levels (Excellent, Good, Fair, Poor, Very Poor), reflecting penalty history.\n\n**Violation Expiration:**\n\n* Most violations expire after 180 days, except for bans and offboarding, which are permanent.\n\n**Appeals:**  Users can appeal penalties via email.\n",
    "last_update_summary": "Here's a summary of Whatnot's new \"What Actions We Take\" policy page for a Product Manager:\n\n```markdown\n### Whatnot - \"What Actions We Take\" Policy Analysis (New Policy Introduction)\n\nThis new policy page outlines Whatnot's comprehensive approach to enforcing its Community Guidelines and managing user compliance. As a new file in their policy repository, it signifies the introduction of a structured enforcement framework.\n\n**Key Components & Implications:**\n\n1.  **Enforcement Philosophy:**\n    *   Actions are proportional to the violation, considering a user's Trust & Safety record.\n    *   Violations are **cumulative**: multiple minor infractions can lead to severe penalties, including a ban.\n    *   Goal is to maintain a trusted platform while offering users a chance to course-correct.\n\n2.  **Graduated Penalties:** Clear escalation path based on violation severity and history:\n    *   **Warning:** Guidance on policy.\n    *   **Suspension:** Temporary loss of access (2 or 7 days).\n    *   **Revoke Selling Access:** For sellers, loss of ability to sell/go live.\n    *   **Ban:** Permanent account termination for repeated or serious violations.\n    *   **Discovery Restricted:** Temporary reduction in visibility in feeds/recommendations (still visible on profile/search).\n    *   **Other Penalties:** Loss of specific features (e.g., Direct Messages).\n    *   **Ongoing Investigation Suspensions:** Temporary access suspension during reviews.\n\n3.  **Violation Lifespan & Appeals:**\n    *   Most violations expire after **180 days**. Bans are permanent.\n    *   Appeals process involves responding directly to the penalty email.\n\n4.  **Account Health Dashboard (Beta):**\n    *   Introduces a structured **\"Policy Standing\"** with five states (Excellent, Good, Fair, Poor, Very Poor) directly correlated to the graduated penalties.\n    *   Monitors **\"Seller Performance Rates\"** (Fulfillment Success Rate, On Time Shipment Rate), with underperformance leading to warnings and potential penalties. This links operational performance directly to account standing.\n\n**Key Changes (from a blank slate):**\n\nThis document represents the *establishment* of a detailed, transparent, and multi-faceted enforcement policy. The introduction of:\n*   A clear, tiered penalty system.\n*   The concept of cumulative violations.\n*   Specific new enforcement actions like \"Discovery Restricted.\"\n*   A beta \"Account Health Dashboard\" with \"Policy Standing\" and \"Seller Performance Rates\" is a significant step towards formalizing and communicating compliance expectations and user performance.\n\nThis new policy provides a robust framework for managing user behavior, aimed at fostering a more trusted and compliant marketplace environment by clearly outlining consequences and providing tools for self-monitoring (via the dashboard).\n```",
    "last_updated": "2025-07-21T06:42:48.597862Z"
  },
  "whatnot-hate-and-harassment": {
    "policy_name": "Whatnot Hate And Harassment",
    "initial_summary": "## Whatnot Hate and Harassment Policy Summary\n\nThis policy prohibits hateful conduct and harassment on the Whatnot platform, including sexual harassment and off-platform abuse that impacts the Whatnot community.  Key prohibited behaviors include:\n\n* **Harassment:**  Repeated unwanted contact, personal attacks, targeted obscene language,  using contact information for non-transactional purposes, and disparaging others (sellers disparaging buyers in streams, for example).  Exceptions may be made for newsworthy events or public figures.\n\n* **Threats & Harmful Wishes:** Wishing harm, making threats (implied or explicit), and exposing someone's sexual orientation or gender identity without consent.\n\n* **Sexual Harassment:** Unwanted sexual advances, objectification, degrading comments about sexual practices, sharing intimate images without consent.\n\n* **Hateful Conduct:** Any behavior promoting violence or hatred based on protected characteristics (race, ethnicity, religion, gender, sexual orientation, etc.). This includes using slurs (unless used self-referentially and with clearly indicated positive intent), supporting hate groups, and displaying hateful symbols (with exceptions for historical context, like pre-1933 artifacts). Specific allowances are made for the Confederate battle flag under very specific historical and non-hateful contexts.\n\n* **Off-Platform Abuse:**  Whatnot may take action against users coordinating harassment or hate off-platform that impacts the Whatnot community, even in rare instances where the off-platform behavior poses a significant threat to the platform.\n\nEnforcement actions against accounts may include removal.  The severity and persistence of the behavior are considered when evaluating violations.\n",
    "last_update_summary": "### Competitor Policy Analysis: Whatnot Hate and Harassment Policy (New)\n\n**Key Change (Based on Diff):** This diff introduces a **new, comprehensive Hate and Harassment Policy** for Whatnot, effective August 21, 2024. It formalizes and extensively details prohibited behaviors to foster a safe and respectful environment on their platform.\n\n---\n\n**Summary for Product Manager:**\n\nWhatnot has launched a detailed, multi-faceted policy strictly prohibiting hate and harassment. Key areas covered include:\n\n*   **Harassment:**\n    *   **Definition:** Content or behaviors that demean or threaten individuals.\n    *   **Prohibited actions:** Unwanted conduct/contact (e.g., targeting, repeated insults, misusing contact info), personal attacks (e.g., based on appearance, intellect, doctored content), repeated disparagement (e.g., sellers demeaning buyers, extended negative campaigns across streams/DMs), and various forms of threats and harmful wishes (e.g., wishing death/disease, doxing sexual orientation/gender identity, glorifying self-harm).\n    *   *Note:* Exceptions for discussing newsworthy events or public figures.\n\n*   **Sexual Harassment:**\n    *   **Definition:** Unwanted sexual advances, sexual objectification, or degrading attacks about an individual's sexual practices.\n    *   **Prohibited actions:** Unwanted romantic approaches, sexual objectification (e.g., comments on body parts, encouraging adult content site participation, asking hosts for sexually suggestive poses), disparagement based on perceived sexual practices, and sharing/threatening intimate images/audio without consent.\n\n*   **Hateful Conduct:**\n    *   **Definition:** Promoting violence or hatred based on a comprehensive list of protected characteristics (e.g., race, gender, sexual orientation, disability, religion).\n    *   **Prohibited actions:** Expressing intolerance/hatred, sexualizing/demeaning/dehumanizing protected groups, mimicking race to mock, encouraging violence against protected groups, mocking/celebrating/denying hate crimes, racial slurs (with nuance for self-referential use), support for hate groups, and harmful stereotypes.\n    *   **Specific Prohibited Imagery:** Nazi propaganda, most Swastika depictions (narrow historical exceptions), grotesque/derogatory Black Americana depictions (e.g., Gollywog dolls), and live/recorded/photography of blackface/yellowface/redface/brownface.\n    *   **Nuanced Allowance for Confederate Battle Flag:** Permitted only on historically accurate miniatures/models, artistic depictions denouncing the flag/slavery, or Civil-War themed book/video game covers without hateful context.\n\n*   **Off-platform Abuse:**\n    *   **Significant Expansion:** Whatnot reserves the right to take action based on verifiable evidence of:\n        *   Off-platform coordination of harassment or hate intended to occur on Whatnot (e.g., encouraging social media followers to target users on Whatnot).\n        *   Severe and persistent off-platform hate or harassment that poses a significant threat to the Whatnot community or individuals, even if not directly coordinated on-platform.\n\n**Implications for Product:** This new policy signifies a robust commitment to safety, requiring strong content moderation tools, efficient reporting mechanisms, and potentially proactive detection strategies for complex behaviors (e.g., off-platform coordination, nuanced hateful imagery). It also necessitates clear internal guidelines and training for policy enforcement teams.",
    "last_updated": "2025-07-21T06:43:05.114907Z"
  },
  "whatnot-how-to-report": {
    "policy_name": "Whatnot How To Report",
    "initial_summary": "## Whatnot User Reporting and Investigation Policy Summary\n\n**Key Points:**\n\n* **Reporting Methods:** Users can report suspicious behavior via in-app reporting features during livestreams, in direct messages (DMs), on product listings, or user profiles (Android & Web).  Email reports to trustandsafety@whatnot.com are also accepted.  All reports are anonymous.\n* **Reporting Locations:** Reporting options are available within livestreams (for buyers and sellers), in-live chat, DMs, product listings, and user profiles (Android/Web).\n* **Investigation Process:** Whatnot's Trust & Safety team investigates reports, analyzing data, reviewing livestreams, and potentially temporarily suspending users during investigations. Outcomes are not publicly disclosed.\n* **Proactive Monitoring:**  The Trust & Safety team proactively investigates potential policy violations based on data analysis and community reports, taking action against users exhibiting patterns of abuse.\n\n",
    "last_update_summary": "# Whatnot Policy Update: User Reporting & Investigation (New Policy)\n\nThis diff indicates the **introduction of a new, comprehensive policy page** on Whatnot detailing how users can report others and how their Trust & Safety (T&S) team investigates these reports.\n\n### Key Information for Product Managers:\n\n*   **Centralized Reporting Guide:** This document consolidates all user reporting pathways and clarifies the investigation process.\n*   **Multiple Reporting Channels:** Users are instructed on how to report directly within the platform (during livestreams, in chat, in DMs, on product listings, and on user profiles - Android/Web only) or via email to `trustandsafety@whatnot.com`.\n*   **Anonymity:** All reports are explicitly stated to be anonymous.\n*   **Investigation Process:**\n    *   Whatnot's T&S team investigates facts, analyzes user history/data, and reviews livestreams for evidence.\n    *   Temporary suspensions of features (e.g., ability to go live) may occur during active investigations.\n    *   Investigation outcomes are not disclosed due to privacy.\n*   **Proactive Enforcement:** The T&S team also proactively launches investigations based on data analysis and community reports, monitoring for patterns of policy abuse and taking action accordingly.\n\n### Key Change (Based on Diff):\n\nThe primary change is the **creation and publication of this detailed guide**. Previously, such comprehensive, consolidated information might have been scattered or less accessible. This new page aims to:\n*   **Empower users** by clearly outlining how and where to report violations.\n*   **Manage user expectations** regarding the investigation process and outcome transparency.\n*   **Reinforce commitment to safety** by detailing T&S procedures.",
    "last_updated": "2025-07-21T06:43:15.285736Z"
  },
  "whatnot-moderator-guidelines": {
    "policy_name": "Whatnot Moderator Guidelines",
    "initial_summary": "## Whatnot Moderator Guidelines Summary\n\n**Key Points:**\n\n* **Goal:** Maintain a safe and fun marketplace by empowering moderators to manage livestream chats effectively.  Moderation should be fair and unbiased, prioritizing community safety and a positive user experience.\n\n* **Moderator Responsibilities:**\n    * Remove users only for violations of Community Guidelines or at the seller's request.  Avoid banning users for differing opinions.\n    * Maintain a respectful and engaging chat environment.\n    * Address inappropriate messages promptly, escalating to warnings before bans.\n    * Seek seller feedback.\n\n* **Moderator Privileges:**\n    * Remove users from a specific livestream (not a platform-wide ban).\n    * View muted chat messages.\n\n* **Adding/Removing Moderators:** Sellers can add moderators during or before a livestream via the scheduling section or by selecting the \"Allow to Moderate\" option from a user's chat profile.  Removal is done similarly using the \"Remove Moderator\" option.\n\n* **Underlying Principle:**  Moderation should be proactive and fair, guided by Whatnot's Community Guidelines and a principle of leading by example, not force.\n",
    "last_update_summary": "## Whatnot Moderator Guidelines - New Policy Summary\n\n**Date:** June 6, 2025\n**Document:** New Moderator Guidelines policy page (`2025-07-21T064121Z.html`)\n\n### Key Changes (Based on New File Creation):\n\nThis diff represents the **introduction of comprehensive Moderator Guidelines** on Whatnot's platform. Previously, explicit, publicly documented guidelines for community-appointed moderators may not have been as detailed or centralized. This new policy formalizes the role, responsibilities, and limitations of moderators.\n\n### Policy Summary for Product Manager:\n\nThis new policy outlines **Whatnot's official expectations and responsibilities for user-appointed livestream moderators**, aiming to enhance safety and community management.\n\n**Key Highlights:**\n\n1.  **Vision & Principle:** Positions good moderation as \"key to successfully managing our community and maintaining compliance\" with Community Guidelines, guided by \"lead by example, not by force.\"\n2.  **Core Responsibilities:**\n    *   Maintain a safe and fun platform by ensuring chat adheres to seller and platform behavior/content standards.\n    *   Act with **unbiased actions** and based on community guidelines.\n    *   Engage chat, answer questions, and delete inappropriate messages.\n    *   Issue **verbal warnings first** before removal.\n3.  **Prohibited Actions:**\n    *   **Do not abuse powers.**\n    *   **Do not ban users for disagreements or opinions.**\n    *   Only remove/report users if actions directly warrant it, or if the seller requests.\n4.  **Moderator Privileges:**\n    *   **Remove Users From Show:** This is a temporary removal from the *current* livestream only; it does not ban the user from Whatnot or future streams by the same seller.\n    *   **View Muted Chat Messages:** Mods can see messages filtered by global settings or the seller's muted word list.\n5.  **Moderator Management:** Sellers maintain full control to add or remove moderators before or during a live stream directly from the platform.\n\n**Implication:** This policy aims to standardize moderation behavior, reduce potential for abuse of power, clarify moderator capabilities, and empower sellers with clear guidance on leveraging this community management feature. It emphasizes a user-centric approach to safety and community building.",
    "last_updated": "2025-07-21T06:43:22.710419Z"
  },
  "youtube-community-guidelines": {
    "policy_name": "Youtube Community Guidelines",
    "initial_summary": "## YouTube's Trust & Safety Policy Summary:\n\nThis document outlines YouTube's approach to content moderation, creator support, and combating abuse.  Key points include:\n\n* **Content Moderation:**  YouTube uses automated systems and human reporting to identify and remove content violating Community Guidelines and Advertiser-Friendly Content Guidelines. Exceptions are made for content with clear educational, documentary, scientific, or artistic value (EDSA).\n\n* **Creator Support:**  The YouTube Partner Program (YPP) offers revenue sharing to eligible creators who meet stricter content standards.  Creators have tools to manage comments and their channel's community interactions.  YouTube provides resources to support creator privacy and safety.\n\n* **Combating Abuse:** YouTube actively works to remove content promoting violent extremism or criminal organizations, collaborating with government entities and organizations like the GIFCT.\n\n* **Appeals Process:** Creators can appeal decisions regarding content removal or YPP suspension.\n\n\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of the provided text for a product manager:\n\n---\n\n### Policy Page Analysis: YouTube Community Guidelines (New File)\n\n**Date of Policy Snapshot:** 2025-07-21\n\n**Key Change Based on Diff:**\nThis diff represents the *introduction* of a brand new, comprehensive \"Our Policies\" page within YouTube's \"How YouTube Works\" section. It's not a revision of an existing policy, but the establishment of a dedicated hub explaining YouTube's content governance.\n\n**Summary for Product Manager:**\n\nThis new policy page serves as a transparent and consolidated resource outlining YouTube's approach to content governance, balancing free expression with platform safety and creator support.\n\n**Key areas covered:**\n\n1.  **Policy Mechanics:**\n    *   Explains the interplay between **Community Guidelines (CG)** and **Advertiser-Friendly Content Guidelines (AFCG)**.\n    *   Details enforcement through **automated detection and human reporting**, emphasizing efforts to prevent wide viewing of violative content.\n    *   Highlights **EDSA (Educational, Documentary, Scientific, or Artistic)** exceptions for CG.\n    *   Confirms the **appeals process** for content removals and YouTube Partner Program (YPP) suspensions.\n2.  **Creator Support & Incentives:**\n    *   Emphasizes the **YouTube Partner Program (YPP)** as a core incentive for creators to adhere to policies via a revenue-sharing model.\n    *   Notes that YPP eligibility requires adherence to **monetization policies** and channel reviews.\n    *   Lists various **creator tools** for content and community management:\n        *   Channel Guidelines (setting conversation norms)\n        *   Comment moderation (holding for review, hiding individuals, blocking words)\n        *   Privacy & Safety Resources.\n3.  **Abuse Combatting & Partnerships:**\n    *   States a clear prohibition on content promoting violent extremist or criminal organizations.\n    *   Highlights YouTube's role as a founding member of the **Global Internet Forum to Counter Terrorism (GIFCT)**, demonstrating collaboration with industry experts to combat such content.\n\n**Implication for PMs:** This new page centralizes and clarifies the reasoning behind YouTube's content policies, how they are enforced, and how creators are supported and incentivized to comply. It offers increased transparency to users, creators, and advertisers on the platform's safety efforts and operational principles.",
    "last_updated": "2025-07-21T06:43:33.654351Z"
  },
  "youtube-harassment-policy": {
    "policy_name": "Youtube Harassment Policy",
    "initial_summary": "## YouTube Harassment & Cyberbullying Policy Summary\n\nThis policy prioritizes the safety of creators, viewers, and partners.  Key prohibitions include:\n\n* **Harassment:** Prolonged insults or slurs targeting individuals based on protected group status, physical attributes, or victimhood (sexual assault, abuse, etc.).  A stricter approach is taken for content targeting minors.\n* **Doxxing & PII Sharing:** Sharing or threatening to share non-public personally identifiable information (PII),  except for widely available public information or clearly marked fake PII used for educational purposes.\n* **Abusive Behavior:** Encouraging brigading or other forms of coordinated abuse. Promoting harmful conspiracy theories linked to threats or violence.\n* **Threats & Violence:**  Threats against individuals or their property (including implicit threats), depictions of staged meet-ups to falsely accuse individuals, vigilante violence, or content glorifying or mocking death/injury.  This also includes realistic simulations of violence or death.\n* **Stalking & Sexualization:** Stalking, unwanted sexualization, sharing non-consensual intimate imagery, or fantasizing about/threatening sexual assault.\n\n**Exceptions:**  Content may be allowed if the primary purpose is educational, documentary, scientific, or artistic (e.g., debates, scripted performances, harassment awareness content). However, these exceptions do not excuse malicious harassment, especially based on protected group status.\n\n**Enforcement:** Violations result in content removal and email notification.  First-time offenders receive a warning with a policy training option.  Multiple violations or severe abuse can lead to strikes, channel suspension, or termination.  Repeat offenders may be prevented from accessing future policy trainings.  The policy applies to videos, comments, livestreams, and external links.\n",
    "last_update_summary": "### Harassment & Cyberbullying Policy Update: Key Changes\n\n**Date of Policy Snapshot:** 2025-07-21\n\nThis document outlines YouTube's comprehensive and significantly expanded Harassment & Cyberbullying Policy. While the `new file mode` indicates this is a full policy introduction or overhaul, the key \"changes\" represent a sharpened focus and detailed approach to combating harassment on the platform.\n\n**Key Policy Changes & Focus Areas:**\n\n1.  **Expanded Definition of Harassment:**\n    *   **Intrinsic Attributes & Protected Groups:** Explicitly prohibits \"prolonged insults or slurs\" based on physical traits, intrinsic attributes, or protected group status.\n    *   **Minors:** Stricter stance against content intended to \"shame, deceive or insult a minor\" (under 18), including name-calling.\n    *   **Doxxing (PII Sharing):** Detailed prohibition of sharing non-public Personally Identifiable Information (PII), including accidental sharing. Clarifies exceptions for publicly available official/business information and the need to clearly indicate fake PII.\n    *   **Brigading:** New explicit prohibition against encouraging \"coordinated abuse of an identifiable individual\" on or off YouTube.\n    *   **Harmful Conspiracy Theories:** Bans content promoting or targeting individuals based on harmful conspiracy theories linked to direct threats or violence.\n    *   **Expanded Threat Categories:** Includes implicit threats (e.g., featuring a weapon without specifying time/place).\n    *   **New Prohibited Content Types:**\n        *   Staged meet-ups to accuse individuals of egregious misconduct with minors (without law enforcement).\n        *   Vigilante behavior (restraining/assaulting individuals, dangerous vehicle pursuits).\n        *   Reveling in or mocking the death/serious injury of identifiable individuals.\n        *   Realistic simulations of deceased individuals describing their death/violence.\n        *   Creator-simulated acts of serious violence against others.\n        *   Denying/minimizing victimhood in well-documented violent events.\n        *   Comprehensive \"Unwanted Sexualization\" including lewd descriptions, NCII distribution, and support for sexual assault.\n\n2.  **Broadened Scope of Enforcement:**\n    *   Policy now explicitly applies to **all YouTube products or features**, including videos, descriptions, comments, and live streams.\n    *   **External Links:** Violations via clickable URLs, verbal directions to other sites, and violative URLs within video metadata are explicitly covered.\n\n3.  **Refined Exceptions:**\n    *   Maintains exceptions for educational, documentary, scientific, or artistic content (e.g., debates involving high-profile officials, scripted satire, harassment awareness).\n    *   **Critical Note:** Exceptions do not apply to content maliciously insulting someone based on their protected group status, regardless of their public profile.\n\n4.  **Updated Enforcement & Penalties:**\n    *   **Warning System with Training:** First-time violations result in a warning with an option to take a policy training. Completing the training allows the warning to expire after 90 days. Repeat violations of the *same* policy within the 90-day window will lead to a strike.\n    *   **Monetization Penalties:** Introduces specific conditions for potential content removal or other penalties beyond standard strikes, such as:\n        *   Repeatedly encouraging abusive audience behavior.\n        *   Repeatedly targeting/abusing an identifiable individual based on intrinsic attributes across multiple uploads.\n        *   Exposing individuals to physical harm risks based on local context.\n        *   Inciting hostility between creators for personal financial gain.\n\n**Implications for Product Managers:**\n\n*   **Increased Moderation Complexity:** The expanded scope and specificity of prohibited behaviors will likely increase moderation volume and the nuance required for content review.\n*   **User Education & Communication:** The new warning system with policy training highlights a need for clear communication and accessible training materials for creators. This could impact user retention by offering a corrective path.\n*   **Reporting & Tooling:** May require updates to user reporting flows and internal moderation tools to accurately categorize and action the new and refined types of harassment.\n*   **Feature Design:** Review existing and future product features (e.g., live chat, community posts, short-form video) to ensure they align with these stricter definitions and minimize opportunities for policy violations.\n*   **Creator Impact:** Creators, especially those engaging in commentary or debate, will need to be well-informed of the detailed guidelines, particularly around \"intrinsic attributes,\" \"protected group status,\" and the new categories of prohibited content (e.g., simulations, vigilantism). This could affect content strategies and creator-to-creator interactions.",
    "last_updated": "2025-07-21T06:43:50.736085Z"
  },
  "youtube-shopping-ads-policy": {
    "policy_name": "Youtube Shopping Ads Policy",
    "initial_summary": "## Google Shopping Ads Policies: Summary for Product Managers\n\nThis document outlines Google's policies for Shopping ads, aiming for a trustworthy and transparent advertising ecosystem.  Key areas covered are:\n\n**1. Prohibited Content:**  This includes counterfeit goods, dangerous products (drugs, weapons, explosives), products enabling dishonest behavior (hacking tools, fake documents), and inappropriate content (hate speech, violence, cruelty).  Certain content lacks optimal support and is therefore unsupported in Shopping ads, though this doesn't affect other Google platforms.\n\n**2. Prohibited Practices:** This section addresses abuse of the ad network (malicious content, unfair advantages, bypassing reviews), irresponsible data collection and use (insecure data handling), and misrepresentation (misleading promotions, inaccurate product portrayal).\n\n**3. Restricted Content:**  This category covers legally or culturally sensitive content allowed with limitations and potential additional requirements. Examples include adult-oriented content, alcoholic beverages, copyrighted material, gambling, healthcare products, political content, and High Fat Sugar Salt (HFSS) food & beverages (prohibited from targeting minors).\n\n**4. Editorial & Technical Requirements:**  Ads must meet high professional and editorial standards, be clear, and lead to relevant, user-friendly landing pages. Technical requirements ensure ad functionality across various formats.\n\n**Enforcement:** Google uses AI and human review to enforce policies, taking actions ranging from disapproving ads to suspending accounts for violations.  Advertisers can appeal decisions.  Compliance with all applicable laws and regulations is mandatory.\n",
    "last_update_summary": "Here's a concise summary of the provided policy text for a Product Manager:\n\n### New Policy: YouTube Shopping Ads Policy (Effective 2025-07-21)\n\nThis diff indicates the **introduction of a comprehensive new policy document** specifically for \"Shopping ads policies\" on YouTube. It outlines the rules and guidelines for advertisers on the platform.\n\n**Key Takeaways:**\n\n1.  **New Dedicated Policy:** This document establishes a standalone policy center for Shopping ads, emphasizing a trustworthy and transparent digital advertising ecosystem.\n2.  **Enforcement Overview:** It clearly states that policy compliance is ensured through a combination of **Google AI and human evaluation**, with actions ranging from ad disapproval to account suspension for violations. An appeal process is also mentioned.\n3.  **Four Core Policy Areas:** The policy is structured into four main categories:\n    *   **Prohibited Content:** Content never allowed (e.g., counterfeit goods, dangerous products, dishonest behavior enablers, inappropriate/harmful content, certain content unsupported by Shopping ads).\n    *   **Prohibited Practices:** Actions advertisers cannot take (e.g., abuse of the ad network, irresponsible data collection/use, misrepresentation/deception).\n    *   **Restricted Content:** Content allowed with limitations (e.g., adult-oriented, alcoholic beverages, copyrighted material, gambling, healthcare, political content, trademarks, and High Fat Sugar Salt (HFSS) Food & Beverage). Restrictions often depend on location and may require pre-authorization.\n    *   **Editorial and Technical:** Quality standards for ads and websites (details not included in the provided snippet but mentioned as a category).\n4.  **Immediate Operational Note:** The policy begins with a critical announcement about the **temporary pausing of Google ads for advertisers based in Russia and serving to users in Russia**, due to the ongoing war in Ukraine.\n\n**Impact for Product Manager:**\nThis new policy signifies a structured approach to governing Shopping ads content on YouTube, emphasizing user safety, legal compliance, and a clear enforcement framework. The AI + human review process and the explicit categories provide a predictable environment for advertisers, while the initial Russia-Ukraine statement highlights immediate operational considerations.",
    "last_updated": "2025-07-21T06:44:06.067804Z"
  },
  "instagram-community-guidelines": {
    "policy_name": "Instagram Community Guidelines",
    "initial_summary": "# Competitor Policy Summary:\n\nThis document outlines Meta's Community Standards, encompassing policies for Facebook, Instagram, Messenger, and Threads.  Key areas covered include:\n\n* **Content Moderation:**  Policies define acceptable and unacceptable content, addressing issues like hate speech, violence, harassment, misinformation, and illegal activities.  A three-part enforcement approach (remove, reduce, inform) is used.  Newsworthiness and public interest are considered when evaluating potentially violating content.\n\n* **Account Integrity:** Policies cover authentic identity, inauthentic behavior, and account security.\n\n* **Safety & Well-being:**  Emphasis is placed on user safety, privacy, and dignity.  Specific attention is given to protecting minors, addressing issues like child exploitation and suicide/self-harm.\n\n* **Transparency & Enforcement:**  The document details how Meta detects and addresses policy violations, including technological solutions and human review.  Transparency reports on enforcement, intellectual property, government data requests, and content restrictions are publicly available.\n\n* **Governance & Appeals:**  Information is provided about Meta's Oversight Board, its role in policy appeals, and its impact.\n\n* **Research & Data:** Access to research tools and datasets related to content and advertising is highlighted.\n\n\nThe policy aims to balance freedom of expression with the need to maintain a safe and respectful online environment.  The US English version is considered the primary and most up-to-date document.\n",
    "last_update_summary": "This document is a **new snapshot of Instagram's Community Guidelines, dated July 21, 2025**. While the diff shows it as a completely new file, for a Product Manager, the \"key changes\" are the *contents and explicit statements* introduced in this version.\n\nHere's a concise summary of the key updates in this policy snapshot:\n\n---\n\n### Competitor Policy Analysis: Instagram Community Guidelines (2025-07-21 Snapshot)\n\nThis policy snapshot introduces the full scope of Instagram's (and Meta's broader platforms') Community Guidelines as of July 21, 2025. Key points for product consideration include:\n\n*   **Expanded Platform Scope:** Explicitly states the guidelines apply to **Facebook, Instagram, Messenger, and Threads**, clarifying the unified policy approach across Meta's core communication platforms.\n*   **AI-Generated Content Coverage:** The Community Standards now explicitly apply to \"all types of content, **including AI-generated content**,\" formalizing a stance on emerging content modalities.\n*   **Enforcement Nuance for Ambiguous Content:** Introduces a clause allowing content removal for \"ambiguous or implicit language\" when additional context reasonably indicates a violation, enhancing enforcement flexibility.\n*   **Reinforced Core Values:** Reaffirms **Authenticity, Safety, Privacy, and Dignity** as the four paramount values guiding content moderation and expression limits.\n*   **Increased Transparency & Reporting:** Introduces new transparency reports, notably the **\"Widely Viewed Content Report\"** and **\"Regulatory and Other Transparency Reports,\"** indicating a broader commitment to public data disclosure.\n*   **Dedicated Policy Focus Areas:** Highlights specific approaches to issues like the \"opioid epidemic\" and \"Additional Protection of Minors,\" suggesting elevated attention and specific policy development in these areas.\n*   **Standardized Policy Structure:** Each policy section will feature a \"Policy Rationale\" followed by explicit rules on what's prohibited, or what's allowed with warnings/age restrictions.",
    "last_updated": "2025-07-21T06:41:55.255016Z"
  },
  "instagram-appeal-process": {
    "policy_name": "Instagram Appeal Process",
    "initial_summary": "Here's a concise summary of Instagram's Oversight Board appeal policy for a Product Manager:\n\n### Instagram Oversight Board Appeal Policy Summary\n\n**Key Points:**\n\n*   **Purpose:** Allows users to appeal Instagram's content decisions (both on their own content or content they reported) to an independent Oversight Board (OB).\n*   **Prerequisite:** Users **must** first exhaust Instagram's internal review process, including two internal reviews of the decision, before becoming eligible to appeal to the OB.\n*   **Appeal Types:**\n    *   Decisions to take down a user's content.\n    *   Decisions not to remove content a user reported.\n*   **Eligibility & Selection:** Not all content decisions are eligible for OB appeal. The OB itself selects only a limited number of eligible appeals for review and may not choose a specific case.\n*   **Timeline:** Appeals to the OB must be submitted within **15 days** of Instagram's final decision.\n*   **Status Check:** Users can track their appeal status on the Oversight Board's website using a reference number.",
    "last_update_summary": "### Summary of New Instagram Oversight Board Appeal Policy\n\nThis new policy page details Instagram's process for users to escalate content decisions directly to the Oversight Board.\n\n**Key Policy Points:**\n\n*   **Two Types of Appeals:** Users can now appeal decisions made by Instagram regarding:\n    1.  Their own content that was removed.\n    2.  Content they reported from others that was *not* removed by Instagram.\n*   **Mandatory Internal Review:** Before appealing to the Oversight Board, users must first exhaust Instagram's internal \"request a review\" process. An appeal to the Board is generally available if Instagram has reviewed the content twice and the user still disagrees.\n*   **Oversight Board Discretion:** The Oversight Board independently selects which eligible appeals to review; not all submissions will be chosen.\n*   **Strict Time Limit:** Users have a 15-day window from the date of Instagram's final decision to submit an appeal to the Oversight Board.\n*   **Expanding Eligibility:** The policy notes that while not all content decisions are currently eligible, more options are being added.\n\n**Key Change (Based on Diff):**\n\nThis `diff` indicates the *introduction* of a comprehensive, dedicated help center page outlining the formal process for users to appeal Instagram's content decisions (both content removed and content not removed) to the external Oversight Board. It formalizes and clarifies the escalation path beyond internal review mechanisms, including prerequisites and time limits.",
    "last_updated": "2025-07-21T06:41:31.809931Z"
  },
  "instagram-blocking-people": {
    "policy_name": "Instagram Blocking People",
    "initial_summary": "Here's a concise summary of the provided policy text for a Product Manager:\n\n### Instagram \"Blocking People\" Policy Summary\n\nThis policy details Instagram's \"Blocking People\" feature, a core safety and privacy control.\n\n**Key Points:**\n\n*   **Core Functionality:** Explains how users can block and unblock other accounts.\n*   **Impact of Blocking:**\n    *   Removes all past comments and likes from the blocked user.\n    *   Clarifies that a blocked user generally cannot see the blocker's content, message them, or mention them.\n    *   Provides guidance on how to view and manage a list of blocked accounts.\n*   **Related Privacy & Safety Controls:** The document also references other related user controls available in the \"Privacy, Security & Reporting\" section, including:\n    *   Making an account private.\n    *   Removing followers.\n    *   Restricting users (a softer form of control than blocking).\n    *   Temporarily limiting interactions from others.\n    *   Reporting messages or accounts.\n\nThis policy emphasizes user control over their interactions and visibility on the platform.",
    "last_update_summary": "As a Trust & Safety analyst, here's a concise summary of the provided policy update for a Product Manager:\n\n### Key Changes: New \"Blocking People\" Help Center Page\n\nThis diff introduces a **new, comprehensive Help Center article specifically dedicated to \"Blocking People\"** on Instagram. This is not a modification of an existing policy but rather the creation of a new resource to guide users.\n\n**Key Content & User Features Covered:**\n\n*   **Core Blocking Functionality:** Explains how to block/unblock users, what happens post-block (e.g., impact on comments/likes, mentions), and how to manage blocked lists.\n*   **Related Safety Controls:** The page also details alternative or complementary features such as:\n    *   **Restricting/Unrestricting** users.\n    *   **Removing followers.**\n    *   **Temporarily limiting interactions** from others.\n    *   Setting an account to **private.**\n*   **Reporting Mechanisms:** Briefly mentions reporting messages or chats within the context of managing unwanted interactions.\n\n**Product Manager Takeaway:**\nThis new page consolidates and clarifies user controls around unwanted interactions, covering not only direct blocking but also a suite of related safety and privacy features. It aims to empower users with more robust options for managing their experience and online safety.",
    "last_updated": "2025-07-21T06:41:36.262386Z"
  },
  "instagram-commerce-policies": {
    "policy_name": "Instagram Commerce Policies",
    "initial_summary": "### Competitor Policy Page Analysis: Unavailable Page\n\nThe provided text is an error message from Instagram's Help Center, indicating that a specific page is unavailable.\n\n**Key Points:**\n\n*   **Core Message:** \"This Page Isn't Available.\"\n*   **Reasons for Unavailability:** The page may be unavailable due to a broken link or because it has been removed.\n*   **User Guidance:** Users are advised to check if the link they are trying to open is correct.\n*   **Navigation Options:** The page provides clear calls to action to return to the Help Center Home or go back to the previous page.\n*   **T&S Relevance:** This page demonstrates how a competitor handles missing or removed content (potentially policy or help documentation), which impacts user experience and trust. It emphasizes the need for clear communication and alternative navigation when users encounter inaccessible information.",
    "last_update_summary": "**Trust & Safety Analyst Summary for Product Manager**\n\n---\n\n### **Instagram Commerce Policies - Page Unavailability**\n\n**Key Change:** A new snapshot (dated 2025-07-21) for the Instagram Commerce Policies page (`/instagram-commerce-policies/`) has been captured, but its content indicates that \"This Page Isn't Available.\"\n\n**Summary:**\nThe diff shows the creation of a new snapshot file for Instagram's commerce policies. However, the content of this snapshot is an error page stating that the link may be broken or the page removed.\n\n**Implications for PM/T&S:**\n*   **Policy Removal/Unavailability:** As of the snapshot date, the Instagram Commerce Policies page appears to be inaccessible or has been removed.\n*   **Impact on Commerce Features:** This could significantly impact understanding, enforcing, and developing features related to commerce on Instagram, as a key policy document is missing or inaccessible.\n*   **Action Required:** It is critical to determine if this removal is intentional (e.g., policy consolidation, deprecation of commerce features), if the page has moved, or if it represents a technical error. If intentional, T&S will need clarity on where relevant commerce policies now reside.\n\n---",
    "last_updated": "2025-07-21T06:41:41.026876Z"
  },
  "tiktok-blocking-users": {
    "policy_name": "Tiktok Blocking Users",
    "initial_summary": "Here's a concise summary of the competitor's policy page for a Product Manager:\n\n### Competitor Policy Page Summary\n\nThe competitor's policy documentation serves as a comprehensive help center, detailing an exceptionally broad range of platform functionalities, from core features to advanced creator tools and monetization.\n\n**Key Trust & Safety Takeaways:**\n\n*   **Robust User Control & Safety Tools:** A significant focus is placed on empowering users with safety mechanisms. Detailed instructions for blocking (individual users, multiple users from comments, unblocking) are prominently featured, alongside mentions of a \"Safety Center,\" \"Community Guidelines,\" and \"Report a problem\" functionality.\n*   **Comprehensive Feature & Content Coverage:** The policies span an extensive array of content types and features including user-generated videos, AI-generated content, creator tools, live streaming, e-commerce (\"TikTok Shop\"), messaging, and content discovery, indicating a complex ecosystem requiring broad T&S oversight.\n*   **Creator Monetization & Ecosystem:** Policies extend to creator monetization features (LIVE, Gifts, promotion tools), necessitating guidelines for commercial activities, fraud prevention, and responsible content creation related to earning.\n*   **Legal & Policy Framework:** The document points to a foundational set of legal and policy resources, including Terms of Use, Privacy, Copyright, and Law Enforcement guidelines, signifying a structured approach to compliance and trust.\n*   **Algorithmic Transparency & Global Reach:** It touches on content recommendation algorithms (\"How TikTok recommends content\") and highlights a vast global operational scope through an extensive list of supported languages, implying a need for culturally nuanced and legally compliant T&S policies worldwide.",
    "last_update_summary": "### Summary of TikTok's \"Blocking Someone\" Policy Page\n\n**Key Change based on Diff:**\nThis diff indicates the **introduction of a brand new help page** titled \"Blocking someone\" on TikTok's support site. This signals a formalization and clearer documentation of user safety features.\n\n**Core Functionality Detailed:**\n\n*   **Purpose of Blocking:** Blocking prevents a user from viewing your posts, sending direct messages, commenting, following, or liking your content.\n*   **How to Block (Single User):** Users can block someone by navigating to their profile, tapping the \"Share\" button, and selecting \"Block.\"\n*   **How to Unblock (Single User):** The process is similar to blocking: go to the person's profile, tap \"Share,\" and select \"Unblock.\"\n*   **How to Block Multiple Users (from Comments):** TikTok offers a batch blocking feature. From your video's comments section, users can long-press a comment (or use the \"Filters\" button) to \"Manage multiple comments,\" select several accounts, and then choose \"Block accounts.\"\n\n**Product Manager Takeaway:**\nThis new page emphasizes TikTok's commitment to user control and safety by providing explicit, step-by-step instructions for blocking unwanted interactions. The inclusion of a \"block multiple accounts\" feature from comments is notable for managing harassment or spam efficiently. This documentation solidifies user understanding of a critical privacy tool.",
    "last_updated": "2025-07-21T06:42:02.866092Z"
  },
  "youtube-hiding-users": {
    "policy_name": "Youtube Hiding Users",
    "initial_summary": "As a Trust & Safety analyst, here is a concise summary of the provided policy document on YouTube's \"Hide users from your channel\" feature for a Product Manager:\n\n---\n\n### YouTube: \"Hide Users from Your Channel\" Policy Summary\n\nThis policy outlines a channel moderation feature allowing content creators to control who can interact with their content.\n\n**Key Functionality:**\n\n*   **Purpose:** Channel owners can \"hide\" specific viewers to prevent their comments from appearing on the channel and to stop them from creating clips from videos or live streams.\n*   **Impact on Hidden User:**\n    *   All previous comments from the hidden user on the channel will be hidden within 48 hours.\n    *   Future comments from the hidden user will not appear.\n    *   The hidden user will **not** receive a notification that they have been hidden.\n*   **Methods to Hide:**\n    1.  **From a Comment:** Select \"More\" next to a user's comment, then \"Hide user from channel.\"\n    2.  **Via YouTube Studio:** In \"Settings\" > \"Community\" > \"Automated Filters,\" paste the user's channel URL into the \"Hidden users\" box.\n*   **Managing Hidden Users:**\n    *   A list of hidden users is available in YouTube Studio under \"Settings\" > \"Community\" > \"Automated Filters.\"\n    *   Users can be \"shown\" (unhidden) from this list, which allows their *future* comments to appear. Previous comments remain hidden.\n*   **Scope:** This is a **channel moderation tool** for managing audience interaction. It is distinct from reporting abuse, harassment, or policy violations, which should be directed to the Safety Center.\n\n---",
    "last_update_summary": "As a Trust & Safety analyst, I've reviewed the competitor's policy page update.\n\n### Summary for Product Manager: YouTube's \"Hide users from your channel\" Policy (New Page)\n\nThis diff indicates the *creation* of a new policy page detailing how creators can \"hide users from their channel.\" This functionality aims to provide creators with more control over their channel's audience and comment sections.\n\n**Key Features and Impacts:**\n\n*   **Expanded Hiding Scope:** Hiding a user now not only removes their comments from the channel (and YouTube Studio's comments page) but also **prevents them from creating clips** from the creator's videos or live streams.\n*   **Methods for Hiding:**\n    *   Directly from a user's comment on the channel/video.\n    *   Via YouTube Studio by pasting the user's channel URL into a \"Hidden users\" list under Community settings.\n*   **Visibility & Management:**\n    *   Creators can easily view and manage their list of hidden users within YouTube Studio's Community settings.\n    *   The policy clarifies how to \"unhide\" a user, enabling future comments, though past hidden comments remain hidden.\n*   **User Experience (Hidden User):** Hidden users **do not receive a notification** when they are hidden.\n*   **Comment Impact:** All previous comments from a hidden user's channel will be hidden within 48 hours. When unhidden, only *future* comments will become visible; past hidden comments remain unseen.\n\n**Implication for us:** This update demonstrates YouTube's continued investment in creator moderation tools, specifically focusing on managing unwanted interactions (comments, and now clips) and providing a clear, user-friendly interface for this control. Our platform should consider similar, clear documentation and potentially expanded functionality for user moderation.",
    "last_updated": "2025-07-21T06:43:56.257557Z"
  }
}