{
  "tiktok-community-guidelines": {
    "policy_name": "Tiktok Community Guidelines",
    "initial_summary": "## TikTok Competitor Community Guidelines Summary\n\nThis document outlines a comprehensive set of community guidelines for a TikTok-like platform, effective May 17, 2024.  Key areas covered include:\n\n* **Content Moderation:**  The platform employs a three-pronged approach: removing violating content, restricting age-inappropriate content (for users under 18), and making ineligible for recommendation (For You feed) content that doesn't meet platform standards.\n\n* **Prohibited Content:**  A wide range of prohibited content is detailed, encompassing: violence, hate speech, sexual abuse, harassment, self-harm, dangerous activities, misinformation, scams, regulated goods (alcohol, firearms, etc.), and violations of privacy and security.  Specific examples are provided within each category, though the document notes that these are not exhaustive.\n\n* **Community Empowerment:** The platform provides users with tools and resources to manage their experience, including safety settings, filtering options, and reporting mechanisms.\n\n* **Enforcement:** While the specifics of enforcement aren't detailed, the document implies a combination of automated and human moderation to address policy violations.\n\nThe guidelines aim to create a safe and welcoming environment while balancing creative expression and the prevention of harm.  The full guidelines are categorized for easier navigation, with additional information and examples available for each section.\n",
    "last_update_summary": "**Summary for Product Manager:**\n\nThe recent update to the Community Guidelines snapshot involves **no substantive changes to the policy content**.\n\n*   **Specific Changes:**\n    *   Minor technical adjustments to image references within the HTML structure (e.g., re-rendering of existing image tags without changing the image source or display).\n    *   Addition of a newline character at the end of the file.\n*   **Impact:**\n    *   **No impact** on policy interpretation, content moderation efforts, or user experience related to policy rules.\n    *   The changes are purely cosmetic/technical and do not reflect any shifts in what is or isn't allowed on the platform.",
    "last_updated": "2026-01-01T02:26:59.954906Z"
  },
  "tiktok-live-moderation": {
    "policy_name": "Tiktok Live Moderation",
    "initial_summary": "# TikTok LIVE Moderation Policy Summary\n\nThis document details TikTok's approach to content moderation during LIVE streams.  Key features include:\n\n* **Creator Controls:** Creators can add moderators, control audience age (18+), filter comments, block keywords, mute, and block viewers directly from the LIVE settings or chat.  This applies to both mobile app and web browser access (via LIVE Studio or OBS Studio for broadcasting; not required for moderation).\n\n* **Moderator Permissions:** Moderators, granted permission by the creator, can mute, block viewers, and report comments violating Community Guidelines.  The level of control a moderator has is determined by the creator.\n\n* **User Actions:**  Viewers can be reported, muted (temporarily), or blocked (preventing future LIVE viewership and other interactions with the creator).  Notifications are sent to muted/blocked users.\n\n* **Accessibility:** Moderation tools are accessible both within the LIVE settings and directly from the LIVE chat interface on both the mobile app and web browser.\n",
    "last_update_summary": "**Concise Summary for Product Manager:**\n\n**Specific Changes:**\n\n*   New security SDKs (`acrawler`, `secsdk_sg`, `secsdk_va`, `secsdk_ttp`) have been integrated into the TikTok Live moderation frontend. These additions include webmssdk.js and secsdk-lastest.umd.js libraries.\n\n**Impact:**\n\n*   **Enhanced Platform Security:** This update significantly strengthens our technical capabilities to detect and mitigate automated abuse, bot activity, spam, and other malicious behaviors occurring on TikTok Live.\n*   **Improved User Trust & Safety:** By deploying these advanced security measures, we anticipate a more authentic and safer environment for both creators and viewers, reducing the prevalence of disruptive and harmful content originating from bad actors.",
    "last_updated": "2026-01-26T13:04:22.533169Z"
  },
  "tiktok-shop-prohibited-products": {
    "policy_name": "Tiktok Shop Prohibited Products",
    "initial_summary": "## Competitor Policy Summary: TikTok Shop Academy (US)\n\nThis document appears to be incomplete or broken.  The provided text only shows a heading related to boosting sales on TikTok Shop Academy and a JavaScript error message.  **No actual policy information is present.**  Therefore, no meaningful summary of their policy can be provided.  Further investigation is needed to obtain the actual policy document.\n",
    "last_update_summary": "**Summary for Product Manager: Competitor Policy Page Analysis**\n\nThis diff indicates the creation of a *new file* for a competitor's \"prohibited products\" policy page (dated 2025-07-20).\n\n**Key Changes:**\n\n*   **New Page Created:** A new policy page `tiktok-shop-prohibited-products` has been added.\n*   **Placeholder Content:** The page's content is currently a generic \"JavaScript not enabled\" message, suggesting it's an unpopulated placeholder or a technical error page, rather than an active policy.\n*   **No Policy Content Detected:** There are no actual policy rules or guidelines present in this version of the page.\n\n**Impact:**\n\nCurrently, there is no substantive policy information to analyze. This appears to be a technical setup or placeholder for a future policy page. We should monitor this URL for updates to identify actual policy content when it becomes available.",
    "last_updated": "2025-07-20T23:50:56.579760Z"
  },
  "whatnot-blocking-a-user": {
    "policy_name": "Whatnot Blocking A User",
    "initial_summary": "## Whatnot User Blocking Policy Summary\n\nThis document details Whatnot's user blocking functionality.  Users can block others to prevent:\n\n* Following\n* Direct messaging\n* Profile viewing\n* Livestream interaction (bookmarking, joining, chatting)\n* Future purchases from listings\n\nExisting orders are unaffected by blocking.  Blocking is currently permanent.  There's no list of blocked users.  Being removed from a livestream is different from being blocked by a user.  Users can report violations of Community Guidelines separately.\n",
    "last_update_summary": "Here's a concise summary for the product manager:\n\n*   **Policy Update:** A minor editorial change was made to the Help Center article \"Block someone on Whatnot.\"\n*   **Specific Change:** The sentence \"The person won’t get a notification when you block them\" was rephrased to \"The person you blocked won’t be notified.\"\n*   **Impact:** There is **no change** to the actual blocking functionality or user experience. Blocked users will still not receive a notification when they are blocked. This update is solely for textual clarity.",
    "last_updated": "2025-09-30T01:50:08.701941Z"
  },
  "whatnot-buyer-protection": {
    "policy_name": "Whatnot Buyer Protection",
    "initial_summary": "# Whatnot Buyer Protection Policy Summary\n\n**Key Points:**\n\n* **Refund Eligibility:** Whatnot offers buyer protection for incomplete/incorrect items, items not as described/inauthentic, and packages not received.  Refunds are generally granted within 30 days of purchase or 14 days of delivery (7 days for certain categories like coins, sneakers, luxury goods; 2 days for plants).  Whatnot may require item return in original condition.  German buyers pay return shipping.\n\n* **Refund Exclusions:**  Consumables (opened/consumed items, breaks except for missing/damaged items), tips, refused deliveries, uncollected packages, unpaid customs fees, exchange rate losses, chargebacks, digital content, off-platform transactions, and instances of suspected fraud are excluded.  Returning the wrong item also voids a refund.\n\n* **Time Limits & Exceptions:**  Specific shorter deadlines apply for certain high-value categories and counterfeit claims (30 days from receipt). Extensions may be granted for international orders, pre-orders, custom orders, and due to natural disasters.  \"Delivered\" but not received items require contact within 14 days.\n\n* **EU/UK Right of Withdrawal:** EU/UK buyers have a 14-day right of withdrawal, requiring item return within 14 days of cancellation.  Buyers are responsible for return shipping costs. This right doesn't apply to breaks, surprise products, or certain unsuitable goods (hygiene, mixed, sealed software/media, customized items, perishable goods).\n\n\n* **High-Value Loss Reimbursement:** A separate policy exists for high-value card losses in breaks, potentially reimbursing market value.\n\n",
    "last_update_summary": "This document introduces Whatnot's comprehensive **Buyer Protection Policy**, effective May 16, 2025. It outlines the conditions under which buyers are eligible for refunds for purchases made on the platform.\n\n**Key Components & Changes Introduced:**\n\n*   **Covered Issues:** Buyers are entitled to refunds for `incomplete/incorrect items`, `items not as described or inauthentic` (damaged, expired, defective, counterfeit), and `packages not received` (lost, delayed, misdelivered). A detailed list of covered issues is provided.\n*   **Refund Request Timelines:**\n    *   **General:** Submit requests within the **earlier of 30 days from purchase or 14 days from delivery**.\n    *   **Category-Specific:**\n        *   **7 days from delivery or 30 days from purchase (earlier of):** Coins & Money, Sports Cards, Sneakers & Streetwear, Trading Card Games, Luxury Goods.\n        *   **2 days from delivery or 30 days from purchase (earlier of):** Plants.\n    *   **Counterfeit Claims:** Must be submitted within **30 days of receiving the order**.\n    *   **\"Marked Delivered, Not Received\":** Contact support within **14 days** of delivery scan.\n*   **Return Requirements:** Whatnot may require item returns in the same received condition. Opening products or removing tags may disqualify or reduce refunds. For Germany, return shipping costs will be deducted from the refund.\n*   **Key Exclusions from Protection:** Refunds are **not** provided for:\n    *   Most `consumable products` once opened/consumed (except for missing/damaged items in \"Breaks\").\n    *   `Tips` to sellers.\n    *   `Refusing delivery` or `failing to pick up` packages.\n    *   `Refusal to pay customs fees` or duties paid.\n    *   `Exchange rate fluctuations`.\n    *   `Orders disputed with financial institutions` (chargebacks).\n    *   `Digital Content`.\n    *   `Potential fraud or abuse of policy` (at Whatnot's discretion).\n    *   `Returning an incorrect item`.\n    *   `Off-platform transactions`.\n*   **Special Policies:**\n    *   **High Value Loss Reimbursement:** Specific policy referenced for missing Sports Cards/Trading Cards in \"Breaks\" based on market value.\n    *   **EU/UK Right of Withdrawal:** Consumers from professional sellers have a statutory right to cancel within 14 days of receipt and return items within 14 days of cancellation, subject to specific conditions and exclusions (e.g., no refunds for \"Breaks\" or \"Surprise Products\", unsealed hygiene items, customized goods). Return shipping costs are the buyer's responsibility.\n\nThis policy emphasizes a structured approach to buyer protection with clear timelines, exclusions, and specific handling for various item categories and international regions.",
    "last_updated": "2025-07-22T00:28:19.690967Z"
  },
  "whatnot-enforcement-actions": {
    "policy_name": "Whatnot Enforcement Actions",
    "initial_summary": "## Whatnot's Trust & Safety Policy: Summary for Product Managers\n\nWhatnot's policy enforces Community Guidelines with penalties escalating based on violation severity and account history.  Violations are cumulative, meaning repeated offenses, even minor ones, can lead to a permanent ban.\n\n**Key Actions & Penalties:**\n\n* **Warnings:** For minor infractions, with guidance provided.\n* **Suspensions:** Temporary account access loss (2 or 7 days).\n* **Selling Access Revoked:**  Loss of ability to sell or go live.\n* **Ban:** Permanent account termination for serious or repeated violations.\n* **Discovery Restriction:** Temporary reduced visibility in feeds/recommendations.\n* **Other Penalties:** Loss of access to features like Direct Messages.\n\n**Account Health & Performance:**\n\n* An Account Health dashboard tracks Seller Performance Rates (fulfillment, shipping) and Policy Standing.\n* Poor performance in either area can result in warnings and penalties.\n* Policy Standing has five levels (Excellent, Good, Fair, Poor, Very Poor), reflecting penalty history.\n\n**Violation Expiration:**\n\n* Most violations expire after 180 days, except for bans and offboarding, which are permanent.\n\n**Appeals:**  Users can appeal penalties via email.\n",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n*   **Change:** The \"Very Poor\" account health tier has been updated. Previously, this tier exclusively resulted in a 7-day suspension and seller access revocation. Now, the initial penalty for a \"Very Poor\" violation can be an **immediate ban**.\n*   **Impact:** This change allows for more severe immediate enforcement actions for the most egregious policy violations, strengthening our ability to remove high-risk users from the platform directly at the \"Very Poor\" tier. It clarifies that subsequent violations, if the initial penalty was a suspension, will still escalate to further suspensions or a ban.",
    "last_updated": "2025-12-19T18:40:34.457741Z"
  },
  "whatnot-hate-and-harassment": {
    "policy_name": "Whatnot Hate And Harassment",
    "initial_summary": "## Whatnot Hate and Harassment Policy Summary\n\nThis policy prohibits hateful conduct and harassment on the Whatnot platform, including sexual harassment and off-platform abuse that impacts the Whatnot community.  Key prohibited behaviors include:\n\n* **Harassment:**  Repeated unwanted contact, personal attacks, targeted obscene language,  using contact information for non-transactional purposes, and disparaging others (sellers disparaging buyers in streams, for example).  Exceptions may be made for newsworthy events or public figures.\n\n* **Threats & Harmful Wishes:** Wishing harm, making threats (implied or explicit), and exposing someone's sexual orientation or gender identity without consent.\n\n* **Sexual Harassment:** Unwanted sexual advances, objectification, degrading comments about sexual practices, sharing intimate images without consent.\n\n* **Hateful Conduct:** Any behavior promoting violence or hatred based on protected characteristics (race, ethnicity, religion, gender, sexual orientation, etc.). This includes using slurs (unless used self-referentially and with clearly indicated positive intent), supporting hate groups, and displaying hateful symbols (with exceptions for historical context, like pre-1933 artifacts). Specific allowances are made for the Confederate battle flag under very specific historical and non-hateful contexts.\n\n* **Off-Platform Abuse:**  Whatnot may take action against users coordinating harassment or hate off-platform that impacts the Whatnot community, even in rare instances where the off-platform behavior poses a significant threat to the platform.\n\nEnforcement actions against accounts may include removal.  The severity and persistence of the behavior are considered when evaluating violations.\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of the provided competitor policy for a Product Manager:\n\n### Whatnot Hate and Harassment Policy - Summary for Product Manager\n\n**Key Change from Diff:**\nThis diff represents the *introduction* of a new, comprehensive **Hate and Harassment Policy** by Whatnot, dated August 21, 2024. This is not an update to an existing policy, but rather the establishment of formal guidelines on these critical safety topics.\n\n**Policy Overview:**\nWhatnot has established a clear and strict policy prohibiting hateful conduct and harassment to foster a safe and respectful environment. Violations may result in account actions, including removal.\n\n**Key Prohibited Behaviors:**\n\n1.  **Harassment:** Content or patterns of behavior that demean or threaten individuals.\n    *   **Unwanted Conduct & Contact:** Targeting individuals with dedicated accounts, repeated obscene/insulting language, continued contact after being asked to stop, or misuse of contact information.\n    *   **Personal Attacks & Repeated Disparagement:** Attacks based on appearance, hygiene, intellect, personality; targeting with negative doctored content; sellers disparaging buyers/others in streams; or repeated/extended disparagement across multiple streams/DMs (e.g., questioning reliability, \"exposing\" others). *Note: Exceptions for newsworthy events or public figures.*\n    *   **Threats & Harmful Wishes:** Wishing death, disease, or physical harm; implied/hypothetical threats; exposing sexual orientation/gender identity without consent; or glorifying/endorsing traumatic events (self-injury, eating disorders, medical history).\n\n2.  **Sexual Harassment:** Unwanted sexual advances, sexual objectification, or degrading attacks about an individual’s sexual practices.\n    *   **Unwanted Romantic Approaches:** Sexual objectification (comments on body parts, encouraging adult content, asking for sexually suggestive poses).\n    *   **Disparagement:** Based on perceived sexual practices or morality (of person or family member).\n    *   **Image/Audio Misuse:** Sharing or threatening to share intimate images/audio without consent; threats, blackmail, or forced coercion for intimate images.\n\n3.  **Hateful Conduct:** Behavior promoting violence or hatred based on protected characteristics (race, ethnicity, color, caste, national origin, immigration status, religion, sex, gender, gender identity, sexual orientation, disability, serious medical condition, veteran status).\n    *   **General:** Intolerance, hatred, subjugation, sexualizing, demeaning, dehumanizing, or suggesting inferiority against protected groups.\n    *   **Specific Examples:** Mimicking race to mock, encouraging violence/harm, mocking/celebrating/denying hate crimes, racial slurs (with allowance for clearly self-referential/positive use), support for known hate groups/ideologies, harmful stereotypes/theories.\n    *   **Hateful Images/Symbols:** Prohibits symbols from known hate organizations, Nazi propaganda, Swastikas (with specific historical exceptions), grotesque/derogatory Black Americana (e.g., Gollywog dolls, blackface), and live/recorded blackface/yellowface/redface/brownface.\n    *   **Confederate Battle Flag Nuance:** Permitted only if historically accurate miniatures/models, artistic denunciation, or on book/video game covers without hateful context.\n\n4.  **Off-Platform Abuse:**\n    *   **Coordination:** Action may be taken if verifiable evidence exists of off-platform coordination of harassment or hate *to occur on Whatnot* (e.g., encouraging followers to send hateful messages, creating fake accounts for insult/impersonation).\n    *   **Severe Off-Platform Behavior:** In rare instances, action may be taken for verifiable hate/harassment occurring off-platform if it poses a significant threat to the Whatnot community or individuals, considering severity and persistence.\n\nThis policy outlines a comprehensive framework for addressing harmful behaviors, including detailed examples and specific nuances for visual content and off-platform conduct.",
    "last_updated": "2025-07-22T00:28:34.642708Z"
  },
  "whatnot-how-to-report": {
    "policy_name": "Whatnot How To Report",
    "initial_summary": "## Whatnot User Reporting and Investigation Policy Summary\n\n**Key Points:**\n\n* **Reporting Methods:** Users can report suspicious behavior via in-app reporting features during livestreams, in direct messages (DMs), on product listings, or user profiles (Android & Web).  Email reports to trustandsafety@whatnot.com are also accepted.  All reports are anonymous.\n* **Reporting Locations:** Reporting options are available within livestreams (for buyers and sellers), in-live chat, DMs, product listings, and user profiles (Android/Web).\n* **Investigation Process:** Whatnot's Trust & Safety team investigates reports, analyzing data, reviewing livestreams, and potentially temporarily suspending users during investigations. Outcomes are not publicly disclosed.\n* **Proactive Monitoring:**  The Trust & Safety team proactively investigates potential policy violations based on data analysis and community reports, taking action against users exhibiting patterns of abuse.\n\n",
    "last_update_summary": "**Trust & Safety Policy Update Summary**\n\nFor Product Manager:\n\nThe recent update to the \"How to Report\" help article introduces changes primarily aimed at improving user guidance and optimizing report routing.\n\n**Specific Changes & Impact:**\n\n*   **New \"Tip\" Section Added:**\n    *   **Change:** A prominent \"Tip\" box has been introduced at the beginning of the reporting guide, advising users to:\n        *   [Block users](https://help.whatnot.com/hc/en-us/articles/9816865522317-Blocking-a-User) for unwanted interactions.\n        *   [Contact Support](https://help.whatnot.com/hc/en-us/articles/4406478493069-Contact-Whatnot-support) for order-related issues.\n    *   **Impact:**\n        *   **Improved User Experience:** Guides users to more immediate and appropriate solutions (blocking, customer support) before initiating a formal report.\n        *   **Reduced Misdirected Reports:** Aims to decrease the volume of reports sent to the Trust & Safety team that are better handled by other mechanisms, thereby optimizing T&S resource allocation for genuine policy violations.\n*   **Visual Aid Repositioning:**\n    *   **Change:** The image demonstrating how to block a user (`![](/hc/article_attachments/40023575788045)`) has been moved to immediately follow the new \"Tip\" section and precede the \"How to report a profile\" guide.\n    *   **Impact:** Reinforces the \"blocking\" recommendation visually right after the textual advice, enhancing clarity and promoting self-service solutions for user interactions.\n*   **Enhanced Readability (Formatting):**\n    *   **Change:** Horizontal rules (`* * *`) have been added to visually separate key sections of the article.\n    *   **Impact:** Improves the overall readability and structure of the article, making it easier for users to digest information and navigate the reporting process.",
    "last_updated": "2025-11-15T06:36:57.159923Z"
  },
  "whatnot-moderator-guidelines": {
    "policy_name": "Whatnot Moderator Guidelines",
    "initial_summary": "## Whatnot Moderator Guidelines Summary\n\n**Key Points:**\n\n* **Goal:** Maintain a safe and fun marketplace by empowering moderators to manage livestream chats effectively.  Moderation should be fair and unbiased, prioritizing community safety and a positive user experience.\n\n* **Moderator Responsibilities:**\n    * Remove users only for violations of Community Guidelines or at the seller's request.  Avoid banning users for differing opinions.\n    * Maintain a respectful and engaging chat environment.\n    * Address inappropriate messages promptly, escalating to warnings before bans.\n    * Seek seller feedback.\n\n* **Moderator Privileges:**\n    * Remove users from a specific livestream (not a platform-wide ban).\n    * View muted chat messages.\n\n* **Adding/Removing Moderators:** Sellers can add moderators during or before a livestream via the scheduling section or by selecting the \"Allow to Moderate\" option from a user's chat profile.  Removal is done similarly using the \"Remove Moderator\" option.\n\n* **Underlying Principle:**  Moderation should be proactive and fair, guided by Whatnot's Community Guidelines and a principle of leading by example, not force.\n",
    "last_update_summary": "### Whatnot - New Moderator Guidelines Policy (2025-07-22)\n\n**Summary of Key Changes (New Policy Introduced):**\n\nThis diff indicates the **creation** of a comprehensive \"Moderator Guidelines\" policy for Whatnot. As a `new file`, it establishes the foundational expectations and procedures for livestream moderators, where none were formally documented in this manner before.\n\n**Core Aspects of the New Policy:**\n\n*   **Purpose:** To make Whatnot the \"safest P2P marketplace\" by providing clear guidance for local moderators. The overarching principle is to \"lead by example, not by force,\" ensuring unbiased actions and compliance with Whatnot's Community Guidelines.\n*   **Moderator Expectations:**\n    *   Avoid abuse of power; only remove/report users if actions warrant it or if the seller requests.\n    *   **Do not ban users for mere disagreement or opinions.**\n    *   Maintain an unbiased stance to keep communities safe.\n    *   Primary responsibility in chat is to ensure content standards and address offending users/spam.\n*   **Best Practices Emphasized:**\n    *   Treat all users with respect and without bias.\n    *   Engage with chat and answer user questions.\n    *   Delete inappropriate messages promptly.\n    *   **Crucially, \"Issue a verbal warning first and do not ban users without a valid cause.\"**\n*   **Moderator Privileges:**\n    *   **Remove Users From Show:** Removes a user *only from the current livestream*. This action **does not ban them from Whatnot** or prevent them from joining future streams from the same seller.\n    *   **View Muted Chat Messages:** Allows moderators to see messages that are hidden from regular users due to global settings or the seller's \"Muted Words\" list.\n*   **Management:** Provides clear instructions for sellers on how to add and remove moderators both before and during a livestream.\n\n**Implication for Product Managers:**\n\nThis new policy signals Whatnot's commitment to a structured and responsible approach to user-led moderation. The emphasis on unbiased action, verbal warnings before bans, and the limited scope of the \"Remove from Show\" privilege suggests a focus on fostering community and maintaining a less punitive environment, while still empowering sellers with tools to manage their immediate livestream experience. The ability for mods to view muted messages provides a critical layer for content oversight.",
    "last_updated": "2025-07-22T00:28:51.105342Z"
  },
  "youtube-community-guidelines": {
    "policy_name": "Youtube Community Guidelines",
    "initial_summary": "## YouTube's Trust & Safety Policy Summary:\n\nThis document outlines YouTube's approach to content moderation, creator support, and combating abuse.  Key points include:\n\n* **Content Moderation:**  YouTube uses automated systems and human reporting to identify and remove content violating Community Guidelines and Advertiser-Friendly Content Guidelines. Exceptions are made for content with clear educational, documentary, scientific, or artistic value (EDSA).\n\n* **Creator Support:**  The YouTube Partner Program (YPP) offers revenue sharing to eligible creators who meet stricter content standards.  Creators have tools to manage comments and their channel's community interactions.  YouTube provides resources to support creator privacy and safety.\n\n* **Combating Abuse:** YouTube actively works to remove content promoting violent extremism or criminal organizations, collaborating with government entities and organizations like the GIFCT.\n\n* **Appeals Process:** Creators can appeal decisions regarding content removal or YPP suspension.\n\n\n",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n*   **Policy Change:** The Community Guidelines have been updated to explicitly broaden the definition of \"context\" to include \"content that is in the public’s interest.\"\n*   **Impact for Product:**\n    *   **Moderation Nuance:** Allows for more nuanced enforcement, potentially reducing strikes on newsworthy, educational, or satirical content that genuinely serves a public interest.\n    *   **Operational Challenge:** Requires clear internal guidance and training for moderators to consistently identify and apply the \"public interest\" exemption, to avoid inconsistent enforcement or potential abuse.\n    *   *(Note: Minor HTML structure/security nonce attribute change has no T&S policy impact.)*",
    "last_updated": "2026-01-21T13:05:45.690322Z"
  },
  "youtube-harassment-policy": {
    "policy_name": "Youtube Harassment Policy",
    "initial_summary": "## YouTube Harassment & Cyberbullying Policy Summary\n\nThis policy prioritizes the safety of creators, viewers, and partners.  Key prohibitions include:\n\n* **Harassment:** Prolonged insults or slurs targeting individuals based on protected group status, physical attributes, or victimhood (sexual assault, abuse, etc.).  A stricter approach is taken for content targeting minors.\n* **Doxxing & PII Sharing:** Sharing or threatening to share non-public personally identifiable information (PII),  except for widely available public information or clearly marked fake PII used for educational purposes.\n* **Abusive Behavior:** Encouraging brigading or other forms of coordinated abuse. Promoting harmful conspiracy theories linked to threats or violence.\n* **Threats & Violence:**  Threats against individuals or their property (including implicit threats), depictions of staged meet-ups to falsely accuse individuals, vigilante violence, or content glorifying or mocking death/injury.  This also includes realistic simulations of violence or death.\n* **Stalking & Sexualization:** Stalking, unwanted sexualization, sharing non-consensual intimate imagery, or fantasizing about/threatening sexual assault.\n\n**Exceptions:**  Content may be allowed if the primary purpose is educational, documentary, scientific, or artistic (e.g., debates, scripted performances, harassment awareness content). However, these exceptions do not excuse malicious harassment, especially based on protected group status.\n\n**Enforcement:** Violations result in content removal and email notification.  First-time offenders receive a warning with a policy training option.  Multiple violations or severe abuse can lead to strikes, channel suspension, or termination.  Repeat offenders may be prevented from accessing future policy trainings.  The policy applies to videos, comments, livestreams, and external links.\n",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n**Policy Update: Harassment & Cyberbullying Policy Page**\n\n**Specific Changes:**\n\n*   **Removal of Support Volume Notification:** The banner advising users of high support volumes and longer wait times for email/chat/X responses has been removed.\n*   **Addition of User Feedback & Self-Help Modules:**\n    *   A \"Was this helpful?\" survey with \"Yes\" / \"No\" and a comment box.\n    *   A \"Need more help?\" section, directing users to \"Post to the help community.\"\n\n**Impact:**\n\n*   **Improved User Experience (UX):** Removes outdated information about support delays, potentially signaling a return to normal service levels.\n*   **Enhanced Feedback Loop:** Introduces a direct mechanism for users to provide feedback on the policy content, aiding future iterations and clarity.\n*   **Support Deflection/Self-Service:** Directs users with further questions to community forums, potentially reducing the load on direct support channels and empowering users to find answers collaboratively.",
    "last_updated": "2026-01-25T06:42:57.167122Z"
  },
  "youtube-shopping-ads-policy": {
    "policy_name": "Youtube Shopping Ads Policy",
    "initial_summary": "## Google Shopping Ads Policies: Summary for Product Managers\n\nThis document outlines Google's policies for Shopping ads, aiming for a trustworthy and transparent advertising ecosystem.  Key areas covered are:\n\n**1. Prohibited Content:**  This includes counterfeit goods, dangerous products (drugs, weapons, explosives), products enabling dishonest behavior (hacking tools, fake documents), and inappropriate content (hate speech, violence, cruelty).  Certain content lacks optimal support and is therefore unsupported in Shopping ads, though this doesn't affect other Google platforms.\n\n**2. Prohibited Practices:** This section addresses abuse of the ad network (malicious content, unfair advantages, bypassing reviews), irresponsible data collection and use (insecure data handling), and misrepresentation (misleading promotions, inaccurate product portrayal).\n\n**3. Restricted Content:**  This category covers legally or culturally sensitive content allowed with limitations and potential additional requirements. Examples include adult-oriented content, alcoholic beverages, copyrighted material, gambling, healthcare products, political content, and High Fat Sugar Salt (HFSS) food & beverages (prohibited from targeting minors).\n\n**4. Editorial & Technical Requirements:**  Ads must meet high professional and editorial standards, be clear, and lead to relevant, user-friendly landing pages. Technical requirements ensure ad functionality across various formats.\n\n**Enforcement:** Google uses AI and human review to enforce policies, taking actions ranging from disapproving ads to suspending accounts for violations.  Advertisers can appeal decisions.  Compliance with all applicable laws and regulations is mandatory.\n",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n**Policy Update: YouTube Shopping Ads - Personalized Advertising**\n\n*   **Specific Change:** The policy title for \"Personalized advertising\" has been updated to \"**Restricted targeting in Personalized advertising**\" (Policy item #10).\n*   **Impact:**\n    *   **For Product:** Signals a new or heightened focus on specific targeting limitations within personalized advertising for YouTube Shopping Ads. Product teams may need to review ad targeting features, tools, and advertiser guidance to ensure alignment with these new restrictions.\n    *   **For Advertisers:** Advertisers using personalized advertising will now need to comply with specific \"restricted targeting\" guidelines, potentially impacting campaign setup and audience reach.\n    *   **For T&S:** This update strengthens policy enforcement around sensitive targeting practices, aiming to reduce risks associated with personalized advertising.",
    "last_updated": "2026-01-07T18:43:46.265054Z"
  },
  "meta-community-guidelines": {
    "policy_name": "Meta Community Guidelines",
    "initial_summary": "# Competitor Policy Summary:\n\nThis document outlines Meta's Community Standards, encompassing policies for Facebook, Instagram, Messenger, and Threads.  Key areas covered include:\n\n* **Content Moderation:**  Policies define acceptable and unacceptable content, addressing issues like hate speech, violence, harassment, misinformation, and illegal activities.  A three-part enforcement approach (remove, reduce, inform) is used.  Newsworthiness and public interest are considered when evaluating potentially violating content.\n\n* **Account Integrity:** Policies cover authentic identity, inauthentic behavior, and account security.\n\n* **Safety & Well-being:**  Emphasis is placed on user safety, privacy, and dignity.  Specific attention is given to protecting minors, addressing issues like child exploitation and suicide/self-harm.\n\n* **Transparency & Enforcement:**  The document details how Meta detects and addresses policy violations, including technological solutions and human review.  Transparency reports on enforcement, intellectual property, government data requests, and content restrictions are publicly available.\n\n* **Governance & Appeals:**  Information is provided about Meta's Oversight Board, its role in policy appeals, and its impact.\n\n* **Research & Data:** Access to research tools and datasets related to content and advertising is highlighted.\n\n\nThe policy aims to balance freedom of expression with the need to maintain a safe and respectful online environment.  The US English version is considered the primary and most up-to-date document.\n",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n**Specific Change:**\n*   A new bolded disclaimer has been added to the \"Introduction\" section of the Community Standards.\n*   The disclaimer states: \"**Please note that the US English version of the Community Standards reflects the most up to date set of the policies and should be used as the primary document.**\"\n\n**Impact:**\n*   **Enforcement Clarity:** Explicitly directs Trust & Safety teams to use the US English version as the definitive source for all policy interpretations and enforcement decisions, reducing ambiguity.\n*   **Localization Implications:** Solidifies that non-US English translations are secondary and may not always be perfectly synchronized. This could lead to discrepancies in understanding for global users if not managed carefully, impacting user experience and potential appeals in different locales.",
    "last_updated": "2026-01-04T06:42:16.395011Z"
  },
  "meta-appeal-process": {
    "policy_name": "Meta Appeal Process",
    "initial_summary": "Here's a concise summary of Instagram's Oversight Board appeal policy for a Product Manager:\n\n### Instagram Oversight Board Appeal Policy Summary\n\n**Key Points:**\n\n*   **Purpose:** Allows users to appeal Instagram's content decisions (both on their own content or content they reported) to an independent Oversight Board (OB).\n*   **Prerequisite:** Users **must** first exhaust Instagram's internal review process, including two internal reviews of the decision, before becoming eligible to appeal to the OB.\n*   **Appeal Types:**\n    *   Decisions to take down a user's content.\n    *   Decisions not to remove content a user reported.\n*   **Eligibility & Selection:** Not all content decisions are eligible for OB appeal. The OB itself selects only a limited number of eligible appeals for review and may not choose a specific case.\n*   **Timeline:** Appeals to the OB must be submitted within **15 days** of Instagram's final decision.\n*   **Status Check:** Users can track their appeal status on the Oversight Board's website using a reference number.",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n*   **Specific Change:** A new Help Center article, \"Appeal Instagram’s content decision to the Oversight Board,\" has been published. Crucially, it now explicitly outlines the process for users to appeal to the Oversight Board when **content they reported was *not* taken down** by Instagram.\n*   **Prerequisite Clarification:** The policy clarifies that users must first complete Instagram's internal \"request a review process\" (potentially twice) for reported content before being eligible to appeal to the Oversight Board.\n*   **Impact:**\n    *   **User Experience:** Provides a clearer, formalized pathway for users to escalate appeals regarding reported content, potentially increasing user trust and sense of agency.\n    *   **Product/T&S Operations:** Anticipate a potential increase in internal review requests for reported content, and subsequently, an increase in Oversight Board appeals concerning content that was *not* removed. Ensure our internal review and Oversight Board integration processes are robust enough to handle these appeals efficiently.",
    "last_updated": "2026-01-12T06:49:25.896242Z"
  },
  "meta-blocking-people": {
    "policy_name": "Meta Blocking People",
    "initial_summary": "Here's a concise summary of the provided policy text for a Product Manager:\n\n### Instagram \"Blocking People\" Policy Summary\n\nThis policy details Instagram's \"Blocking People\" feature, a core safety and privacy control.\n\n**Key Points:**\n\n*   **Core Functionality:** Explains how users can block and unblock other accounts.\n*   **Impact of Blocking:**\n    *   Removes all past comments and likes from the blocked user.\n    *   Clarifies that a blocked user generally cannot see the blocker's content, message them, or mention them.\n    *   Provides guidance on how to view and manage a list of blocked accounts.\n*   **Related Privacy & Safety Controls:** The document also references other related user controls available in the \"Privacy, Security & Reporting\" section, including:\n    *   Making an account private.\n    *   Removing followers.\n    *   Restricting users (a softer form of control than blocking).\n    *   Temporarily limiting interactions from others.\n    *   Reporting messages or accounts.\n\nThis policy emphasizes user control over their interactions and visibility on the platform.",
    "last_update_summary": "Here's a concise summary for the Product Manager:\n\n**Summary: \"Blocking People\" Help Center Page Overhaul**\n\nThis update significantly revamps the `meta-blocking-people` snapshot.\n\n**Specific Changes:**\n\n*   **From Error to Content:** The page transitioned from displaying a \"Something went wrong\" error message to a comprehensive Help Center article titled \"Blocking People.\"\n*   **New Navigation & Structure:** A full Help Center layout has been implemented, including:\n    *   Global navigation (Help Center logo, search, language selector).\n    *   Hierarchical topic navigation (e.g., \"Privacy and Reporting\" > \"Managing Your Privacy Settings\" > \"Blocking People\").\n    *   Breadcrumbs for easy context.\n    *   A detailed list of sub-topics related to blocking, unblocking, restricting, removing followers, and privacy settings.\n*   **Standardized Footer:** The page now includes the standard Instagram/Meta Help Center footer with legal links, company info, and a feedback prompt.\n\n**Impact:**\n\n*   **Improved User Experience:** Users seeking information on blocking or privacy controls will now find a functional, detailed, and navigable resource instead of an error page.\n*   **Reduced User Friction/Support Tickets:** By providing clear, self-service information, this change is likely to reduce user frustration and potentially decrease the volume of support inquiries related to blocking features.\n*   **Content Standardization:** Aligns this specific help topic with the broader Help Center design and information architecture.\n*   **Enhanced Discoverability:** Integration into the Help Center navigation makes blocking-related guidance easier for users to find.",
    "last_updated": "2026-01-12T06:49:35.644526Z"
  },
  "meta-commerce-policies": {
    "policy_name": "Meta Commerce Policies",
    "initial_summary": "### Competitor Policy Page Analysis: Unavailable Page\n\nThe provided text is an error message from Instagram's Help Center, indicating that a specific page is unavailable.\n\n**Key Points:**\n\n*   **Core Message:** \"This Page Isn't Available.\"\n*   **Reasons for Unavailability:** The page may be unavailable due to a broken link or because it has been removed.\n*   **User Guidance:** Users are advised to check if the link they are trying to open is correct.\n*   **Navigation Options:** The page provides clear calls to action to return to the Help Center Home or go back to the previous page.\n*   **T&S Relevance:** This page demonstrates how a competitor handles missing or removed content (potentially policy or help documentation), which impacts user experience and trust. It emphasizes the need for clear communication and alternative navigation when users encounter inaccessible information.",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n**Summary: Meta Commerce Policy Configuration Update**\n\nThe `meta-commerce-policies/snapshot.html` file, which previously contained a significant amount of embedded client-side configuration data, has been almost entirely stripped of this content.\n\n**Specific Changes:**\n\n*   **Removal of Embedded Configuration:** The previous version of `snapshot.html` included large JavaScript objects (`clpData`, `gkxData`, `justknobxData`, and numerous `define` blocks) that configured various aspects of the product, including feature flags, cookie settings, advertising regions, privacy consent options, internationalization settings, security tokens (`DTSG`, `LSD`), and zero-rating rules.\n*   **Minimalist Structure:** The updated `snapshot.html` retains only the basic framework for a `requireLazy` and `ServerJS().handle` call, with nearly all the actual configuration data removed.\n\n**Impact (Trust & Safety Perspective):**\n\n*   **Positive (Efficiency/Control):** This change likely indicates a shift to a more dynamic, centralized, or server-side delivery mechanism for these critical configurations. This could improve agility for updates, enhance security by not embedding sensitive settings in static files, and centralize control over policy-related behaviors.\n*   **Crucial T&S Verification Needed:** The configurations removed directly impact core policy enforcement areas such as:\n    *   **Data Privacy & Compliance:** How cookie consent banners are displayed, which integrations are opted-in/exempted, and overall data handling.\n    *   **Advertising Policies:** Rules for `AdsManagerReadRegions` and related ad functionality.\n    *   **Platform Integrity & Security:** Security token configurations.\n    *   **User Experience & Fairness:** Zero-rating rules and internationalization settings.\n    *   **Action for PM:** It is imperative to confirm that all functionalities previously governed by these embedded configurations are now correctly and securely delivered and applied through the new mechanism. Failure to do so could lead to policy non-compliance, security vulnerabilities, or unintended user experiences.",
    "last_updated": "2025-12-21T06:41:08.836618Z"
  },
  "tiktok-blocking-users": {
    "policy_name": "Tiktok Blocking Users",
    "initial_summary": "Here's a concise summary of the competitor's policy page for a Product Manager:\n\n### Competitor Policy Page Summary\n\nThe competitor's policy documentation serves as a comprehensive help center, detailing an exceptionally broad range of platform functionalities, from core features to advanced creator tools and monetization.\n\n**Key Trust & Safety Takeaways:**\n\n*   **Robust User Control & Safety Tools:** A significant focus is placed on empowering users with safety mechanisms. Detailed instructions for blocking (individual users, multiple users from comments, unblocking) are prominently featured, alongside mentions of a \"Safety Center,\" \"Community Guidelines,\" and \"Report a problem\" functionality.\n*   **Comprehensive Feature & Content Coverage:** The policies span an extensive array of content types and features including user-generated videos, AI-generated content, creator tools, live streaming, e-commerce (\"TikTok Shop\"), messaging, and content discovery, indicating a complex ecosystem requiring broad T&S oversight.\n*   **Creator Monetization & Ecosystem:** Policies extend to creator monetization features (LIVE, Gifts, promotion tools), necessitating guidelines for commercial activities, fraud prevention, and responsible content creation related to earning.\n*   **Legal & Policy Framework:** The document points to a foundational set of legal and policy resources, including Terms of Use, Privacy, Copyright, and Law Enforcement guidelines, signifying a structured approach to compliance and trust.\n*   **Algorithmic Transparency & Global Reach:** It touches on content recommendation algorithms (\"How TikTok recommends content\") and highlights a vast global operational scope through an extensive list of supported languages, implying a need for culturally nuanced and legally compliant T&S policies worldwide.",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n*   **Specific Changes:** The policy content for \"blocking users\" on TikTok remains unchanged. The only detected change is a minor technical formatting update to the HTML file (addition of a newline character at the end of the file).\n*   **Impact:** There is **no impact** on user experience, blocking functionality, or Trust & Safety operations. This is a non-substantive technical edit; the policy text, instructions, and implications for users are identical to the previous version.",
    "last_updated": "2026-01-27T02:25:31.773087Z"
  },
  "youtube-hiding-users": {
    "policy_name": "Youtube Hiding Users",
    "initial_summary": "As a Trust & Safety analyst, here is a concise summary of the provided policy document on YouTube's \"Hide users from your channel\" feature for a Product Manager:\n\n---\n\n### YouTube: \"Hide Users from Your Channel\" Policy Summary\n\nThis policy outlines a channel moderation feature allowing content creators to control who can interact with their content.\n\n**Key Functionality:**\n\n*   **Purpose:** Channel owners can \"hide\" specific viewers to prevent their comments from appearing on the channel and to stop them from creating clips from videos or live streams.\n*   **Impact on Hidden User:**\n    *   All previous comments from the hidden user on the channel will be hidden within 48 hours.\n    *   Future comments from the hidden user will not appear.\n    *   The hidden user will **not** receive a notification that they have been hidden.\n*   **Methods to Hide:**\n    1.  **From a Comment:** Select \"More\" next to a user's comment, then \"Hide user from channel.\"\n    2.  **Via YouTube Studio:** In \"Settings\" > \"Community\" > \"Automated Filters,\" paste the user's channel URL into the \"Hidden users\" box.\n*   **Managing Hidden Users:**\n    *   A list of hidden users is available in YouTube Studio under \"Settings\" > \"Community\" > \"Automated Filters.\"\n    *   Users can be \"shown\" (unhidden) from this list, which allows their *future* comments to appear. Previous comments remain hidden.\n*   **Scope:** This is a **channel moderation tool** for managing audience interaction. It is distinct from reporting abuse, harassment, or policy violations, which should be directed to the Safety Center.\n\n---",
    "last_update_summary": "Here's a concise summary for the Product Manager:\n\n*   **No changes to the \"Hide users from your channel\" policy content itself.** The text describing the functionality remains identical.\n*   **Underlying configuration updates:**\n    *   A specific feature flag or experiment ID (`mxp` array) was updated from `1714242` to `1714241`.\n        *   **Impact:** This likely reflects a minor adjustment to an A/B test variant, feature rollout, or internal configuration related to the help page's behavior or presentation.\n    *   High-volume notification tracking parameters (`nck`, `nid`) were removed/cleared.\n        *   **Impact:** This disables a specific notification mechanism or data collection previously associated with this help center page, potentially streamlining the user experience or deprecating an older tracking method.",
    "last_updated": "2026-01-25T06:43:02.437869Z"
  },
  "whatnot-community-guidelines": {
    "policy_name": "Whatnot Community Guidelines",
    "initial_summary": "This policy establishes community guidelines for Whatnot platform users, covering acceptable behavior, prohibited content, and enforcement mechanisms for maintaining a safe marketplace environment.",
    "last_update_summary": "Here's a concise summary of the Community Guidelines update for a Product Manager:\n\n**Key Changes and Impact:**\n\n*   **Policy Effective Date Updated:** The policy's effective date has been updated from \"June 30, 2025\" to \"Today, 4:25 PM\", indicating the new guidelines are live.\n*   **\"Card Breaks\" Policy Link Changed:** The hyperlink for the \"Card breaks\" policy under \"Selling Policies\" has been updated to point to a new, dedicated help center article (`/hc/en-us/articles/34107485220237`).\n    *   **Impact:** Users seeking information on \"Card breaks\" will now be directed to this specific article. This may signify a more focused or updated resource for this policy, potentially impacting how sellers understand and adhere to these specific guidelines.\n*   **No Substantive Policy Text Changes:** Beyond the date and the specific link for \"Card breaks,\" no other policy content or rules were substantively altered in this update. Minor formatting adjustments appear throughout the diff.\n    *   **Impact:** No changes to existing policy enforcement criteria or user behavior expectations, aside from the potentially refined \"Card breaks\" guidance.",
    "last_updated": "2025-11-26T18:35:26.810034Z"
  },
  "whatnot-prohibited-items": {
    "policy_name": "Whatnot Prohibited Items",
    "initial_summary": "This policy defines items and content that are prohibited from being sold, promoted, or distributed on the Whatnot marketplace platform, including safety guidelines and compliance requirements.",
    "last_update_summary": "Initial version.",
    "last_updated": "2025-08-04T16:02:34.677017Z"
  },
  "twitch-community-guidelines": {
    "policy_name": "Twitch Community Guidelines",
    "initial_summary": "Here's a concise summary for a product manager, highlighting key aspects of Twitch's Trust & Safety policy framework:\n\n*   **Core Policy Framework:** A comprehensive set of Community Guidelines, alongside specific policies for Content Classification, Advertiser-Friendly content, and Emotes, governed by overarching Twitch Terms.\n*   **Enforcement Mechanisms:** Clearly defined processes for user reporting, a formal appeals system for enforcement decisions, and a commitment to transparency reporting.\n*   **Moderation & User Controls:** Extensive in-platform tools for chat management, viewer controls to personalize experiences, and resources dedicated to combating targeted attacks and managing harassment.\n*   **User Empowerment & Education:** Provides detailed guides for creators on building and managing moderation teams, as well as general safety resources for users (e.g., media literacy, crisis prevention).\n*   **Platform & Account Security:** Strong emphasis on preventing and combating account takeovers, crucial for maintaining user trust and data integrity.\n*   **Proactive Safety & Harm Prevention:** Addresses severe issues like real-world harm, offers resources for parents/educators, and engages external experts through a Safety Advisory Collective.\n*   **External Relations & Compliance:** Outlines procedures for responding to law enforcement requests and ensuring overall legal compliance.",
    "last_update_summary": "Here's a concise summary for a product manager on the recent Community Guidelines update:\n\n**Policy Update: Community Guidelines Overhaul**\n\nThis update represents a significant expansion and clarification of our Community Guidelines, enhancing safety and transparency across the platform.\n\n**Key Changes & Impact:**\n\n*   **Comprehensive New Policy Sections:**\n    *   **Self-Destructive Behavior:** Formalizes prohibitions with clear examples on self-harm, substance misuse, and dangerous/distracted driving, including specific guidelines for \"drinking goal\" streams.\n        *   *Impact:* Reduces ambiguity, provides clear enforcement criteria for sensitive topics.\n    *   **Enhanced Youth Safety:** New specific prohibitions against sexualized child-like avatars (VTubers, VRChat), humor regarding minors, and misrepresenting age under 13.\n        *   *Impact:* Significantly strengthens protections for minors on the platform and clarifies content moderation expectations.\n    *   **Off-Service Conduct Enforcement:** Introduces a formal policy to act on severe real-world harms (e.g., deadly violence, sexual exploitation, doxxing, swatting) committed by users off-platform, with a dedicated reporting channel.\n        *   *Impact:* Extends Twitch's ability to protect its community from severe off-platform harms, fostering greater trust and safety.\n    *   **Zero-Tolerance Policies:** Explicit sections now detail Twitch's stance on Violence & Threats, Terrorism & Violent Extremism, and Adult Sexual Violence.\n        *   *Impact:* Clearly communicates Twitch's unequivocal stance against these severe violations.\n*   **Increased Clarity & Transparency:** An \"Introduction to Safety\" and integrated \"Enforcement Notes and Clarifications\" have been added throughout, providing specific examples of allowed/disallowed behavior.\n    *   *Impact:* Improves user understanding of policies and aids consistent internal enforcement decisions.\n*   **Improved User Experience:** The left-hand navigation menu has been substantially expanded with direct links to numerous sub-articles (e.g., Content Classification, Filing a Report, Appeals) and a language selector has been added.\n    *   *Impact:* Makes safety resources more accessible and discoverable for users, improving self-service.",
    "last_updated": "2026-01-27T02:25:42.615833Z"
  },
  "twitch-dmca-guidelines": {
    "policy_name": "Twitch Dmca Guidelines",
    "initial_summary": "Here's a concise summary of the DMCA Notification Guidelines for a Product Manager, from a Trust & Safety perspective:\n\n**Key Aspects of Twitch's DMCA Policy**\n\n*   **Core Compliance & Role:** Twitch operates as an intermediary (\"go-between\") under the Digital Millennium Copyright Act (DMCA), facilitating copyright claims and disputes. We do not make legal judgments on infringement; our role is procedural.\n*   **Claim & Consequence:**\n    *   **Rights Holders** submit notifications of claimed infringement (webform preferred, with specific required details). Incomplete notices may be rejected. Submitter's name/email is shared with the account holder.\n    *   Upon a valid notification, Twitch generally **removes or disables access to the content** (VODs, Clips, Channel Artwork). Live streams can be disabled **immediately**.\n    *   The streamer's account receives a **copyright strike**.\n*   **Streamer Recourse & Mitigation:**\n    *   Streamers can submit a **counter-notification** (via email, all details shared with the claimant) if they believe the claim was a mistake or misidentification.\n    *   Streamers can also seek a **retraction** directly from the rights holder.\n    *   Successful counter-notifications or retractions prevent or remove a strike, and may lead to content restoration (though not always guaranteed due to technical/timing factors).\n*   **Repeat Infringer Policy:**\n    *   Accruing **three copyright strikes** leads to account termination.\n    *   Strikes are not permanent but remain long enough to assess repeat infringement.\n    *   **Copyright School:** Eligible streamers can complete Copyright School to remove one strike every 12 months, serving as an educational rehabilitation tool.\n*   **Operational Note:** While infringement claims utilize a webform, counter-notifications and retractions primarily rely on email, which could be a point of friction or confusion for users.",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n**DMCA Guidelines Policy Update Summary**\n\nThis update is a structural and user experience enhancement to the DMCA Guidelines page, with no changes to the underlying policy content.\n\n*   **Specific Changes:**\n    *   **New \"ON THIS PAGE\" Navigation:** A prominent \"ON THIS PAGE\" section has been introduced at the top of the document, providing clickable anchor links to all main sections.\n    *   **HTML & JavaScript Refactoring:** Headings have been re-wrapped with `div` tags and new JavaScript has been added to enable smooth scrolling and focus management when navigating via the new \"ON THIS PAGE\" links.\n*   **Impact:**\n    *   **Improved User Experience:** Users can now more easily navigate and quickly find specific information within the lengthy DMCA Guidelines, reducing scrolling and improving efficiency for both streamers and rights holders.\n    *   **Enhanced Accessibility:** The new navigation with focus management and smooth scrolling contributes to a more accessible experience for users.\n    *   **No Policy Content Change:** The rules, processes, and definitions within the DMCA Guidelines remain unchanged.",
    "last_updated": "2025-12-07T02:13:50.376979Z"
  },
  "twitch-monetized-streamer-agreement": {
    "policy_name": "Twitch Monetized Streamer Agreement",
    "initial_summary": "As a Trust & Safety analyst, here's a concise summary of the Monetized Streamer Agreement for a product manager:\n\nThis agreement outlines the terms for streamers to access Twitch's monetization tools (Program) and receive associated fees.\n\n**Key Aspects for Product Managers:**\n\n*   **Integration with ToS:** The Agreement incorporates and is governed by Twitch's overarching Terms of Service (ToS). Any violation of the ToS or this Agreement can lead to severe consequences.\n*   **Eligibility & Compliance:**\n    *   Streamers must apply and be approved by Twitch (sole discretion).\n    *   Requires complete, accurate, and up-to-date contact/tax information.\n    *   Strict compliance with *all* Twitch policies (ToS, Bits Acceptable Use Policy) is mandatory.\n    *   Prohibits fraudulent means to generate ad impressions/clicks.\n    *   **T&S Implication:** Product features facilitating accurate info collection (KYC/KYB), fraud detection for ad/bit interactions, and robust compliance checks are vital.\n*   **Content Responsibility:**\n    *   Streamers are \"executive producers\" of their content, with sole discretion over what they stream (within ToS).\n    *   **Crucially, streamers are fully liable for obtaining and maintaining *all necessary rights, consents, and licenses* for their content.** They must immediately remove violating content.\n    *   **T&S Implication:** Direct link to copyright, IP, and content moderation enforcement workflows. Product needs to support content reporting and removal.\n*   **Monetization & Payout Rules:**\n    *   Twitch retains exclusive monetization rights; Program Fees are for using Twitch-provided tools (Bits, Subs, Ads, Offers).\n    *   **Payouts are contingent on being a Twitch Affiliate or Partner AND meeting a Payment Threshold.** Otherwise, earnings are only accessible via a \"Spendable Balance\" for Twitch purchases.\n    *   **T&S Implication:** Financial penalties are key enforcement levers: Twitch can **withhold Program Fees** for any violation of the Agreement or ToS. Failure to provide tax info within 180 days forfeits fees.\n*   **Enforcement & Termination:**\n    *   Twitch can **reject applications, disable ads, withhold fees, terminate the Agreement, and disable/ban channels** for non-compliance (e.g., ToS violation, fraudulent activity, repeat infringer, being a Sanctioned Person).\n    *   **T&S Implication:** Clear pathways for policy enforcement, account sanctions, and financial leverage are built into the agreement.\n*   **Dynamic Nature:** Twitch retains the right to add/remove Program Tools and modify the Agreement at any time.\n\nIn essence, this agreement formalizes the rules of engagement for monetization, emphasizing streamer accountability for content and conduct, and providing Twitch with clear enforcement mechanisms, particularly financial ones, for non-compliance.",
    "last_update_summary": "**Summary for Product Manager: Monetized Streamer Agreement Policy Update**\n\nThe recent update to the Monetized Streamer Agreement is primarily a structural and navigational improvement, with no substantive changes to the policy content itself.\n\n*   **Specific Changes:**\n    *   **Added \"ON THIS PAGE\" Navigation:** A new table of contents has been introduced at the beginning of the agreement, providing clickable links to each major section (e.g., Eligibility, Content, Program Revenue, Payment).\n    *   **Header Formatting:** Minor HTML formatting (e.g., `<span>` tags) has been applied to existing section headers.\n\n*   **Impact:**\n    *   **Improved User Experience:** Streamers will find it easier to navigate and locate specific clauses within the legal document, potentially reducing friction when seeking information about monetization terms.\n    *   **No Policy Impact:** There are no changes to the actual terms, conditions, eligibility criteria, revenue mechanics, or compliance requirements. Trust & Safety operations, enforcement, and policy interpretation remain unaffected by this update.",
    "last_updated": "2025-12-07T02:13:59.580220Z"
  },
  "twitch-privacy-policy": {
    "policy_name": "Twitch Privacy Policy",
    "initial_summary": "Here's a concise summary of the Twitch Privacy Notice for a Product Manager, from a Trust & Safety perspective:\n\n**Twitch Privacy Notice - Key Aspects for Product Management**\n\nThe Twitch Privacy Notice (Last modified: 06/30/2023) outlines data collection, use, and disclosure practices, emphasizing Twitch's role as a data controller and an Amazon subsidiary.\n\n*   **Data Collection & Public Nature:**\n    *   **Comprehensive Collection:** Gathers user-provided data (account info, billing, content like voice/image), automatically collected data (IP, device, usage metrics via cookies), and data from linked third-party services (social media, games) or live events (recordings, badge scans).\n    *   **Social & Public Activities:** Highlights that many Twitch Services are inherently public (broadcasting, chat, profile info), meaning user-provided data in these contexts is designed to be seen and potentially collected by others.\n\n*   **Data Use & Disclosure:**\n    *   **Core Functions & Security:** Data is used for operating, maintaining, securing services, managing accounts, personalizing content (including ads), and preventing fraud/abuse.\n    *   **Amazon & Affiliates:** Personal data is shared within Amazon.com, Inc. and its subsidiaries (under equivalent privacy standards) to operate, provide, and improve both Twitch and Amazon products/services.\n    *   **Service Providers & Legal Obligations:** Data is shared with service providers (hosting, analytics) under strict confidentiality. Twitch also reserves the right to disclose data to comply with legal requirements (e.g., court orders) or to protect Twitch, its users, or others from liability, fraud, or harm.\n    *   **No Sale of Data:** Explicitly states Twitch is \"not in the business of selling our users’ personal information.\"\n\n*   **User Rights & Controls (Data Subject Rights):**\n    *   **Broad Rights:** Users are granted rights to access, update, delete, restrict processing, object to direct marketing, and revoke consent. Mechanisms are provided via account settings and support.\n    *   **Retention Post-Deletion:** Notes that Twitch may retain \"certain information\" post-account closure for legitimate interests or legal obligations.\n    *   **Identity Verification:** Twitch may verify identity before fulfilling data requests.\n\n*   **Third-Party Integrations & Accountability:**\n    *   **External Links:** Emphasizes that third-party websites/services linked from Twitch are *not* governed by this policy, requiring users to review external privacy policies.\n    *   **Linked Accounts:** Connecting Twitch to third-party services (e.g., Discord, Xbox) *explicitly authorizes Twitch to share specific data* (username, activity) with those third parties.\n    *   **Extensions & Applications:** Third-party Extension developers receive \"automatically collected information\" from viewer interaction, but Twitch requires explicit user \"Grant Access\" for username/ID. Users are responsible for data provided directly to developers. Developers are contractually required to process data only for defined purposes, but users are encouraged to review the developer's privacy policy.\n    *   **Live Event Exhibitors:** Allowing exhibitors to scan badges explicitly transfers personal information to them, after which *their* privacy policy applies.\n\n**Key Trust & Safety Considerations for PMs:**\n\n1.  **Transparency & Consent:** Ensure product features clearly communicate when user data (especially public data or data shared via integrations) is being collected or shared, and obtain appropriate consent.\n2.  **Third-Party Risk:** Be acutely aware that integrating with third-party services, extensions, or allowing in-person badge scans shifts data responsibility to the third party, requiring clear user disclosure and strong developer/partner agreements.\n3.  **Data Subject Rights:** Design features and data flows with robust processes to easily accommodate user requests for access, modification, and deletion of their data in compliance with global privacy laws.\n4.  **Fraud & Abuse Prevention:** Understand that data collection and disclosure powers are explicitly used for security, fraud, and abuse prevention, supporting Trust & Safety operations.\n5.  **Data Retention:** Consider the implications of data retention policies, particularly for deleted accounts, and ensure legal and legitimate interest justifications are documented.",
    "last_update_summary": "Here's a concise summary for a product manager:\n\n**Twitch Privacy Policy Update (Effective January 15, 2026)**\n\n**Specific Changes:**\n\n*   **New Policy Effective Date:** January 15, 2026.\n*   **Expanded Data Collection Scope:**\n    *   Explicitly includes \"content you create and upload,\" \"your chats and communications,\" and \"date of birth\" under user-provided information.\n    *   Broadens \"Information from Other Sources\" to include data you've made \"publicly available\" on social media, in addition to approved access.\n*   **Removal of Legal Basis for Processing Section:** The section detailing Twitch's reliance on legal grounds (e.g., contractual commitments, legitimate interests) for data processing has been removed.\n*   **Technical/Formatting Updates:**\n    *   Changed internal policy links from absolute URLs to relative paths.\n    *   Removed explicit mention of Twitch being an Amazon subsidiary.\n    *   Minor wording and formatting clarifications throughout.\n\n**Impact:**\n\n*   **Product Development & Features:** Provides stronger policy backing for features utilizing user-generated content, chat data, and age information (e.g., enhanced moderation, age-gating, personalized experiences).\n*   **Data Strategy:** Clarifies and expands the ability to use publicly available social media data for purposes like safety, account verification, or user insights.\n*   **User Transparency:** The removal of the \"legal grounds for processing\" section reduces direct user transparency on the specific legal justifications for data handling, though the processing activities themselves remain outlined.\n*   **Site Maintenance:** Relative links improve site consistency and potentially reduce future link management overhead.",
    "last_updated": "2026-01-23T02:12:47.640179Z"
  },
  "twitch-terms-of-sale": {
    "policy_name": "Twitch Terms Of Sale",
    "initial_summary": "Here's a concise summary of the Terms of Sale for a Product Manager, from a Trust & Safety perspective:\n\n**Trust & Safety Summary: Twitch Terms of Sale**\n\nThis document outlines the binding terms for purchasing \"Ancillary Products and Services\" on Twitch, explicitly incorporating the broader Terms of Service (including dispute resolution). Key T&S aspects include:\n\n*   **User Responsibility & Account Security:** Users are fully responsible for account security, all purchases made under their account, and maintaining accurate billing information. Purchases by minors (13-legal majority) require parental consent.\n*   **Payment & Fraud Prevention:**\n    *   Users authorize charges and accept that payment partners may require **Know Your Customer (KYC)** data (e.g., ID, address) for compliance.\n    *   Twitch can suspend/cancel orders or terminate accounts for payment failures, chargebacks, or suspected fraudulent activity.\n    *   \"Spendable Balance\" (for streamers) can be revoked if obtained or used fraudulently or in violation of terms.\n*   **Digital Content (Bits, Tokens, Rewards) - **_Critical Area_**:\n    *   **No Monetary Value & Non-Transferable:** Digital Content *has no monetary value*, is *not cash or property*, *cannot be sold, traded, or transferred* (including to other users), and *cannot be exchanged for cash or external goods/services*. This prohibits secondary markets and mitigates virtual currency regulatory risks.\n    *   **Non-Refundable & Forfeitable:** Generally non-refundable. Twitch retains full ownership and can unilaterally modify, suspend, or *terminate* Digital Content offerings at any time without compensation, meaning users have **no property rights and bear full risk of forfeiture**.\n    *   Use is subject to the **Bits Acceptable Use Policy**.\n*   **Policy Enforcement & Modifications:** Twitch reserves the right to refuse/cancel orders, terminate accounts in its sole discretion, and unilaterally modify these terms. For active recurring subscriptions, reasonable prior notice is given (with specific consent mechanisms for EU/UK/CH consumers).",
    "last_update_summary": "**Concise Summary for Product Manager:**\n\n**Policy:** Twitch Terms of Sale\n\n**Specific Changes:**\n\n*   **Structural Re-organization:** A comprehensive \"ON THIS PAGE\" table of contents (TOC) has been added to the top of the document, outlining 19 distinct sections.\n*   **Expanded Scope (TOC):** The TOC introduces new policy areas not visible in the previous diff snippet, such as \"Refunds,\" \"Regional Pricing,\" \"Third-Party Terms,\" \"EU/EEA/UK/CH Warranty Rights,\" \"Taxes,\" and \"Seller of Record.\"\n*   **Formatting Updates:** Existing section headings (1-8: Introduction, Modification, Purchase Qualifications, Payment Methods, Spendable Balance, Subscription Services, Digital Content, Broadcaster-Offered Benefits) have been re-formatted and re-numbered to align with the new TOC structure.\n\n**Impact:**\n\n*   **Enhanced User Experience & Clarity:** Users can now quickly understand the scope of the Terms of Sale and navigate directly to relevant sections, significantly improving readability and information access.\n*   **Broader Policy Coverage:** The inclusion of new topics in the TOC indicates a more comprehensive legal framework, likely addressing common user inquiries, regional compliance, and operational details.\n*   **Improved Legal Compliance & Risk Mitigation:** Explicitly detailing sections like \"EU/EEA/UK/CH Warranty Rights\" suggests a proactive effort to align with diverse international consumer protection laws, reducing potential legal exposure.",
    "last_updated": "2025-12-07T02:14:14.001456Z"
  },
  "twitch-terms-of-service": {
    "policy_name": "Twitch Terms Of Service",
    "initial_summary": "Here's a concise summary of the Twitch Terms of Service, highlighting key aspects for a Product Manager from a Trust & Safety perspective:\n\n*   **Binding Agreement & Scope:** The ToS is a legally binding contract for all users (registered or not), incorporating the Community Guidelines and Terms of Sale as foundational policies for user behavior and content.\n*   **User Eligibility & Safety:**\n    *   Minors: Users must be at least 13 years old. Those 13 to the age of legal majority require parental/guardian supervision and agreement to the ToS.\n    *   Blocked Users: Services are not available to users previously removed by Twitch or legally prohibited from receiving them (e.g., due to export restrictions).\n*   **Account Security & Responsibility:** Users are solely responsible for their account security and information accuracy. Selling, renting, or transferring accounts is prohibited, and users are liable for all activity under their account. Twitch reserves rights to combat unauthorized use.\n*   **User Content Ownership & Licensing:**\n    *   **Broad License Grant:** Users grant Twitch an unrestricted, worldwide, irrevocable, perpetual, sublicensable, and royalty-free license to use, reproduce, modify, distribute, display, and monetize their User Content.\n    *   **User Warranties:** Users are solely responsible for their content and must warrant they have the necessary rights, and that content does not infringe third-party IP, defame, or contain malicious code.\n    *   **Content Security Disclaimer (Critical):** Twitch uses \"reasonable security measures\" for User Content but **explicitly disclaims guarantees against unauthorized copying, use, or distribution by third parties.** Users agree Twitch is not liable for such events and waive claims. This represents a significant risk transfer to the user regarding content security.\n*   **Platform IP & User License:** Twitch retains ownership of its platform IP. Users are granted a limited, non-transferable license to access and use the services for personal or internal business use only, with strict prohibitions on commercial resale, distribution, or data mining.\n*   **Promotions:** Users running promotions on Twitch are **solely responsible** for ensuring legal compliance, administration, and all associated liabilities.",
    "last_update_summary": "Here's a concise summary of the Terms of Service policy changes for a Product Manager:\n\n**Summary of ToS Policy Changes:**\n\n*   **Revised Minimum Age Requirements:**\n    *   The global minimum age of 13 has been updated to a jurisdiction-specific **\"Minimum Age,\"** explicitly citing 16 years old for Australia and allowing for other regional variations to supersede the 13-year-old baseline.\n    *   All associated clauses (e.g., user representations upon use, parental consent requirements for minors) have been updated to refer to this new \"Minimum Age\" definition.\n*   **New Language Support:** A link to the Ukrainian (uk-ua) version of the Terms of Service has been added.\n*   **Policy Date Update:** The \"Last modified\" date for the policy has been updated from 04/02/2025 to 12/08/2025.\n*   **Minor Text/Formatting:** Slight rephrasing of introductory text, removing hyphens.\n\n**Impact for Product Manager:**\n\n*   **Compliance & Risk (High Impact):**\n    *   **Mitigation:** Directly addresses and ensures compliance with varied international legal requirements for age restrictions (e.g., potentially stricter child protection laws in specific regions like Australia), significantly reducing legal and regulatory risk related to underage users.\n    *   **Data Implications:** The new \"Minimum Age\" definition could impact data collection, consent, and processing for users in different regions, requiring alignment with privacy policies.\n*   **User Gating & Verification (Medium Impact):**\n    *   **Product Development:** May necessitate adjustments to age verification flows, registration screens, or parental consent mechanisms, particularly for users in identified higher-minimum-age jurisdictions (e.g., Australia) to ensure only eligible users access the service or are correctly flagged for parental supervision.\n    *   **Enforcement:** Provides a clearer, jurisdiction-specific policy basis for Trust & Safety enforcement actions against underage users.\n*   **Localization & Accessibility (Medium Impact):**\n    *   **Market Expansion:** Improves accessibility for Ukrainian-speaking users, potentially supporting user growth and engagement in that region.\n    *   **Content & Support:** Highlights the ongoing need for localization of legal content and potentially user support materials.",
    "last_updated": "2025-12-08T18:42:30.930985Z"
  }
}