{
  "tiktok-community-guidelines": {
    "policy_name": "Tiktok Community Guidelines",
    "initial_summary": "## TikTok Competitor Community Guidelines Summary\n\nThis document outlines a comprehensive set of community guidelines for a TikTok-like platform, effective May 17, 2024.  Key areas covered include:\n\n* **Content Moderation:**  The platform employs a three-pronged approach: removing violating content, restricting age-inappropriate content (for users under 18), and making ineligible for recommendation (For You feed) content that doesn't meet platform standards.\n\n* **Prohibited Content:**  A wide range of prohibited content is detailed, encompassing: violence, hate speech, sexual abuse, harassment, self-harm, dangerous activities, misinformation, scams, regulated goods (alcohol, firearms, etc.), and violations of privacy and security.  Specific examples are provided within each category, though the document notes that these are not exhaustive.\n\n* **Community Empowerment:** The platform provides users with tools and resources to manage their experience, including safety settings, filtering options, and reporting mechanisms.\n\n* **Enforcement:** While the specifics of enforcement aren't detailed, the document implies a combination of automated and human moderation to address policy violations.\n\nThe guidelines aim to create a safe and welcoming environment while balancing creative expression and the prevention of harm.  The full guidelines are categorized for easier navigation, with additional information and examples available for each section.\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a concise summary of the competitor's (TikTok's) updated Community Guidelines for a Product Manager:\n\n---\n\n### TikTok Community Guidelines: Key Changes & Policy Overview (Effective May 17, 2024)\n\nThis diff represents the full content of TikTok's updated Community Guidelines, effective May 17, 2024. The core changes and key aspects for product consideration are:\n\n1.  **Clearer Enforcement Tiers:** The guidelines explicitly differentiate between **\"rules\"** (leading to content removal) and **\"standards\"** (determining eligibility for the For You Feed, FYF). This formalizes a multi-tiered enforcement approach.\n2.  **Expanded Moderation Strategies:** The policy outlines four key safety approaches:\n    *   **Remove:** Content violating rules (public or private).\n    *   **Restrict:** Content not suitable for youth (age-gated to 18+).\n    *   **Make Ineligible for FYF:** Content not meeting recommendation standards.\n    *   **Empower:** Providing users with information, tools (e.g., labels, opt-in screens, safety toolkit for content filtering), and resources.\n3.  **Emphasis on AI-Generated Content (AIGC):** \"Edited Media and AI-Generated Content (AIGC)\" is now a dedicated sub-category under \"Integrity and Authenticity,\" indicating a direct policy focus on synthetic media.\n4.  **Comprehensive Scope:** The guidelines cover a broad range of harms and policy areas, including:\n    *   Youth Safety & Well-Being\n    *   Violent & Criminal Behavior, Hate Speech, Human Trafficking, Harassment.\n    *   Mental & Behavioral Health (Suicide/Self-Harm, Disordered Eating, Dangerous Activities).\n    *   Sensitive & Mature Themes (Sexual content, Nudity, Graphic content, Animal Abuse).\n    *   Integrity & Authenticity (Misinformation, Civic/Election Integrity, Fake Engagement, Spam).\n    *   Regulated Goods & Commercial Activities (Gambling, Alcohol/Tobacco/Drugs, Firearms, Frauds/Scams).\n    *   Privacy & Security.\n5.  **User Understanding & Tools:** The policy emphasizes clarity with \"More information\" links for definitions, examples, and FAQs, alongside promoting user control features like the \"safety toolkit.\"\n\n**Impact for Product:**\nThis update signals a robust, multi-layered approach to content moderation, with clear distinctions between full removal and reduced visibility (FYF ineligibility). The explicit inclusion of AIGC highlights emerging risks TikTok is addressing. Our product strategy should consider these tiered approaches and specific content categories, particularly how we might classify and manage AI-generated content or implement similar user empowerment tools.",
    "last_updated": "2025-07-20T23:50:46.639228Z"
  },
  "tiktok-live-moderation": {
    "policy_name": "Tiktok Live Moderation",
    "initial_summary": "# TikTok LIVE Moderation Policy Summary\n\nThis document details TikTok's approach to content moderation during LIVE streams.  Key features include:\n\n* **Creator Controls:** Creators can add moderators, control audience age (18+), filter comments, block keywords, mute, and block viewers directly from the LIVE settings or chat.  This applies to both mobile app and web browser access (via LIVE Studio or OBS Studio for broadcasting; not required for moderation).\n\n* **Moderator Permissions:** Moderators, granted permission by the creator, can mute, block viewers, and report comments violating Community Guidelines.  The level of control a moderator has is determined by the creator.\n\n* **User Actions:**  Viewers can be reported, muted (temporarily), or blocked (preventing future LIVE viewership and other interactions with the creator).  Notifications are sent to muted/blocked users.\n\n* **Accessibility:** Moderation tools are accessible both within the LIVE settings and directly from the LIVE chat interface on both the mobile app and web browser.\n",
    "last_update_summary": "Here's a concise summary for a product manager regarding the new TikTok LIVE moderation policy page:\n\n## TikTok LIVE Moderation Policy - New Page Summary\n\n**Key Change:** This is a **newly published, comprehensive policy page** detailing moderation capabilities for TikTok LIVE. Its introduction signifies a formalization and clear communication of moderation tools and processes for creators and moderators.\n\n**Summary of Content:**\n\n*   **Purpose:** Provides a definitive guide for creators and designated moderators on managing viewers and comments during TikTok LIVE broadcasts.\n*   **Core Capabilities:** Outlines how creators and moderators can:\n    *   **Block** specific messages or viewers.\n    *   **Report** violations of Community Guidelines.\n    *   **Mute** viewers for a specified duration (with user notification).\n    *   **Limit** comments or set an 18+ audience control for the LIVE.\n    *   **Block** viewers from watching the LIVE and interacting with the creator (with user notification).\n    *   **Filter** and block keywords in comments.\n*   **Roles & Permissions:**\n    *   **Creators:** Have full control to add/remove moderators, manage audience controls (e.g., 18+ limit), and access all moderation settings before and during a LIVE.\n    *   **Moderators:** Are granted specific permissions by the creator to assist with muting, blocking, and reporting, managing comments. They do not require access to streaming software (LIVE Studio/OBS).\n*   **Platform Specificity:** Detailed step-by-step instructions are provided for both the TikTok mobile app and web browser interfaces, covering actions from LIVE settings and directly within the LIVE chat.\n\n**Implication for Product:** This policy page solidifies the tools and responsibilities around LIVE moderation, aiming to provide creators with robust control over their broadcasts and ensure a safer environment for viewers. It emphasizes user empowerment through clear, accessible guidelines.",
    "last_updated": "2025-07-20T23:50:54.171873Z"
  },
  "tiktok-shop-prohibited-products": {
    "policy_name": "Tiktok Shop Prohibited Products",
    "initial_summary": "## Competitor Policy Summary: TikTok Shop Academy (US)\n\nThis document appears to be incomplete or broken.  The provided text only shows a heading related to boosting sales on TikTok Shop Academy and a JavaScript error message.  **No actual policy information is present.**  Therefore, no meaningful summary of their policy can be provided.  Further investigation is needed to obtain the actual policy document.\n",
    "last_update_summary": "**Summary for Product Manager: Competitor Policy Page Analysis**\n\nThis diff indicates the creation of a *new file* for a competitor's \"prohibited products\" policy page (dated 2025-07-20).\n\n**Key Changes:**\n\n*   **New Page Created:** A new policy page `tiktok-shop-prohibited-products` has been added.\n*   **Placeholder Content:** The page's content is currently a generic \"JavaScript not enabled\" message, suggesting it's an unpopulated placeholder or a technical error page, rather than an active policy.\n*   **No Policy Content Detected:** There are no actual policy rules or guidelines present in this version of the page.\n\n**Impact:**\n\nCurrently, there is no substantive policy information to analyze. This appears to be a technical setup or placeholder for a future policy page. We should monitor this URL for updates to identify actual policy content when it becomes available.",
    "last_updated": "2025-07-20T23:50:56.579760Z"
  },
  "whatnot-blocking-a-user": {
    "policy_name": "Whatnot Blocking A User",
    "initial_summary": "## Whatnot User Blocking Policy Summary\n\nThis document details Whatnot's user blocking functionality.  Users can block others to prevent:\n\n* Following\n* Direct messaging\n* Profile viewing\n* Livestream interaction (bookmarking, joining, chatting)\n* Future purchases from listings\n\nExisting orders are unaffected by blocking.  Blocking is currently permanent.  There's no list of blocked users.  Being removed from a livestream is different from being blocked by a user.  Users can report violations of Community Guidelines separately.\n",
    "last_update_summary": "This `diff` indicates the **creation of a new policy page** titled \"Blocking a User\" on Whatnot's help center.\n\n### Summary for Product Manager:\n\nWhatnot has launched a new \"Blocking a User\" policy outlining the functionality and implications of blocking.\n\n**Key aspects of the new policy:**\n\n*   **User Control:** Users can block others to prevent them from:\n    *   Following or direct messaging them.\n    *   Viewing their profile.\n    *   Joining, chatting in, or bookmarking their livestreams.\n    *   Making future purchases from marketplace listings (existing orders are honored).\n*   **Process:** Users block others via the three-dot menu on a user's profile.\n*   **Important Caveats (from FAQs):**\n    *   There is currently **no centralized list** for users to view all blocked accounts.\n    *   **Blocking is explicitly stated as permanent**, meaning once a user is blocked, they cannot be unblocked through a list, only by searching for their profile.\n*   **Clarification:** The policy differentiates blocking from reporting users for Community Guidelines violations and from being removed/banned from a livestream by a host/mod.\n\nThis new policy provides users with a direct self-service mechanism to control their interactions on the platform. The \"permanent\" nature of blocking and the absence of a blocked user list are notable design choices.",
    "last_updated": "2025-07-20T23:51:02.194908Z"
  },
  "whatnot-buyer-protection": {
    "policy_name": "Whatnot Buyer Protection",
    "initial_summary": "# Whatnot Buyer Protection Policy Summary\n\n**Key Points:**\n\n* **Refund Eligibility:** Whatnot offers buyer protection for incomplete/incorrect items, items not as described/inauthentic, and packages not received.  Refunds are generally granted within 30 days of purchase or 14 days of delivery (7 days for certain categories like coins, sneakers, luxury goods; 2 days for plants).  Whatnot may require item return in original condition.  German buyers pay return shipping.\n\n* **Refund Exclusions:**  Consumables (opened/consumed items, breaks except for missing/damaged items), tips, refused deliveries, uncollected packages, unpaid customs fees, exchange rate losses, chargebacks, digital content, off-platform transactions, and instances of suspected fraud are excluded.  Returning the wrong item also voids a refund.\n\n* **Time Limits & Exceptions:**  Specific shorter deadlines apply for certain high-value categories and counterfeit claims (30 days from receipt). Extensions may be granted for international orders, pre-orders, custom orders, and due to natural disasters.  \"Delivered\" but not received items require contact within 14 days.\n\n* **EU/UK Right of Withdrawal:** EU/UK buyers have a 14-day right of withdrawal, requiring item return within 14 days of cancellation.  Buyers are responsible for return shipping costs. This right doesn't apply to breaks, surprise products, or certain unsuitable goods (hygiene, mixed, sealed software/media, customized items, perishable goods).\n\n\n* **High-Value Loss Reimbursement:** A separate policy exists for high-value card losses in breaks, potentially reimbursing market value.\n\n",
    "last_update_summary": "Here's a concise summary of Whatnot's new Buyer Protection Policy for a Product Manager:\n\n### Whatnot Buyer Protection Policy - Summary for PM\n\n**Overview:**\nWhatnot has introduced a comprehensive Buyer Protection Policy to ensure a trustworthy buying experience and provide recourse for buyers in cases where purchases go wrong. This policy outlines eligibility for refunds and the process to obtain them.\n\n**Key Provisions:**\n\n1.  **Covered Issues:** Buyers are eligible for refunds for:\n    *   Incomplete or incorrect items.\n    *   Items not as described (damaged, expired, defective, counterfeit, not matching condition).\n    *   Packages not received (lost, delayed, not shipped, misdelivered, or marked delivered but not received).\n    *   Additional issues include delayed shipping/transit, incorrect sales tax, or additional postage required.\n\n2.  **Refund Request Timelines:**\n    *   **General:** Earlier of 30 days from purchase OR 14 days from delivery.\n    *   **Category-Specific (Shorter Windows):**\n        *   **7 days from delivery / 30 days from purchase:** Coins & Money, Sports Cards, Sneakers & Streetwear, Trading Card Games, Luxury Goods.\n        *   **2 days from delivery / 30 days from purchase:** Plants.\n    *   **Specific Extensions/Exceptions:**\n        *   **\"Delivered\" but not received:** Must contact support within 14 days of delivery scan (refunds at Whatnot's discretion).\n        *   **International Orders:** 7 or 14 days from delivery (category-dependent), regardless of purchase date.\n        *   **Counterfeit Claims:** Within 30 days of receipt.\n        *   **Preorders/Custom Orders:** 7 or 14 days from delivery.\n\n3.  **Return Requirements:**\n    *   Whatnot *may* require item return.\n    *   Items must be returned in the **same condition as received** (e.g., opening a product or removing tags may disqualify or reduce refund).\n    *   **Germany:** Buyers are required to pay return shipping costs, which will be deducted from the refund.\n\n4.  **Critical Exclusions (When Refunds Are NOT Provided):**\n    *   **Consumable Products:** Generally not refundable if consumed or opened (e.g., Breaks – only for missing, delayed, incorrect, damaged items; other products whose value changes upon opening).\n    *   **Tips to Sellers:** Ineligible.\n    *   **Buyer Actions:** Refusing delivery, failing to pick up packages, or refusing to pay customs fees.\n    *   **Financial/External Factors:** Exchange rate fluctuations, orders already disputed with financial institutions (chargebacks).\n    *   **Digital Content:** Ineligible.\n    *   **Policy Abuse:** Indications of refund/return fraud or policy abuse, at Whatnot's full discretion.\n    *   **Incorrect Item Returned:** No refund, item will not be returned to buyer.\n    *   **Off-Platform Transactions:** Not covered.\n\n5.  **Special Policies:**\n    *   **High Value Loss Reimbursement (Sports/Trading Cards in Breaks):** Potential market value reimbursement for missing high-value cards, assessed by Whatnot.\n    *   **EU/UK Right of Withdrawal:** Consumers in EU/UK buying from professional sellers may cancel within 14 days of receipt and get a refund if returned within 14 days of cancellation. Buyer pays return shipping. Specific exclusions apply (e.g., Breaks, unsealed health/hygiene items, customized goods). Refund amount may be reduced for diminished value.\n\n**Action for PM:**\nReview these policies to ensure our current buyer protection offerings are competitive, and identify any gaps or opportunities based on Whatnot's approach to timelines, covered issues, and critical exclusions. Pay close attention to the specific handling of consumables/breaks, high-value items, and regional compliance (EU/UK).",
    "last_updated": "2025-07-20T23:51:13.547160Z"
  },
  "whatnot-enforcement-actions": {
    "policy_name": "Whatnot Enforcement Actions",
    "initial_summary": "## Whatnot's Trust & Safety Policy: Summary for Product Managers\n\nWhatnot's policy enforces Community Guidelines with penalties escalating based on violation severity and account history.  Violations are cumulative, meaning repeated offenses, even minor ones, can lead to a permanent ban.\n\n**Key Actions & Penalties:**\n\n* **Warnings:** For minor infractions, with guidance provided.\n* **Suspensions:** Temporary account access loss (2 or 7 days).\n* **Selling Access Revoked:**  Loss of ability to sell or go live.\n* **Ban:** Permanent account termination for serious or repeated violations.\n* **Discovery Restriction:** Temporary reduced visibility in feeds/recommendations.\n* **Other Penalties:** Loss of access to features like Direct Messages.\n\n**Account Health & Performance:**\n\n* An Account Health dashboard tracks Seller Performance Rates (fulfillment, shipping) and Policy Standing.\n* Poor performance in either area can result in warnings and penalties.\n* Policy Standing has five levels (Excellent, Good, Fair, Poor, Very Poor), reflecting penalty history.\n\n**Violation Expiration:**\n\n* Most violations expire after 180 days, except for bans and offboarding, which are permanent.\n\n**Appeals:**  Users can appeal penalties via email.\n",
    "last_update_summary": "**Subject: Competitor Policy Analysis: Whatnot's New Enforcement Actions Policy**\n\n**Key Takeaways:**\nWhatnot has formalized and publicly released a comprehensive policy detailing its Trust & Safety enforcement actions. This signifies a move towards increased transparency, a more structured penalty system, and clear communication regarding user accountability.\n\n**Core Principles:**\n*   **Proportionality & Record:** Enforcement actions are proportional to the violation, considering a user’s prior Trust & Safety record.\n*   **Cumulative Violations:** Violations are cumulative; multiple minor infractions can eventually lead to a ban.\n*   **Goal:** Maintain a trusted platform while offering users opportunities to course-correct.\n\n**Enforcement Actions/Penalties:**\nWhatnot outlines a tiered system of penalties, which include:\n*   **Warning:** Notification and policy guidance.\n*   **Suspension:** Temporary loss of access (2 or 7 days).\n*   **Revoke Selling Access:** For sellers, inability to sell or go live.\n*   **Ban:** Permanent account ban for repeated or serious violations.\n*   **Discovery Restricted (Notable):** Temporary reduction in account visibility in feeds/recommendations for certain violations, allowing time for compliance (content still visible on profile, search, and \"Followed Hosts\" feed).\n*   **Other Penalties:** Loss of access to specific product features (e.g., Direct Messages).\n*   **Ongoing Investigation Suspensions:** Temporary account suspension during serious reviews.\n\n**Violation Expiry & Appeals:**\n*   Most violations expire after 180 days; however, account-level bans or offboarding are permanent.\n*   Users can appeal penalties by responding directly to the email notification received.\n\n**Account Health Dashboard & Policy Standing:**\n*   Whatnot emphasizes its **Account Health Dashboard (Beta)**, where users (likely sellers) can monitor their **Seller Performance Rates** (Fulfillment Success Rate, On Time Shipment Rate) and **Policy Standing**.\n*   **Policy Standing** has five states, clearly linked to enforcement actions:\n    *   **Excellent:** Good standing.\n    *   **Good:** Warning received.\n    *   **Fair:** Multiple warnings.\n    *   **Poor:** Received a 2-day suspension.\n    *   **Very Poor:** Received a 7-day suspension and selling access revoked.\n\n**Key Changes based on Diff (New File Creation):**\nThis entire document represents a *new public policy* from Whatnot. It indicates a significant investment in formalizing their Trust & Safety framework, introducing granular, documented penalties, and enhancing transparency through a user-facing \"Account Health\" system (including Policy Standing) that ties directly into enforcement. This provides greater clarity and predictability for their user base regarding platform compliance and consequences.",
    "last_updated": "2025-07-20T23:51:24.012787Z"
  },
  "whatnot-hate-and-harassment": {
    "policy_name": "Whatnot Hate And Harassment",
    "initial_summary": "## Whatnot Hate and Harassment Policy Summary\n\nThis policy prohibits hateful conduct and harassment on the Whatnot platform, including sexual harassment and off-platform abuse that impacts the Whatnot community.  Key prohibited behaviors include:\n\n* **Harassment:**  Repeated unwanted contact, personal attacks, targeted obscene language,  using contact information for non-transactional purposes, and disparaging others (sellers disparaging buyers in streams, for example).  Exceptions may be made for newsworthy events or public figures.\n\n* **Threats & Harmful Wishes:** Wishing harm, making threats (implied or explicit), and exposing someone's sexual orientation or gender identity without consent.\n\n* **Sexual Harassment:** Unwanted sexual advances, objectification, degrading comments about sexual practices, sharing intimate images without consent.\n\n* **Hateful Conduct:** Any behavior promoting violence or hatred based on protected characteristics (race, ethnicity, religion, gender, sexual orientation, etc.). This includes using slurs (unless used self-referentially and with clearly indicated positive intent), supporting hate groups, and displaying hateful symbols (with exceptions for historical context, like pre-1933 artifacts). Specific allowances are made for the Confederate battle flag under very specific historical and non-hateful contexts.\n\n* **Off-Platform Abuse:**  Whatnot may take action against users coordinating harassment or hate off-platform that impacts the Whatnot community, even in rare instances where the off-platform behavior poses a significant threat to the platform.\n\nEnforcement actions against accounts may include removal.  The severity and persistence of the behavior are considered when evaluating violations.\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of the competitor's \"Hate and Harassment Policy\" for a Product Manager:\n\n---\n\n### Competitor Policy Analysis: Whatnot Hate and Harassment Policy\n\n**Policy Name:** Hate and Harassment Policy\n**Effective Date:** August 21, 2024\n\n**Summary:**\n\nThis policy establishes Whatnot's strict prohibitions against hateful conduct and harassment (including sexual harassment) to ensure a safe and respectful environment. Violations may result in account actions, including removal.\n\n**Key Prohibitions & Examples:**\n\n1.  **Harassment:**\n    *   **Definition:** Content or patterns of behavior that demean or threaten an individual.\n    *   **Examples:** Unwanted contact/targeting (including alternate accounts), repeated obscene/insulting language, continued contact after being asked to stop, misuse of contact information.\n    *   **Personal Attacks/Repeated Disparagement:** Attacks based on appearance/hygiene/intellect, negative doctored content, sellers disparaging buyers in stream, repeated insults across multiple streams or unsolicited DMs to \"expose\" a seller.\n    *   **Threats & Harmful Wishes:** Wishing death/disease/physical harm, implied threats, non-consensual exposure of sexual orientation/gender identity, glorifying traumatic events (self-injury, eating disorders, medical history).\n    *   *Note:* Exceptions for discussing newsworthy events or public figures.\n\n2.  **Sexual Harassment:**\n    *   **Definition:** Unwanted sexual advances, sexual objectification, or degrading attacks about an individual’s sexual practices.\n    *   **Examples:** Unwanted romantic approaches, sexual objectification (e.g., comments on body parts, encouraging adult content site performance, asking for sexually suggestive poses), disparagement based on perceived sexual practices/morality, non-consensual sharing/threatening of intimate images or audio, blackmail/coercion for intimate images.\n\n3.  **Hateful Conduct:**\n    *   **Definition:** Behavior promoting violence or hatred based on protected characteristics (race, ethnicity, color, caste, national origin, immigration status, religion, sex, gender, gender identity, sexual orientation, disability, serious medical condition, veteran status).\n    *   **Examples:** Intolerance/hatred against protected groups, sexualizing/demeaning/dehumanizing/suggesting inferiority based on protected characteristics, mimicking race to mock, encouraging violence, mocking/glorifying/denying hate crimes.\n    *   **Racial Slurs/Epithets:** Prohibited when targeted; context for self-referential or positive use is considered but intent must be clear.\n    *   **Support for Hate Groups/Ideologies:** Not permitted.\n    *   **Harmful Stereotypes/Theories:** Prohibited.\n    *   **Hateful Images/Gestures/Symbols:** Includes symbols from hate organizations, Nazi propaganda, items depicting the Swastika (with narrow exceptions for pre-1933 or anti-Nazi context), grotesque Black Americana (e.g., Gollywog dolls, blackface), and live/recorded blackface/yellowface/redface/brownface.\n    *   **Confederate Battle Flag:** Permitted only when historical and not hateful (e.g., historically accurate miniatures, art denouncing the flag/slavery, Civil-War themed book/video game covers without hateful context).\n\n4.  **Off-platform Abuse:**\n    *   **Coordination:** Verifiable evidence of off-platform coordination of harassment/hate to occur on Whatnot (e.g., posting streams on social media to encourage hate messages, encouraging fake accounts) may result in action.\n    *   **Severe Off-Platform Conduct:** In rare cases, action may be taken for verifiable severe and persistent off-platform hate/harassment that poses a significant threat to the Whatnot community or individuals.\n\n---\n\n**Key Changes Based on Diff:**\n\nThe provided `diff` indicates this is a **newly introduced policy document** (`new file mode`). This means Whatnot has formally established and published a comprehensive \"Hate and Harassment Policy\" as of August 21, 2024. This signifies a significant formalization of their stance and enforcement guidelines in this critical safety area, providing explicit definitions and examples for various forms of harassment and hateful conduct, including nuanced considerations for specific symbols and off-platform behavior.",
    "last_updated": "2025-07-20T23:51:35.523479Z"
  },
  "whatnot-how-to-report": {
    "policy_name": "Whatnot How To Report",
    "initial_summary": "## Whatnot User Reporting and Investigation Policy Summary\n\n**Key Points:**\n\n* **Reporting Methods:** Users can report suspicious behavior via in-app reporting features during livestreams, in direct messages (DMs), on product listings, or user profiles (Android & Web).  Email reports to trustandsafety@whatnot.com are also accepted.  All reports are anonymous.\n* **Reporting Locations:** Reporting options are available within livestreams (for buyers and sellers), in-live chat, DMs, product listings, and user profiles (Android/Web).\n* **Investigation Process:** Whatnot's Trust & Safety team investigates reports, analyzing data, reviewing livestreams, and potentially temporarily suspending users during investigations. Outcomes are not publicly disclosed.\n* **Proactive Monitoring:**  The Trust & Safety team proactively investigates potential policy violations based on data analysis and community reports, taking action against users exhibiting patterns of abuse.\n\n",
    "last_update_summary": "Here's a concise summary of the new policy page for a product manager:\n\n## Whatnot - How to Report a User & How We Investigate (New Policy Page)\n\nThis new policy page outlines the methods for users to report policy violations and details how Whatnot's Trust & Safety (T&S) team investigates these reports.\n\n**Key Takeaways from this New Policy Page:**\n\n1.  **Reporting Methods:** Users can now report others through multiple in-app touchpoints, including:\n    *   During a Livestream (for both sellers and chat participants)\n    *   In Direct Messages (DMs)\n    *   On a Product Listing (to report sellers)\n    *   On a User's Profile (Android & Web only)\n    *   Emailing `trustandsafety@whatnot.com` for general inquiries.\n2.  **Anonymity:** All user reports are explicitly stated to be anonymous.\n3.  **Investigation Process:**\n    *   The T&S team investigates reports by analyzing facts, user history, data, and reviewing livestreams.\n    *   Temporary feature suspensions (e.g., ability to go live) may occur during an ongoing investigation.\n    *   Outcomes of investigations are not disclosed to reporters due to privacy.\n4.  **Proactive T&S:** The T&S team also conducts proactive investigations based on data analysis and community reports, monitoring for patterns of abuse and taking action where evidence is found.\n\nThis new page aims to improve transparency for users on how to report issues and how Whatnot handles safety concerns.",
    "last_updated": "2025-07-20T23:51:40.466925Z"
  },
  "whatnot-moderator-guidelines": {
    "policy_name": "Whatnot Moderator Guidelines",
    "initial_summary": "## Whatnot Moderator Guidelines Summary\n\n**Key Points:**\n\n* **Goal:** Maintain a safe and fun marketplace by empowering moderators to manage livestream chats effectively.  Moderation should be fair and unbiased, prioritizing community safety and a positive user experience.\n\n* **Moderator Responsibilities:**\n    * Remove users only for violations of Community Guidelines or at the seller's request.  Avoid banning users for differing opinions.\n    * Maintain a respectful and engaging chat environment.\n    * Address inappropriate messages promptly, escalating to warnings before bans.\n    * Seek seller feedback.\n\n* **Moderator Privileges:**\n    * Remove users from a specific livestream (not a platform-wide ban).\n    * View muted chat messages.\n\n* **Adding/Removing Moderators:** Sellers can add moderators during or before a livestream via the scheduling section or by selecting the \"Allow to Moderate\" option from a user's chat profile.  Removal is done similarly using the \"Remove Moderator\" option.\n\n* **Underlying Principle:**  Moderation should be proactive and fair, guided by Whatnot's Community Guidelines and a principle of leading by example, not force.\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of the provided competitor policy page for a product manager:\n\n---\n\n### Whatnot Moderator Guidelines Policy Summary (New Policy Introduction)\n\n**Date of Policy:** June 6, 2025 (Future-dated snapshot)\n\n**Summary:**\nThis document introduces a comprehensive \"Moderator Guidelines\" policy for Whatnot, outlining the expectations, best practices, and specific privileges for livestream moderators. The policy emphasizes creating a safe, respectful, and unbiased peer-to-peer marketplace experience, particularly within livestream chats.\n\n**Key Policy Elements:**\n\n*   **Trust & Safety Vision:** Positions good moderation as key to achieving Whatnot's vision of being the \"safest P2P marketplace\" and ensuring compliance with Community Guidelines.\n*   **Guiding Principle:** \"Lead by example, not by force,\" stressing unbiased actions and responsible use of power.\n*   **Moderator Responsibilities:**\n    *   Primary role is to ensure chat meets seller's standards, addressing offending users and spam.\n    *   **Strict Prohibition on Abuse of Power:** Mods should *only* remove/report users if actions warrant it or seller requests; *not* for disagreements or opinions.\n    *   Issue verbal warnings before taking action (implies removing from show, as global banning is not a mod power).\n*   **Moderator Best Practices:** Focus on respect, impartiality, keeping chat engaged, answering questions, avoiding spam, deleting inappropriate messages, and handling rude users appropriately.\n*   **Moderator Privileges:**\n    *   **Remove Users From Show:** Allows removing a user from the *current* livestream only. This does *not* ban them from Whatnot or future streams by the same seller.\n    *   **View Muted Chat Messages:** Mods can see messages muted by the system or seller's \"Muted Words\" list, which are invisible to normal users.\n*   **Seller Control:** Details how sellers can add (during scheduling or live) and remove moderators for their specific shows.\n\n**Key Changes (Based on Diff):**\nThis diff represents the *initial introduction* of a detailed \"Moderator Guidelines\" policy. There are no prior versions to compare against. The \"key changes\" are the formalization and public release of these guidelines, which now:\n\n*   **Establish Clear Expectations:** Define the role and responsibilities of moderators, aligning them with Whatnot's Trust & Safety vision.\n*   **Outline Specific Powers & Limitations:** Explicitly states what moderators can and cannot do (e.g., \"Remove Users From Show\" vs. platform-wide bans).\n*   **Promote Responsible Conduct:** Instills principles of impartiality, respect, and avoiding abuse of power (e.g., no banning for opinions).\n*   **Provide Best Practices:** Offers actionable advice for effective and constructive moderation.\n*   **Formalize Management:** Lays out clear procedures for sellers to manage their designated moderators.\n\nThis new policy aims to empower sellers with moderation tools while providing clear guardrails for moderators to ensure a consistent and safe user experience.\n\n---",
    "last_updated": "2025-07-20T23:51:48.743350Z"
  },
  "youtube-community-guidelines": {
    "policy_name": "Youtube Community Guidelines",
    "initial_summary": "## YouTube's Trust & Safety Policy Summary:\n\nThis document outlines YouTube's approach to content moderation, creator support, and combating abuse.  Key points include:\n\n* **Content Moderation:**  YouTube uses automated systems and human reporting to identify and remove content violating Community Guidelines and Advertiser-Friendly Content Guidelines. Exceptions are made for content with clear educational, documentary, scientific, or artistic value (EDSA).\n\n* **Creator Support:**  The YouTube Partner Program (YPP) offers revenue sharing to eligible creators who meet stricter content standards.  Creators have tools to manage comments and their channel's community interactions.  YouTube provides resources to support creator privacy and safety.\n\n* **Combating Abuse:** YouTube actively works to remove content promoting violent extremism or criminal organizations, collaborating with government entities and organizations like the GIFCT.\n\n* **Appeals Process:** Creators can appeal decisions regarding content removal or YPP suspension.\n\n\n",
    "last_update_summary": "## Competitor Policy Page Analysis: YouTube \"Our Policies\" (New Page)\n\n**Date:** 2025-07-20\n\n**Summary:**\nThis new policy page provides a consolidated and transparent overview of YouTube's content and monetization guidelines, emphasizing a balance between free expression and platform responsibility for creators, viewers, and advertisers.\n\n**Key Highlights from this New Policy Page:**\n\n*   **Comprehensive Policy Overview:** Consolidates explanations of both **Community Guidelines** (content rules) and **Advertiser-Friendly Content Guidelines** (monetization rules).\n*   **Enforcement Transparency:**\n    *   Details content detection relies on a mix of **automated systems and human review**.\n    *   Explicitly highlights the **appeals process** for creators, acknowledging that mistakes can happen.\n    *   Mentions **Educational, Documentary, Scientific, or Artistic (EDSA) exceptions** to policy violations, providing clear nuance.\n*   **Creator Support & Incentives:**\n    *   Emphasizes the **YouTube Partner Program (YPP)** as a long-term incentive for creators to reinforce YouTube's safety and policy adherence through revenue sharing.\n    *   Showcases various **creator tools** for managing content and communities, including channel guidelines, comment moderation, and privacy/safety resources.\n*   **Combating Abuse & Partnerships:**\n    *   States a clear stance against content promoting **violent extremist or criminal organizations**.\n    *   Highlights YouTube's role as a founding member of the **Global Internet Forum to Counter Terrorism (GIFCT)**, showcasing collaboration with industry experts.\n*   **User-Friendly Structure:** The page is designed with clear sections (\"How our guidelines work,\" \"How we support creators,\" \"Combating abuse\") and jump links for easy navigation.\n\n**Key Takeaway for PMs:**\nThis new policy page centralizes and clarifies YouTube's safety and monetization policies, offering increased transparency into their enforcement mechanisms (including appeals and EDSA exceptions) and prominently featuring how creator incentives (YPP) and in-platform tools support compliance. It also clearly outlines their partnerships in combating serious abuse.",
    "last_updated": "2025-07-20T23:52:00.423407Z"
  },
  "youtube-harassment-policy": {
    "policy_name": "Youtube Harassment Policy",
    "initial_summary": "## YouTube Harassment & Cyberbullying Policy Summary\n\nThis policy prioritizes the safety of creators, viewers, and partners.  Key prohibitions include:\n\n* **Harassment:** Prolonged insults or slurs targeting individuals based on protected group status, physical attributes, or victimhood (sexual assault, abuse, etc.).  A stricter approach is taken for content targeting minors.\n* **Doxxing & PII Sharing:** Sharing or threatening to share non-public personally identifiable information (PII),  except for widely available public information or clearly marked fake PII used for educational purposes.\n* **Abusive Behavior:** Encouraging brigading or other forms of coordinated abuse. Promoting harmful conspiracy theories linked to threats or violence.\n* **Threats & Violence:**  Threats against individuals or their property (including implicit threats), depictions of staged meet-ups to falsely accuse individuals, vigilante violence, or content glorifying or mocking death/injury.  This also includes realistic simulations of violence or death.\n* **Stalking & Sexualization:** Stalking, unwanted sexualization, sharing non-consensual intimate imagery, or fantasizing about/threatening sexual assault.\n\n**Exceptions:**  Content may be allowed if the primary purpose is educational, documentary, scientific, or artistic (e.g., debates, scripted performances, harassment awareness content). However, these exceptions do not excuse malicious harassment, especially based on protected group status.\n\n**Enforcement:** Violations result in content removal and email notification.  First-time offenders receive a warning with a policy training option.  Multiple violations or severe abuse can lead to strikes, channel suspension, or termination.  Repeat offenders may be prevented from accessing future policy trainings.  The policy applies to videos, comments, livestreams, and external links.\n",
    "last_update_summary": "### Trust & Safety Policy Analysis: YouTube Harassment & Cyberbullying Policy\n\n**To:** Product Manager\n**From:** Trust & Safety Analyst\n**Date:** [Current Date]\n**Subject:** Analysis of New YouTube Harassment & Cyberbullying Policy (Snapshot 2025-07-20)\n\nThis document outlines the key aspects of the new YouTube Harassment & Cyberbullying policy, effective as of 2025-07-20. As this is a new file being introduced, the \"changes\" represent the full scope of this updated policy's coverage and enforcement.\n\n---\n\n#### Concise Summary for Product Manager\n\nThis new policy significantly broadens YouTube's approach to harassment and cyberbullying, moving beyond direct threats to encompass a wider range of harmful behaviors and content types.\n\n**Key Policy Shifts & Product Implications:**\n\n1.  **Expanded Definition of Harassment:**\n    *   **Identity-Based Attacks:** Explicitly prohibits \"prolonged insults or slurs\" based on **physical traits, protected group status, or victim status** (e.g., sexual assault survivor). This requires robust detection of nuanced, sustained abuse rather than just explicit hate speech.\n    *   **Minors as Victims:** Introduces a **stricter approach** for content intended to \"shame, deceive, or insult\" individuals under 18. This likely necessitates enhanced detection for manipulative or emotionally harmful content targeting younger users.\n2.  **Specific Behavioral Prohibitions:**\n    *   **Doxxing & PII:** Clearly defines and prohibits the sharing of non-public Personally Identifiable Information (PII) to direct abuse. This impacts how users can share information about others, even accidentally.\n    *   **Coordinated Abuse (\"Brigading\"):** Prohibits content that encourages the \"coordinated abuse of an identifiable individual\" both on and off YouTube. This is critical for features involving user interaction, comments, and community management.\n    *   **Harmful Conspiracy Theories:** Bans content promoting or targeting individuals with conspiracy theories linked to \"direct threats or violent acts.\"\n    *   **Mocking & Simulation:** Prohibits content that \"revels in or mocks the death or serious injury of an identifiable individual\" and realistic simulations of deceased individuals describing violence. This impacts creative content and memorialization.\n    *   **Vigilantism & Stalking:** Explicitly bans staged meet-ups to accuse minors (without law enforcement) and vigilante acts (restraining/assaulting individuals). Stalking of identifiable individuals is also prohibited.\n    *   **Unwanted Sexualization:** Comprehensive coverage including \"lewd, degrading, sexually explicit\" descriptions, sharing/requesting Non-Consensual Intimate Imagery (NCII), and supporting sexual assault. This strengthens safeguards against sexual harassment.\n3.  **Broad Scope & Enforcement:**\n    *   **Applies Across All Content:** The policy covers videos, descriptions, comments, live streams, and *all* YouTube products/features, including **external links** (clickable URLs, verbal direction). This requires comprehensive moderation capabilities across the platform.\n    *   **EDSA Exceptions:** Content for **Educational, Documentary, Scientific, or Artistic** (EDSA) purposes *may* be allowed, but this is not a \"pass to harass,\" especially concerning protected group status. This implies a need for nuanced review and context-based decision-making.\n4.  **Monetization & Penalties:**\n    *   **Specific Monetization Triggers:** Introduces conditions for content removal or penalties related to monetization, such as repeatedly encouraging abusive audience behavior, persistent targeted abuse for financial gain, or inciting hostility between creators.\n    *   **Warning & Strike System:** Reaffirms the existing warning/strike system, with a new **policy training option** that allows a warning to expire after 90 days if the training is completed and no further violations of that *specific* policy occur within the window. Severe or dedicated violations can still lead to immediate channel termination.\n\n**Actionable Insights for PM:**\n\n*   **Tooling & Detection:** Consider capabilities for detecting nuanced forms of insults, PII (including fake PII that isn't clearly marked), brigading attempts (on/off-platform signaling), and the broader scope of unwanted sexualization.\n*   **User Education:** Ensure clarity in product messaging and help center articles to help creators understand these expanded prohibitions, especially regarding minors and PII.\n*   **Enforcement Workflows:** Review moderation workflows to accommodate the new policy nuances, particularly for EDSA exceptions and the specific monetization triggers. The policy training integration will also impact user re-education paths.\n*   **Feature Review:** Assess any features that involve direct user interaction, public display of user data, or community-building to ensure they align with the new prohibitions against brigading, doxxing, and general harassment.",
    "last_updated": "2025-07-20T23:52:17.264302Z"
  },
  "youtube-shopping-ads-policy": {
    "policy_name": "Youtube Shopping Ads Policy",
    "initial_summary": "## Google Shopping Ads Policies: Summary for Product Managers\n\nThis document outlines Google's policies for Shopping ads, aiming for a trustworthy and transparent advertising ecosystem.  Key areas covered are:\n\n**1. Prohibited Content:**  This includes counterfeit goods, dangerous products (drugs, weapons, explosives), products enabling dishonest behavior (hacking tools, fake documents), and inappropriate content (hate speech, violence, cruelty).  Certain content lacks optimal support and is therefore unsupported in Shopping ads, though this doesn't affect other Google platforms.\n\n**2. Prohibited Practices:** This section addresses abuse of the ad network (malicious content, unfair advantages, bypassing reviews), irresponsible data collection and use (insecure data handling), and misrepresentation (misleading promotions, inaccurate product portrayal).\n\n**3. Restricted Content:**  This category covers legally or culturally sensitive content allowed with limitations and potential additional requirements. Examples include adult-oriented content, alcoholic beverages, copyrighted material, gambling, healthcare products, political content, and High Fat Sugar Salt (HFSS) food & beverages (prohibited from targeting minors).\n\n**4. Editorial & Technical Requirements:**  Ads must meet high professional and editorial standards, be clear, and lead to relevant, user-friendly landing pages. Technical requirements ensure ad functionality across various formats.\n\n**Enforcement:** Google uses AI and human review to enforce policies, taking actions ranging from disapproving ads to suspending accounts for violations.  Advertisers can appeal decisions.  Compliance with all applicable laws and regulations is mandatory.\n",
    "last_update_summary": "This diff introduces a **new, comprehensive policy page for YouTube Shopping Ads**, effective July 20, 2025.\n\n**Key Changes/Additions based on this Policy Introduction:**\n\n*   **New Policy Framework:** Establishes a foundational and detailed set of guidelines covering acceptable content and advertising practices for YouTube Shopping ads and local inventory ads.\n*   **Four Core Policy Areas:** Defines rules across:\n    *   **Prohibited Content:** (e.g., counterfeit goods, dangerous products, inappropriate content).\n    *   **Prohibited Practices:** (e.g., abuse of ad network, irresponsible data collection & use, misrepresentation).\n    *   **Restricted Content:** (e.g., adult-oriented, alcoholic beverages, copyrighted, gambling, healthcare, political, trademarks).\n    *   **Editorial & Technical Standards.**\n*   **Specific Content Restrictions Highlighted:** A new section explicitly details restrictions for **High Fat Sugar Salt (HFSS) Food and Beverage** products, alongside existing sensitive categories.\n*   **Enforcement Mechanisms:** Outlines a dual approach using Google AI and human evaluation for policy compliance.\n*   **Enforcement Actions & Appeals:** Specifies actions (ad disapproval, impression capping, account suspension) and provides clear paths for advertisers to fix violations or appeal decisions.\n*   **Contextual Notices:** Includes temporary notices at the top regarding the suspension of ads in/to Russia due to the war in Ukraine.",
    "last_updated": "2025-07-20T23:52:35.847947Z"
  },
  "instagram-community-guidelines": {
    "policy_name": "Instagram Community Guidelines",
    "initial_summary": "# Competitor Policy Summary:\n\nThis document outlines Meta's Community Standards, encompassing policies for Facebook, Instagram, Messenger, and Threads.  Key areas covered include:\n\n* **Content Moderation:**  Policies define acceptable and unacceptable content, addressing issues like hate speech, violence, harassment, misinformation, and illegal activities.  A three-part enforcement approach (remove, reduce, inform) is used.  Newsworthiness and public interest are considered when evaluating potentially violating content.\n\n* **Account Integrity:** Policies cover authentic identity, inauthentic behavior, and account security.\n\n* **Safety & Well-being:**  Emphasis is placed on user safety, privacy, and dignity.  Specific attention is given to protecting minors, addressing issues like child exploitation and suicide/self-harm.\n\n* **Transparency & Enforcement:**  The document details how Meta detects and addresses policy violations, including technological solutions and human review.  Transparency reports on enforcement, intellectual property, government data requests, and content restrictions are publicly available.\n\n* **Governance & Appeals:**  Information is provided about Meta's Oversight Board, its role in policy appeals, and its impact.\n\n* **Research & Data:** Access to research tools and datasets related to content and advertising is highlighted.\n\n\nThe policy aims to balance freedom of expression with the need to maintain a safe and respectful online environment.  The US English version is considered the primary and most up-to-date document.\n",
    "last_update_summary": "Here's a concise summary of the provided Community Guidelines for a Product Manager:\n\n### Instagram Community Guidelines: New Policy Snapshot\n\nThis document represents a **new snapshot of Instagram's Community Guidelines (dated 2025-07-20)**, establishing the core policies for content allowed and prohibited on Meta's platforms.\n\n**Key Points:**\n\n*   **Scope Expansion:** The guidelines explicitly apply to **Facebook, Instagram, Messenger, and Threads**.\n*   **AI-Generated Content:** Community Standards now specifically cover **all types of content, including AI-generated content**.\n*   **Core Values:** Policies are grounded in four key values: **Authenticity, Safety, Privacy, and Dignity.**\n*   **Policy Structure:** Each section begins with a \"Policy Rationale\" followed by clear outlines of:\n    *   Content not allowed.\n    *   Content requiring additional context/information, or allowed with warning screens or age restrictions (18+).\n*   **Global Applicability:** These standards apply universally, with the **US English version designated as the primary, most up-to-date document**.\n*   **Commitment to Voice vs. Abuse:** Emphasizes empowering expression while taking serious measures to prevent abuse, including the removal of harmful content and potential allowance of newsworthy content that might otherwise violate policies.\n*   **Comprehensive Coverage:** Includes detailed sections on areas like Coordinating Harm, Dangerous Organizations, Fraud, Violence, Sexual Exploitation (adult & child), Bullying, Hate Conduct, Misinformation, and Intellectual Property.\n\nThis new policy snapshot provides a detailed and structured framework for content moderation across Meta's key platforms, with explicit considerations for emerging content types like AI-generated media and the inclusion of Threads.",
    "last_updated": "2025-07-20T23:50:33.707074Z"
  },
  "instagram-appeal-process": {
    "policy_name": "Instagram Appeal Process",
    "initial_summary": "Here's a concise summary of Instagram's Oversight Board appeal policy for a Product Manager:\n\n### Instagram Oversight Board Appeal Policy Summary\n\n**Key Points:**\n\n*   **Purpose:** Allows users to appeal Instagram's content decisions (both on their own content or content they reported) to an independent Oversight Board (OB).\n*   **Prerequisite:** Users **must** first exhaust Instagram's internal review process, including two internal reviews of the decision, before becoming eligible to appeal to the OB.\n*   **Appeal Types:**\n    *   Decisions to take down a user's content.\n    *   Decisions not to remove content a user reported.\n*   **Eligibility & Selection:** Not all content decisions are eligible for OB appeal. The OB itself selects only a limited number of eligible appeals for review and may not choose a specific case.\n*   **Timeline:** Appeals to the OB must be submitted within **15 days** of Instagram's final decision.\n*   **Status Check:** Users can track their appeal status on the Oversight Board's website using a reference number.",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of the new Instagram policy page for a Product Manager:\n\n### **New Instagram Policy: Oversight Board Appeals Process**\n\nThis new policy page outlines Instagram's (Meta's) formal process for users to appeal content decisions directly to the Oversight Board.\n\n**Key Points:**\n\n*   **New Policy Introduction:** This `diff` indicates the introduction of a dedicated policy page detailing the Oversight Board appeal process.\n*   **Two Appeal Types:** Users can now appeal:\n    1.  Decisions about their **own content** that was taken down.\n    2.  Decisions about **content they reported** that was *not* taken down.\n*   **Mandatory Internal Review First:** Before appealing to the Oversight Board, users **must** first exhaust Instagram's internal \"request a review\" process. This implies two internal reviews by Instagram are required.\n*   **Limited Eligibility:** Not all content decisions are eligible for an Oversight Board appeal, and the Board itself only selects a limited number of eligible appeals to review.\n*   **Strict Timeline:** Users have a **15-day window** from Instagram's final decision to submit an appeal to the Oversight Board.\n*   **Status Tracking:** Users can check the status of their appeal via the Oversight Board's website using a reference number.\n\n**Implication for Product:** This signifies a formalization and clear communication of the Oversight Board appeal path, emphasizing the prerequisite of internal review. It standardizes user expectations regarding the appeal process and eligibility.",
    "last_updated": "2025-07-20T23:50:18.502310Z"
  },
  "instagram-blocking-people": {
    "policy_name": "Instagram Blocking People",
    "initial_summary": "Here's a concise summary of the provided policy text for a Product Manager:\n\n### Instagram \"Blocking People\" Policy Summary\n\nThis policy details Instagram's \"Blocking People\" feature, a core safety and privacy control.\n\n**Key Points:**\n\n*   **Core Functionality:** Explains how users can block and unblock other accounts.\n*   **Impact of Blocking:**\n    *   Removes all past comments and likes from the blocked user.\n    *   Clarifies that a blocked user generally cannot see the blocker's content, message them, or mention them.\n    *   Provides guidance on how to view and manage a list of blocked accounts.\n*   **Related Privacy & Safety Controls:** The document also references other related user controls available in the \"Privacy, Security & Reporting\" section, including:\n    *   Making an account private.\n    *   Removing followers.\n    *   Restricting users (a softer form of control than blocking).\n    *   Temporarily limiting interactions from others.\n    *   Reporting messages or accounts.\n\nThis policy emphasizes user control over their interactions and visibility on the platform.",
    "last_update_summary": "### Competitor Policy Analysis: Instagram Blocking Page (New)\n\n**Summary for Product Manager:**\n\nInstagram has introduced a new, comprehensive Help Center page titled \"Blocking People.\"\n\n**Key Changes (New Content):**\n\n*   **Dedicated Blocking Resource:** This page centralizes information on how to block and unblock users, manage blocked lists, and details the impact of blocking on comments, likes, and mentions.\n*   **Broader User Controls:** Crucially, it also contextualizes blocking by cross-referencing and explaining related privacy and safety features, including:\n    *   Making accounts private.\n    *   Removing followers.\n    *   \"Restricting\" users (a softer alternative to blocking).\n    *   Temporarily limiting interactions.\n    *   Guidance on reporting messages/chats.\n\nThis addition suggests a focus on providing users with a holistic and easily discoverable understanding of their interaction control options.",
    "last_updated": "2025-07-20T23:50:25.066638Z"
  },
  "instagram-commerce-policies": {
    "policy_name": "Instagram Commerce Policies",
    "initial_summary": "### Competitor Policy Page Analysis: Unavailable Page\n\nThe provided text is an error message from Instagram's Help Center, indicating that a specific page is unavailable.\n\n**Key Points:**\n\n*   **Core Message:** \"This Page Isn't Available.\"\n*   **Reasons for Unavailability:** The page may be unavailable due to a broken link or because it has been removed.\n*   **User Guidance:** Users are advised to check if the link they are trying to open is correct.\n*   **Navigation Options:** The page provides clear calls to action to return to the Help Center Home or go back to the previous page.\n*   **T&S Relevance:** This page demonstrates how a competitor handles missing or removed content (potentially policy or help documentation), which impacts user experience and trust. It emphasizes the need for clear communication and alternative navigation when users encounter inaccessible information.",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of the provided diff for a Product Manager:\n\n### Instagram Commerce Policies - Page Removal\n\n**Summary of Key Change:**\n\nThe Instagram Commerce Policies page (specifically the snapshot from `2025-07-20T234936Z.html`) has been **removed or made unavailable**.\n\n**Details:**\n\n*   This diff indicates the *creation* of a file that, when accessed, displays a \"This Page Isn't Available\" message.\n*   This suggests that the Instagram Commerce Policies, previously accessible at this URL or intended for this URL, are no longer publicly published or have been moved.\n*   The content of the new page is a standard \"page not found\" or \"page removed\" error template with links back to the Help Center and general Instagram information.\n\n**Impact for T&S:**\n\nThis implies that the specific version of Instagram Commerce Policies associated with this snapshot date is no longer live or discoverable via its direct URL. Further investigation may be required to determine if these policies have been superseded, moved to a new location, or entirely deprecated.",
    "last_updated": "2025-07-20T23:50:28.878252Z"
  },
  "tiktok-blocking-users": {
    "policy_name": "Tiktok Blocking Users",
    "initial_summary": "Here's a concise summary of the competitor's policy page for a Product Manager:\n\n### Competitor Policy Page Summary\n\nThe competitor's policy documentation serves as a comprehensive help center, detailing an exceptionally broad range of platform functionalities, from core features to advanced creator tools and monetization.\n\n**Key Trust & Safety Takeaways:**\n\n*   **Robust User Control & Safety Tools:** A significant focus is placed on empowering users with safety mechanisms. Detailed instructions for blocking (individual users, multiple users from comments, unblocking) are prominently featured, alongside mentions of a \"Safety Center,\" \"Community Guidelines,\" and \"Report a problem\" functionality.\n*   **Comprehensive Feature & Content Coverage:** The policies span an extensive array of content types and features including user-generated videos, AI-generated content, creator tools, live streaming, e-commerce (\"TikTok Shop\"), messaging, and content discovery, indicating a complex ecosystem requiring broad T&S oversight.\n*   **Creator Monetization & Ecosystem:** Policies extend to creator monetization features (LIVE, Gifts, promotion tools), necessitating guidelines for commercial activities, fraud prevention, and responsible content creation related to earning.\n*   **Legal & Policy Framework:** The document points to a foundational set of legal and policy resources, including Terms of Use, Privacy, Copyright, and Law Enforcement guidelines, signifying a structured approach to compliance and trust.\n*   **Algorithmic Transparency & Global Reach:** It touches on content recommendation algorithms (\"How TikTok recommends content\") and highlights a vast global operational scope through an extensive list of supported languages, implying a need for culturally nuanced and legally compliant T&S policies worldwide.",
    "last_update_summary": "### Competitor Policy Update: TikTok User Blocking Policy (New Page)\n\n**Summary for Product Manager:**\n\nTikTok has published a new support page titled \"Blocking someone,\" providing detailed instructions on how users can manage unwanted interactions. This new content covers:\n\n*   **Individual Blocking/Unblocking:** Steps to block and unblock single users directly from their profile.\n*   **Bulk Blocking from Comments:** A new feature allowing users to block multiple accounts simultaneously from the comments section of their videos.\n*   **Impact of Blocking:** Clearly defines that blocked users are prevented from viewing posts, sending direct messages, commenting, following, or liking.\n\n**Key Change Based on Diff:** This is a *newly introduced* policy page/help article (as indicated by `new file mode 100644` in the diff), rather than an update to an existing one. It highlights TikTok's efforts to provide clearer guidance and potentially new functionality around user safety and interaction control.",
    "last_updated": "2025-07-20T23:50:37.782964Z"
  },
  "youtube-hiding-users": {
    "policy_name": "Youtube Hiding Users",
    "initial_summary": "As a Trust & Safety analyst, here is a concise summary of the provided policy document on YouTube's \"Hide users from your channel\" feature for a Product Manager:\n\n---\n\n### YouTube: \"Hide Users from Your Channel\" Policy Summary\n\nThis policy outlines a channel moderation feature allowing content creators to control who can interact with their content.\n\n**Key Functionality:**\n\n*   **Purpose:** Channel owners can \"hide\" specific viewers to prevent their comments from appearing on the channel and to stop them from creating clips from videos or live streams.\n*   **Impact on Hidden User:**\n    *   All previous comments from the hidden user on the channel will be hidden within 48 hours.\n    *   Future comments from the hidden user will not appear.\n    *   The hidden user will **not** receive a notification that they have been hidden.\n*   **Methods to Hide:**\n    1.  **From a Comment:** Select \"More\" next to a user's comment, then \"Hide user from channel.\"\n    2.  **Via YouTube Studio:** In \"Settings\" > \"Community\" > \"Automated Filters,\" paste the user's channel URL into the \"Hidden users\" box.\n*   **Managing Hidden Users:**\n    *   A list of hidden users is available in YouTube Studio under \"Settings\" > \"Community\" > \"Automated Filters.\"\n    *   Users can be \"shown\" (unhidden) from this list, which allows their *future* comments to appear. Previous comments remain hidden.\n*   **Scope:** This is a **channel moderation tool** for managing audience interaction. It is distinct from reporting abuse, harassment, or policy violations, which should be directed to the Safety Center.\n\n---",
    "last_update_summary": "### Competitor Policy Update: YouTube - Hide Users\n\nThis diff indicates the **creation of an entirely new policy page** detailing YouTube's \"Hide users from your channel\" feature. Therefore, all content on this page represents a new, official outline of this functionality.\n\n**Key Additions/Clarifications:**\n\n*   **Expanded Impact of Hiding:** Beyond preventing comments from appearing on a channel and in YouTube Studio, **hiding a user now explicitly prevents them from creating clips** from the channel's videos or live streams.\n*   **Detailed How-To Guides:** The policy now provides clear, step-by-step instructions for:\n    *   Hiding a user directly from a comment.\n    *   Hiding a user via their channel URL in YouTube Studio settings (`Settings > Community > Automated Filters > Hidden users`).\n    *   Finding and reviewing the list of hidden users in YouTube Studio.\n    *   \"Showing\" (unhiding) a user in YouTube Studio.\n*   **Behavioral Clarifications:**\n    *   All previous comments from a hidden user will be hidden within 48 hours.\n    *   Hidden users **do not receive a notification**.\n    *   Unhiding a user only allows *future* comments to appear; *previous comments remain hidden*.",
    "last_updated": "2025-07-20T23:52:25.619045Z"
  }
}
