{
  "tiktok-community-guidelines": {
    "policy_name": "Tiktok Community Guidelines",
    "initial_summary": "## TikTok Competitor Community Guidelines Summary\n\nThis document outlines a comprehensive set of community guidelines for a TikTok-like platform, effective May 17, 2024.  Key areas covered include:\n\n* **Content Moderation:**  The platform employs a three-pronged approach: removing violating content, restricting age-inappropriate content (for users under 18), and making ineligible for recommendation (For You feed) content that doesn't meet platform standards.\n\n* **Prohibited Content:**  A wide range of prohibited content is detailed, encompassing: violence, hate speech, sexual abuse, harassment, self-harm, dangerous activities, misinformation, scams, regulated goods (alcohol, firearms, etc.), and violations of privacy and security.  Specific examples are provided within each category, though the document notes that these are not exhaustive.\n\n* **Community Empowerment:** The platform provides users with tools and resources to manage their experience, including safety settings, filtering options, and reporting mechanisms.\n\n* **Enforcement:** While the specifics of enforcement aren't detailed, the document implies a combination of automated and human moderation to address policy violations.\n\nThe guidelines aim to create a safe and welcoming environment while balancing creative expression and the prevention of harm.  The full guidelines are categorized for easier navigation, with additional information and examples available for each section.\n",
    "last_update_summary": "## Trust & Safety Policy Update: TikTok Community Guidelines (New Policy)\n\n**To:** Product Manager\n**From:** Trust & Safety Analyst\n**Date:** [Current Date]\n**Subject:** Analysis of TikTok's New Community Guidelines (Effective May 17, 2024)\n\nThis diff represents the introduction of TikTok's latest Community Guidelines, released April 17, 2024, and effective May 17, 2024. Rather than minor changes, this appears to be a comprehensive refresh.\n\n### Key Takeaways for Product:\n\n1.  **Clearer Policy Structure:**\n    *   **Distinction between \"Rules\" and \"Standards\":** The policy explicitly differentiates \"rules\" (what's allowed on TikTok, subject to removal) from \"standards\" (what's eligible for the For You feed/FYF). This is a crucial clarification for content moderation and algorithmic promotion.\n    *   **Organized by Topic:** Guidelines are structured under clear categories (e.g., Youth Safety, Safety & Civility, Mental & Behavioral Health, Integrity & Authenticity, Regulated Goods, Privacy & Security).\n\n2.  **Tiered Content Moderation Approach:** TikTok now clearly outlines four safety approaches:\n    *   **Remove:** Content violating \"rules\" (public or private) will be removed.\n    *   **Restrict:** Content not suitable for youth will be restricted to users 18+.\n    *   **Make Ineligible for FYF:** Content not meeting \"recommendation standards\" will not be promoted on the For You feed.\n    *   **Empower:** Provide users with information, tools (labels, opt-in screens, warnings), and resources (safety toolkit, account controls, in-app features).\n\n3.  **Emphasis on Integrity and Authenticity:**\n    *   **AI-Generated Content (AIGC):** A new specific sub-category for \"Edited Media and AI-Generated Content (AIGC)\" is now present under \"Integrity and Authenticity,\" indicating an increased focus on this area.\n    *   **Other Areas:** Continued focus on Misinformation, Civic/Election Integrity, Fake Engagement, Unoriginal Content, Spam, and Deceptive Behavior.\n\n4.  **Detailed Section on \"Accounts and Features\":**\n    *   Includes specific rules/standards for **TikTok LIVE, Search, External Links, Comments & Direct Messages, and Monetization**, indicating dedicated policy considerations for these product areas.\n\n5.  **Enhanced Enforcement Transparency:**\n    *   Sections on \"Public Interest Exceptions,\" \"Detection and Reporting,\" and \"Notice and Appeals\" provide more clarity on their enforcement processes.\n\n**Overall:** This new policy reflects a more structured, explicit, and nuanced approach to content moderation, particularly with its tiered system and specific attention to emerging areas like AIGC. Product teams should review the relevant sections to ensure features and user flows align with these updated guidelines, especially regarding content visibility and algorithmic distribution (FYF eligibility).",
    "last_updated": "2025-07-21T00:59:39.549400Z"
  },
  "tiktok-live-moderation": {
    "policy_name": "Tiktok Live Moderation",
    "initial_summary": "# TikTok LIVE Moderation Policy Summary\n\nThis document details TikTok's approach to content moderation during LIVE streams.  Key features include:\n\n* **Creator Controls:** Creators can add moderators, control audience age (18+), filter comments, block keywords, mute, and block viewers directly from the LIVE settings or chat.  This applies to both mobile app and web browser access (via LIVE Studio or OBS Studio for broadcasting; not required for moderation).\n\n* **Moderator Permissions:** Moderators, granted permission by the creator, can mute, block viewers, and report comments violating Community Guidelines.  The level of control a moderator has is determined by the creator.\n\n* **User Actions:**  Viewers can be reported, muted (temporarily), or blocked (preventing future LIVE viewership and other interactions with the creator).  Notifications are sent to muted/blocked users.\n\n* **Accessibility:** Moderation tools are accessible both within the LIVE settings and directly from the LIVE chat interface on both the mobile app and web browser.\n",
    "last_update_summary": "This new policy page outlines TikTok's LIVE moderation tools and processes for creators and their appointed moderators.\n\n**Key Changes/Additions:**\n\n*   **New Policy Page:** This is a comprehensive new resource dedicated to LIVE moderation.\n*   **Defined Roles & Permissions:** Clearly details the distinct moderation capabilities available to creators and their designated moderators.\n*   **Expanded Moderation Actions:** Users can now:\n    *   Block specific messages and keywords.\n    *   Report violations within the chat.\n    *   **Mute** viewers for a specified duration (viewers are notified).\n    *   **Block** viewers, preventing them from watching the current LIVE and interacting with the creator's content (viewers are notified).\n    *   Creators can implement **Audience Controls** to limit LIVEs to viewers aged 18+.\n*   **Flexible Management:** Moderation actions can be performed directly from LIVE settings (before or during the LIVE) or by tapping/clicking on a viewer's profile/comment within the chat, accessible on both the TikTok app and web browser.\n*   **Moderator Empowerment:** Creators can grant specific permissions to moderators, enabling them to manage comments and blocked account lists.\n\nThis policy aims to provide creators and their teams with clear guidelines and tools to manage their LIVE streams effectively and maintain a safer environment.",
    "last_updated": "2025-07-21T00:59:45.538145Z"
  },
  "tiktok-shop-prohibited-products": {
    "policy_name": "Tiktok Shop Prohibited Products",
    "initial_summary": "## Competitor Policy Summary: TikTok Shop Academy (US)\n\nThis document appears to be incomplete or broken.  The provided text only shows a heading related to boosting sales on TikTok Shop Academy and a JavaScript error message.  **No actual policy information is present.**  Therefore, no meaningful summary of their policy can be provided.  Further investigation is needed to obtain the actual policy document.\n",
    "last_update_summary": "**Summary for Product Manager: Competitor Policy Page Analysis**\n\nThis diff indicates the creation of a *new file* for a competitor's \"prohibited products\" policy page (dated 2025-07-20).\n\n**Key Changes:**\n\n*   **New Page Created:** A new policy page `tiktok-shop-prohibited-products` has been added.\n*   **Placeholder Content:** The page's content is currently a generic \"JavaScript not enabled\" message, suggesting it's an unpopulated placeholder or a technical error page, rather than an active policy.\n*   **No Policy Content Detected:** There are no actual policy rules or guidelines present in this version of the page.\n\n**Impact:**\n\nCurrently, there is no substantive policy information to analyze. This appears to be a technical setup or placeholder for a future policy page. We should monitor this URL for updates to identify actual policy content when it becomes available.",
    "last_updated": "2025-07-20T23:50:56.579760Z"
  },
  "whatnot-blocking-a-user": {
    "policy_name": "Whatnot Blocking A User",
    "initial_summary": "## Whatnot User Blocking Policy Summary\n\nThis document details Whatnot's user blocking functionality.  Users can block others to prevent:\n\n* Following\n* Direct messaging\n* Profile viewing\n* Livestream interaction (bookmarking, joining, chatting)\n* Future purchases from listings\n\nExisting orders are unaffected by blocking.  Blocking is currently permanent.  There's no list of blocked users.  Being removed from a livestream is different from being blocked by a user.  Users can report violations of Community Guidelines separately.\n",
    "last_update_summary": "Here's a concise summary for a product manager based on the provided diff:\n\n## New User Blocking Policy Page\n\n**Overview:**\nWhatnot has launched a new help center article detailing its \"Blocking a User\" functionality. This feature empowers users to control their interactions on the platform, acting as a direct user-level safety tool.\n\n**Key Functionality & Impact:**\nBlocking a user prevents them from:\n*   Following or Direct Messaging the blocker.\n*   Viewing the blocker's profile.\n*   Joining, bookmarking, or chatting in the blocker's livestreams.\n*   Making future purchases from the blocker's marketplace listings (existing orders are honored).\n\n**User Experience & Workflow:**\n*   **How to Block:** Users navigate to another user's profile, tap the three-dot menu, and select \"Block User.\"\n*   **How to Unblock:** Users must search for the specific blocked user by name, go to their profile, and select \"Unblock\" from the menu.\n\n**Important Caveats & Limitations:**\n*   **No Blocked List:** The policy explicitly states that there is currently no way for users to view a list of all accounts they have blocked.\n*   **\"Permanent\" Advisory:** Despite the ability to unblock, the policy strongly cautions users that blocking is currently \"permanent\" due to the absence of a blocked list, making unblocking difficult unless the specific user's name is remembered.\n*   **Livestream Bans vs. Blocks:** The policy clarifies that a temporary ban from a livestream by a host/mod is distinct from a user-initiated block.\n\n**Trust & Safety Relevance:**\n*   The policy highlights that blocking is a user's personal control, but users should still report any Community Guideline violations to the Trust & Safety team, positioning blocking as a complementary action to formal reporting.",
    "last_updated": "2025-07-21T00:59:53.911642Z"
  },
  "whatnot-buyer-protection": {
    "policy_name": "Whatnot Buyer Protection",
    "initial_summary": "# Whatnot Buyer Protection Policy Summary\n\n**Key Points:**\n\n* **Refund Eligibility:** Whatnot offers buyer protection for incomplete/incorrect items, items not as described/inauthentic, and packages not received.  Refunds are generally granted within 30 days of purchase or 14 days of delivery (7 days for certain categories like coins, sneakers, luxury goods; 2 days for plants).  Whatnot may require item return in original condition.  German buyers pay return shipping.\n\n* **Refund Exclusions:**  Consumables (opened/consumed items, breaks except for missing/damaged items), tips, refused deliveries, uncollected packages, unpaid customs fees, exchange rate losses, chargebacks, digital content, off-platform transactions, and instances of suspected fraud are excluded.  Returning the wrong item also voids a refund.\n\n* **Time Limits & Exceptions:**  Specific shorter deadlines apply for certain high-value categories and counterfeit claims (30 days from receipt). Extensions may be granted for international orders, pre-orders, custom orders, and due to natural disasters.  \"Delivered\" but not received items require contact within 14 days.\n\n* **EU/UK Right of Withdrawal:** EU/UK buyers have a 14-day right of withdrawal, requiring item return within 14 days of cancellation.  Buyers are responsible for return shipping costs. This right doesn't apply to breaks, surprise products, or certain unsuitable goods (hygiene, mixed, sealed software/media, customized items, perishable goods).\n\n\n* **High-Value Loss Reimbursement:** A separate policy exists for high-value card losses in breaks, potentially reimbursing market value.\n\n",
    "last_update_summary": "This new policy document outlines Whatnot's comprehensive Buyer Protection Policy, designed to ensure a trustworthy buying experience.\n\n### Whatnot Buyer Protection Policy - Key Summary for PM\n\n**Core Purpose:** Provides refund eligibility and processes for buyers when purchases go wrong.\n\n**Key Coverage Areas (When Buyers are Entitled to a Refund):**\n*   **Incomplete or Incorrect Items:** Missing or wrong items.\n*   **Item Not as Described or Inauthentic:** Damaged, expired, defective, counterfeit, or mismatching listing descriptions/conditions.\n*   **Package Not Received:** Lost, delayed, not shipped, misdelivered, or marked \"delivered\" but not received.\n*   *Note: A more detailed list of covered issues is provided, including additional postage costs or incorrect sales tax.*\n\n**Refund Request Timelines:**\n*   **General:** Earlier of **30 days from purchase** or **14 days from delivery**.\n*   **Specific Categories (Shorter Windows):**\n    *   **7 days from delivery** (or 30 days from purchase): Coins & Money, Sports Cards, Sneakers & Streetwear, Trading Card Games, Luxury Goods.\n    *   **2 days from delivery** (or 30 days from purchase): Plants.\n*   **Exceptions/Extensions:** Specific rules for marked-delivered orders (14 days to contact support), international orders (7/14 days from delivery), counterfeit claims (30 days from receipt), preorders, and natural disasters.\n\n**Return Requirements:**\n*   Whatnot may require items to be returned in the **same condition as received**; opening products or removing tags can disqualify or reduce refunds.\n*   **German buyers** are required to pay return shipping costs, which will be deducted from their refund.\n\n**Key Exclusions (When Refunds Are NOT Provided):**\n*   **Consumable Products:** Generally not refundable once consumed/opened (exceptions for missing/damaged items in \"Breaks\").\n*   **Tips** to sellers.\n*   **Refusing delivery** or **failing to pick up** packages.\n*   **Customs Fees:** Refusal to pay or fees already paid are not refunded.\n*   **Exchange Rate** fluctuations.\n*   Orders already subject to **chargebacks** with financial institutions.\n*   **Digital Content**.\n*   Cases of **potential fraud/abuse** of policy (at Whatnot's discretion).\n*   Returning an **incorrect item** (no refund, item not returned to buyer).\n*   **Off-platform transactions**.\n\n**Special Policies:**\n*   **High Value Loss Reimbursement:** Separate policy for missing Sports/Trading Cards in \"breaks,\" allowing refund based on market value.\n*   **EU/UK Right of Withdrawal:** Consumers in EU/UK have a statutory right to cancel within 14 days of receipt from a professional seller and receive a refund if the item is returned within 14 days of cancellation. Buyer pays return shipping. Specific exclusions apply (e.g., \"Breaks,\" unsealed health/hygiene products, custom goods).\n\nThis policy establishes clear guidelines for buyer protection, balancing consumer rights with operational constraints and fraud prevention.",
    "last_updated": "2025-07-21T01:00:04.581416Z"
  },
  "whatnot-enforcement-actions": {
    "policy_name": "Whatnot Enforcement Actions",
    "initial_summary": "## Whatnot's Trust & Safety Policy: Summary for Product Managers\n\nWhatnot's policy enforces Community Guidelines with penalties escalating based on violation severity and account history.  Violations are cumulative, meaning repeated offenses, even minor ones, can lead to a permanent ban.\n\n**Key Actions & Penalties:**\n\n* **Warnings:** For minor infractions, with guidance provided.\n* **Suspensions:** Temporary account access loss (2 or 7 days).\n* **Selling Access Revoked:**  Loss of ability to sell or go live.\n* **Ban:** Permanent account termination for serious or repeated violations.\n* **Discovery Restriction:** Temporary reduced visibility in feeds/recommendations.\n* **Other Penalties:** Loss of access to features like Direct Messages.\n\n**Account Health & Performance:**\n\n* An Account Health dashboard tracks Seller Performance Rates (fulfillment, shipping) and Policy Standing.\n* Poor performance in either area can result in warnings and penalties.\n* Policy Standing has five levels (Excellent, Good, Fair, Poor, Very Poor), reflecting penalty history.\n\n**Violation Expiration:**\n\n* Most violations expire after 180 days, except for bans and offboarding, which are permanent.\n\n**Appeals:**  Users can appeal penalties via email.\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a concise summary of the new \"What Actions We Take\" policy for a Product Manager:\n\n### New Policy: What Actions We Take (Enforcement Actions)\n\n**Key Introduction:**\nThis new policy document outlines Whatnot's approach to enforcing Community Guidelines and the actions taken against users for violations. It emphasizes fairness, proportionality, and transparency, aiming to foster a trusted platform while providing users opportunities to course-correct.\n\n**Core Principles:**\n*   **Proportionality:** Actions are tailored to the severity of the violation and a user's existing Trust & Safety record.\n*   **Cumulative Violations:** Multiple, less severe violations can eventually lead to a ban.\n*   **Fairness:** Policy aims to maintain trust while allowing users to improve.\n\n**Enforcement Actions/Penalties:**\n*   **Warning:** Notification and guidance for minor issues.\n*   **Suspension:** Temporary loss of access (2 or 7 days).\n*   **Revoke Selling Access:** Removal of ability to sell or go live (for sellers).\n*   **Ban:** Permanent account termination for serious or repeated violations.\n*   **Discovery Restricted:** Temporary reduction in account discoverability (Feeds/Recommendations) for certain violations. Profile, Search, and \"Followed Hosts\" feeds remain visible.\n*   **Other Penalties:** Loss of specific features (e.g., Direct Messages).\n*   **Ongoing Investigation Suspensions:** Temporary suspension during serious reviews.\n\n**Violation Expiry & Appeals:**\n*   Most violations expire after 180 days. Permanent bans/offboarding do not expire.\n*   Appeals are handled by responding directly to the original enforcement email.\n\n**Account Health Dashboard Integration (for applicable users):**\n*   Users can monitor **Seller Performance Rates** (Fulfillment Success, On-Time Shipment) and **Policy Standing**.\n*   **Policy Standing States:**\n    *   **Excellent:** Good standing.\n    *   **Good:** Warning received; further violations risk stronger penalties.\n    *   **Fair:** Multiple warnings; risk of suspensions/bans.\n    *   **Poor:** 2-day suspension received; risk of stronger penalties.\n    *   **Very Poor:** 7-day suspension and/or selling access revoked; risk of ban.\n\n**Impact for Product:**\nThis document establishes a clear, tiered enforcement framework and introduces \"Discovery Restricted\" as a new penalty type. It also formalizes the role of the \"Account Health\" dashboard in communicating policy standing and performance. Product teams should ensure UI/UX around warnings, suspensions, and the Account Health dashboard aligns with these definitions and provides necessary user clarity.",
    "last_updated": "2025-07-21T01:00:09.611421Z"
  },
  "whatnot-hate-and-harassment": {
    "policy_name": "Whatnot Hate And Harassment",
    "initial_summary": "## Whatnot Hate and Harassment Policy Summary\n\nThis policy prohibits hateful conduct and harassment on the Whatnot platform, including sexual harassment and off-platform abuse that impacts the Whatnot community.  Key prohibited behaviors include:\n\n* **Harassment:**  Repeated unwanted contact, personal attacks, targeted obscene language,  using contact information for non-transactional purposes, and disparaging others (sellers disparaging buyers in streams, for example).  Exceptions may be made for newsworthy events or public figures.\n\n* **Threats & Harmful Wishes:** Wishing harm, making threats (implied or explicit), and exposing someone's sexual orientation or gender identity without consent.\n\n* **Sexual Harassment:** Unwanted sexual advances, objectification, degrading comments about sexual practices, sharing intimate images without consent.\n\n* **Hateful Conduct:** Any behavior promoting violence or hatred based on protected characteristics (race, ethnicity, religion, gender, sexual orientation, etc.). This includes using slurs (unless used self-referentially and with clearly indicated positive intent), supporting hate groups, and displaying hateful symbols (with exceptions for historical context, like pre-1933 artifacts). Specific allowances are made for the Confederate battle flag under very specific historical and non-hateful contexts.\n\n* **Off-Platform Abuse:**  Whatnot may take action against users coordinating harassment or hate off-platform that impacts the Whatnot community, even in rare instances where the off-platform behavior poses a significant threat to the platform.\n\nEnforcement actions against accounts may include removal.  The severity and persistence of the behavior are considered when evaluating violations.\n",
    "last_update_summary": "This diff indicates the **creation of a new policy page** for Whatnot's Hate and Harassment Policy, dated August 21, 2024. It is not a modification of a previous version but a foundational document outlining prohibited behaviors.\n\n## Whatnot's New Hate and Harassment Policy: Key Provisions\n\nThis policy establishes clear prohibitions against hateful conduct and harassment (including sexual harassment) to foster a safe and respectful environment, explicitly stating that such behaviors erode trust and discourage participation.\n\n**Key Prohibitions and Definitions:**\n\n*   **Harassment:** Prohibits content and patterns of behavior that demean or threaten individuals. This includes:\n    *   **Unwanted Conduct/Contact:** Targeting accounts, repeated obscene language, continued contact after being asked to stop, and misuse of contact information.\n    *   **Personal Attacks/Repeated Disparagement:** Attacks based on appearance, hygiene, intellect, personality; negative doctored content; sellers disparaging buyers; and repeated insults across multiple streams or unsolicited DMs (Note: Exceptions for newsworthy events/public figures).\n    *   **Threats and Harmful Wishes:** Wishing death/disease, implied threats, non-consensual exposure of sexual orientation/gender identity, and glorifying traumatic events (e.g., self-harm, eating disorders).\n\n*   **Sexual Harassment:** Prohibits unwanted sexual advances, sexual objectification, or degrading attacks on sexual practices. Examples include:\n    *   Unwanted romantic approaches (e.g., comments on body, encouraging adult content, requests for sexually suggestive posing).\n    *   Disparagement based on perceived sexual practices or morality.\n    *   Sharing or threatening to share intimate images/audio without consent.\n    *   Blackmail or forced coercion for intimate images.\n\n*   **Hateful Conduct:** Defines and prohibits behavior promoting violence or hatred based on protected characteristics (e.g., race, gender, sexual orientation, disability, religion, veteran status). Examples include:\n    *   Expressions of intolerance, hatred, or subjugation against protected groups/individuals.\n    *   Sexualizing, demeaning, dehumanizing, or suggesting inferiority based on protected groups.\n    *   Racial mockery, slurs, epithets (with nuanced allowance for self-referential/positive use if intent is clear).\n    *   Support for known hate groups/ideologies; promotion of harmful stereotypes.\n    *   **Specific Prohibited Imagery/Symbols:** Nazi propaganda, Swastikas (with narrow exceptions for pre-1933 historical artifacts or clearly anti-Nazi context), grotesque Black Americana (e.g., Gollywog dolls), and live/recorded blackface/yellowface/redface/brownface.\n    *   **Confederate Battle Flag Exception:** Permitted only when displayed on historically accurate miniatures/models, artistic depictions denouncing the flag/slavery, or Civil-War themed book/video game covers without any hateful context.\n\n*   **Off-platform Abuse:** Whatnot may take action if verifiable evidence shows off-platform coordination of harassment/hate intended to occur on Whatnot (e.g., encouraging followers to send hateful messages). In rare instances, action may be taken for severe and persistent off-platform hate/harassment that significantly threatens the Whatnot community.\n\n**Enforcement:** Violations of this policy may result in actions against the account, including removal.",
    "last_updated": "2025-07-21T01:00:21.684301Z"
  },
  "whatnot-how-to-report": {
    "policy_name": "Whatnot How To Report",
    "initial_summary": "## Whatnot User Reporting and Investigation Policy Summary\n\n**Key Points:**\n\n* **Reporting Methods:** Users can report suspicious behavior via in-app reporting features during livestreams, in direct messages (DMs), on product listings, or user profiles (Android & Web).  Email reports to trustandsafety@whatnot.com are also accepted.  All reports are anonymous.\n* **Reporting Locations:** Reporting options are available within livestreams (for buyers and sellers), in-live chat, DMs, product listings, and user profiles (Android/Web).\n* **Investigation Process:** Whatnot's Trust & Safety team investigates reports, analyzing data, reviewing livestreams, and potentially temporarily suspending users during investigations. Outcomes are not publicly disclosed.\n* **Proactive Monitoring:**  The Trust & Safety team proactively investigates potential policy violations based on data analysis and community reports, taking action against users exhibiting patterns of abuse.\n\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of the new policy page for a Product Manager:\n\n### Whatnot: How To Report A User & How We Investigate (New Policy Page)\n\n**Key Change:** This is a **newly published policy page** detailing Whatnot's user reporting mechanisms and its internal investigation process. It provides explicit guidance to users on how to report violations and clarifies how Whatnot's Trust & Safety (T&S) team handles these reports.\n\n**Summary for Product Manager:**\n\nThis new policy page outlines clear methods for users to report policy violations and provides transparency on how Whatnot's Trust & Safety team investigates these reports.\n\n**Key Takeaways:**\n\n1.  **Multiple Reporting Channels:** Users can report suspicious behavior via:\n    *   **In-app:** During a livestream (tapping username), in-live chat, Direct Messages, Product Listings (for sellers), and User Profiles (Android & Web only).\n    *   **Email:** `trustandsafety@whatnot.com` for general reports.\n2.  **Anonymity:** All user reports are explicitly stated to remain **anonymous**.\n3.  **Investigation Process:**\n    *   **Methodology:** Whatnot's T&S team investigates reports by reviewing facts, user history, data, and livestreams.\n    *   **Interim Measures:** During an investigation, Whatnot may temporarily suspend a reported user's access to certain features (e.g., going live).\n    *   **Confidentiality:** The outcome of individual investigations will **not be disclosed** to the reporter due to privacy reasons.\n    *   **Proactive Enforcement:** The T&S team also proactively monitors data for patterns of abuse and launches investigations based on internal analysis and community reports, taking action when evidence is found.\n\nThis document serves to empower users with clear reporting pathways and to set expectations regarding the investigation process, including the anonymity of reports and the confidentiality of outcomes.",
    "last_updated": "2025-07-21T01:00:27.420080Z"
  },
  "whatnot-moderator-guidelines": {
    "policy_name": "Whatnot Moderator Guidelines",
    "initial_summary": "## Whatnot Moderator Guidelines Summary\n\n**Key Points:**\n\n* **Goal:** Maintain a safe and fun marketplace by empowering moderators to manage livestream chats effectively.  Moderation should be fair and unbiased, prioritizing community safety and a positive user experience.\n\n* **Moderator Responsibilities:**\n    * Remove users only for violations of Community Guidelines or at the seller's request.  Avoid banning users for differing opinions.\n    * Maintain a respectful and engaging chat environment.\n    * Address inappropriate messages promptly, escalating to warnings before bans.\n    * Seek seller feedback.\n\n* **Moderator Privileges:**\n    * Remove users from a specific livestream (not a platform-wide ban).\n    * View muted chat messages.\n\n* **Adding/Removing Moderators:** Sellers can add moderators during or before a livestream via the scheduling section or by selecting the \"Allow to Moderate\" option from a user's chat profile.  Removal is done similarly using the \"Remove Moderator\" option.\n\n* **Underlying Principle:**  Moderation should be proactive and fair, guided by Whatnot's Community Guidelines and a principle of leading by example, not force.\n",
    "last_update_summary": "As a Trust & Safety analyst, I've reviewed the provided diff.\n\n**Analysis:**\n\nThis diff represents the *introduction of a new policy page* titled \"Moderator Guidelines\" for Whatnot. It's not a change to an existing policy, but the establishment of a brand new set of guidelines for moderators.\n\n---\n\n### **New Whatnot Moderator Guidelines Policy**\n\n**Summary for Product Manager:**\n\nA new comprehensive \"Moderator Guidelines\" policy page has been introduced to define the expectations, best practices, and privileges for moderators on Whatnot.\n\n**Key Points:**\n\n*   **Vision:** Aims to make Whatnot the safest P2P marketplace, emphasizing that good moderation is critical for community management and compliance with Community Guidelines.\n*   **Core Principle:** \"Lead by example, not by force.\" Moderators are expected to act unbiasedly and not abuse their powers (e.g., no banning for opinions, only if actions warrant it or seller requests).\n*   **Primary Responsibility:** Ensure livestream chat meets seller's behavior and content standards, taking action against offending users and spam.\n*   **Best Practices:** Guidelines cover respectful treatment, chat engagement, answering user questions, avoiding spam, deleting inappropriate messages, being firm with rude users, and issuing verbal warnings before bans.\n*   **Moderator Privileges:**\n    *   **Remove Users From Show:** Allows removal from the *current* livestream only; this is *not a platform ban* and does not prevent them from joining future streams or other sellers' streams.\n    *   **View Muted Chat Messages:** Moderators can see messages hidden by global settings or the seller's \"Muted Words\" list.\n*   **Management:** Sellers can add or remove moderators both when scheduling a show and during a live stream.\n\nThis new policy standardizes moderator behavior and tools, aiming to enhance user safety and experience on the platform.",
    "last_updated": "2025-07-21T01:00:33.619728Z"
  },
  "youtube-community-guidelines": {
    "policy_name": "Youtube Community Guidelines",
    "initial_summary": "## YouTube's Trust & Safety Policy Summary:\n\nThis document outlines YouTube's approach to content moderation, creator support, and combating abuse.  Key points include:\n\n* **Content Moderation:**  YouTube uses automated systems and human reporting to identify and remove content violating Community Guidelines and Advertiser-Friendly Content Guidelines. Exceptions are made for content with clear educational, documentary, scientific, or artistic value (EDSA).\n\n* **Creator Support:**  The YouTube Partner Program (YPP) offers revenue sharing to eligible creators who meet stricter content standards.  Creators have tools to manage comments and their channel's community interactions.  YouTube provides resources to support creator privacy and safety.\n\n* **Combating Abuse:** YouTube actively works to remove content promoting violent extremism or criminal organizations, collaborating with government entities and organizations like the GIFCT.\n\n* **Appeals Process:** Creators can appeal decisions regarding content removal or YPP suspension.\n\n\n",
    "last_update_summary": "### Competitor Policy Analysis: YouTube Community Guidelines (New Page)\n\n**Nature of Change:** This document represents the *introduction of a new policy page* (`new file mode`). It is not a modification of existing content but a dedicated, comprehensive overview of YouTube's content policies, enforcement, and creator support mechanisms.\n\n**Summary for Product Manager:**\n\nYouTube has launched a new, detailed policy page outlining its approach to Trust & Safety. This page serves as a central hub to explain how their Community and Advertiser-Friendly Guidelines work, how they support creators, and their strategies for combating abuse.\n\n**Key Policy Elements & Focus Areas:**\n\n*   **Foundational Philosophy:** Emphasizes \"openness and free expression\" while maintaining a \"responsible business\" that viewers, creators, and advertisers can rely on. They encourage a broad range of perspectives and debate, but within clear boundaries.\n*   **Dual Guideline System:**\n    *   **Community Guidelines:** Focus on platform safety, enforced by a mix of automated detection and human review. Explicitly mentions **EDSA (Educational, Documentary, Scientific, Artistic)** exceptions.\n    *   **Advertiser-Friendly Content Guidelines:** Focus on brand safety, primarily for creators in the YouTube Partner Program (YPP) to ensure ad monetization eligibility.\n*   **Creator Responsibility & Incentives:**\n    *   The **YouTube Partner Program (YPP)** is highlighted as a core mechanism, aligning creator incentives with platform safety. Creators must meet a \"higher bar\" and adhere to monetization policies.\n    *   Demonetization and YPP suspension are used for repeat offenses, reinforcing compliance.\n*   **Creator Tools for Self-Management:** YouTube empowers creators with tools to manage their own communities, including:\n    *   **Channel Guidelines:** For setting conversation tones and expectations.\n    *   **Comment Moderation:** Holding potentially inappropriate comments, hiding individuals, blocking words, assigning moderation roles.\n    *   **Privacy & Safety Resources.**\n*   **Combating Severe Abuse:** Explicitly prohibits content praising/promoting/aiding violent extremist or criminal organizations. Highlights reliance on external designations and partnerships like the **Global Internet Forum to Counter Terrorism (GIFCT)**.\n*   **Transparency & Future Outlook:** Links to ongoing efforts regarding AI-generated content disclosure and providing viewers with more context on videos, signaling a focus on emerging challenges and transparency initiatives.",
    "last_updated": "2025-07-21T01:00:42.429686Z"
  },
  "youtube-harassment-policy": {
    "policy_name": "Youtube Harassment Policy",
    "initial_summary": "## YouTube Harassment & Cyberbullying Policy Summary\n\nThis policy prioritizes the safety of creators, viewers, and partners.  Key prohibitions include:\n\n* **Harassment:** Prolonged insults or slurs targeting individuals based on protected group status, physical attributes, or victimhood (sexual assault, abuse, etc.).  A stricter approach is taken for content targeting minors.\n* **Doxxing & PII Sharing:** Sharing or threatening to share non-public personally identifiable information (PII),  except for widely available public information or clearly marked fake PII used for educational purposes.\n* **Abusive Behavior:** Encouraging brigading or other forms of coordinated abuse. Promoting harmful conspiracy theories linked to threats or violence.\n* **Threats & Violence:**  Threats against individuals or their property (including implicit threats), depictions of staged meet-ups to falsely accuse individuals, vigilante violence, or content glorifying or mocking death/injury.  This also includes realistic simulations of violence or death.\n* **Stalking & Sexualization:** Stalking, unwanted sexualization, sharing non-consensual intimate imagery, or fantasizing about/threatening sexual assault.\n\n**Exceptions:**  Content may be allowed if the primary purpose is educational, documentary, scientific, or artistic (e.g., debates, scripted performances, harassment awareness content). However, these exceptions do not excuse malicious harassment, especially based on protected group status.\n\n**Enforcement:** Violations result in content removal and email notification.  First-time offenders receive a warning with a policy training option.  Multiple violations or severe abuse can lead to strikes, channel suspension, or termination.  Repeat offenders may be prevented from accessing future policy trainings.  The policy applies to videos, comments, livestreams, and external links.\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a concise summary of the YouTube Harassment & Cyberbullying Policy, presented as a new policy document found in the diff:\n\n---\n\n### New YouTube Harassment & Cyberbullying Policy Summary\n\n**To:** Product Manager\n**From:** T&S Analyst\n**Date:** 2025-07-21\n**Subject:** Overview of New YouTube Harassment & Cyberbullying Policy\n\nThis diff introduces a comprehensive new policy for Harassment & Cyberbullying on YouTube, effective July 21, 2025. This is not an incremental update but a complete re-articulation of their stance and enforcement.\n\n**Key Tenets & Prohibited Content:**\n\n1.  **Broad Definition:** Prohibits content that targets individuals with prolonged insults/slurs based on physical traits or protected group status, threats, and doxxing. Stricter enforcement applies to content targeting minors (under 18).\n2.  **Specific Prohibitions Highlighted:**\n    *   **Minors:** Content intended to shame, deceive, or insult minors (e.g., name-calling, tricking them).\n    *   **PII & Doxxing:** Sharing *any* non-public Personally Identifiable Information (PII) – including one's own, accidental sharing, or encouraging its sharing. Fake PII must be clearly indicated.\n    *   **Coordinated Abuse:** Encouraging \"brigading\" or coordinated abuse on/off platform.\n    *   **Harmful Conspiracy Theories:** Promoting or targeting individuals based on conspiracy theories linked to direct threats or violence.\n    *   **Threats:** Implicit or explicit threats to identifiable individuals or their property (e.g., brandishing weapons).\n    *   **Staged Misconduct:** Depicting staged meet-ups accusing egregious misconduct with minors without law enforcement.\n    *   **Vigilantism:** Content depicting vigilantes restraining, assaulting, or engaging in dangerous vehicle pursuits.\n    *   **Mocking & Simulation:** Reveling in/mocking death/serious injury of identifiable individuals, or realistically simulating deceased persons describing their death/violence. Also, creators simulating serious violence against others (e.g., executions, torture).\n    *   **Stalking & Victim Minimization:** Content containing stalking or denying/minimizing someone’s role as a victim of well-documented violent events.\n    *   **Unwanted Sexualization:** Content describing individuals in a lewd/degrading manner, sharing/requesting Non-Consensual Intimate Imagery (NCII), or supporting sexual assault.\n3.  **Scope:** Policy applies broadly across all YouTube content types (videos, descriptions, comments, live streams) and extends to external links.\n4.  **Exceptions (EDSA):** Content may be allowed if primarily for Educational, Documentary, Scientific, or Artistic purposes. Examples include debates involving high-profile officials, scripted satire/comedy/music, or harassment education/awareness. *Crucially, these are not a \"pass to harass,\" and insults based on protected group status are strictly handled regardless of public profile.*\n5.  **Monetization & Enforcement Penalties:**\n    *   Content removal for violations.\n    *   First violation typically results in a warning, with an option to complete policy training to expire the warning after 90 days.\n    *   Accumulation of 3 strikes within 90 days leads to channel termination.\n    *   Severe abuse or channels dedicated to policy violations may result in immediate termination. Repeat offenders may lose access to policy training.\n    *   Specific monetization penalties outlined for creators who repeatedly encourage abusive behavior, target individuals, expose to physical harm risks, or incite hostility for financial gain.\n\n**Key Changes (as this is a new file, the entire policy is new):**\n\nThis document establishes YouTube's current, comprehensive stance on harassment. Key areas that appear strengthened or explicitly codified include:\n\n*   **Explicit focus on minors:** A dedicated section and stricter approach for content targeting individuals under 18.\n*   **Expanded PII/Doxxing:** Clearer definition of PII and explicit prohibition of sharing *any* non-public PII, including one's own.\n*   **New Categories of Harm:** Introduction of policies against harmful conspiracy theories, vigilante actions, mocking death/injury, and various forms of simulated violence. This indicates an increased awareness of evolving online harms.\n*   **Refined Sexualization Policy:** Clearer definitions of unwanted sexualization, including NCII and fantasizing about sexual assault.\n*   **EDSA Clarifications:** Detailed exceptions for educational, documentary, scientific, or artistic content, while maintaining a strict stance against using these as excuses for harassment.\n*   **Monetization Impact:** Explicitly linking severe or repeated harassment to potential demonetization or other penalties beyond standard strikes.\n\nThis policy reflects a significant effort to create a safer environment by addressing a wider array of harmful behaviors with more specific guidance and stricter enforcement.",
    "last_updated": "2025-07-21T01:00:54.502966Z"
  },
  "youtube-shopping-ads-policy": {
    "policy_name": "Youtube Shopping Ads Policy",
    "initial_summary": "## Google Shopping Ads Policies: Summary for Product Managers\n\nThis document outlines Google's policies for Shopping ads, aiming for a trustworthy and transparent advertising ecosystem.  Key areas covered are:\n\n**1. Prohibited Content:**  This includes counterfeit goods, dangerous products (drugs, weapons, explosives), products enabling dishonest behavior (hacking tools, fake documents), and inappropriate content (hate speech, violence, cruelty).  Certain content lacks optimal support and is therefore unsupported in Shopping ads, though this doesn't affect other Google platforms.\n\n**2. Prohibited Practices:** This section addresses abuse of the ad network (malicious content, unfair advantages, bypassing reviews), irresponsible data collection and use (insecure data handling), and misrepresentation (misleading promotions, inaccurate product portrayal).\n\n**3. Restricted Content:**  This category covers legally or culturally sensitive content allowed with limitations and potential additional requirements. Examples include adult-oriented content, alcoholic beverages, copyrighted material, gambling, healthcare products, political content, and High Fat Sugar Salt (HFSS) food & beverages (prohibited from targeting minors).\n\n**4. Editorial & Technical Requirements:**  Ads must meet high professional and editorial standards, be clear, and lead to relevant, user-friendly landing pages. Technical requirements ensure ad functionality across various formats.\n\n**Enforcement:** Google uses AI and human review to enforce policies, taking actions ranging from disapproving ads to suspending accounts for violations.  Advertisers can appeal decisions.  Compliance with all applicable laws and regulations is mandatory.\n",
    "last_update_summary": "As a Trust & Safety analyst, here's a concise summary of the provided competitor's policy page for a Product Manager:\n\n### Summary: Google Shopping Ads Policy Center - New Policy Launch\n\nThis diff indicates the *entire launch* of Google's new \"Shopping ads Policy Center,\" dated 2025-07-21. This document comprehensively outlines the rules for running Shopping Ads and Local Inventory Ads on Google platforms.\n\n**Key Changes/New Additions:**\n\n1.  **Dedicated Policy Hub:** Establishes a centralized and structured policy document specifically for Shopping ads, emphasizing trustworthiness, transparency, and user safety.\n2.  **Policy Categorization:** Policies are clearly grouped into four main areas:\n    *   **Prohibited Content:** (e.g., counterfeit goods, dangerous products, products enabling dishonest behavior, inappropriate content, and notably, **unsupported content specific to Shopping ads** where an optimal user experience cannot be provided).\n    *   **Prohibited Practices:** (e.g., abuse of the ad network, **irresponsible data collection & use** emphasizing secure connections for sensitive user data, and misrepresentation).\n    *   **Restricted Content:** (Content allowed with limitations, including adult, alcoholic beverages, copyrighted, gambling-related, healthcare-related, political, trademarks, and the addition of **High Fat Sugar Salt (HFSS) Food and Beverage**).\n    *   **Editorial and Technical:** Quality standards.\n3.  **Enforcement Mechanism:** Explicitly states the use of a combination of **Google AI and human evaluation** for compliance.\n4.  **Enforcement Actions & Appeals:** Details actions like ad disapprovals, temporary impression caps, and account suspensions, providing clear pathways for fixing violations and **appealing decisions**.\n5.  **Geopolitical Ad Pause:** A prominent, temporary note regarding the suspension of ads globally for advertisers based in Russia and ads serving to users located in Russia, due to the war in Ukraine.\n\n**Impact for Product Managers:**\n\nThis new policy framework signals a clearer and more robust stance on various ad content and practices for Google's Shopping Ads. Our product strategy should consider alignment with these granular policy definitions, particularly concerning data handling, unsupported content types, and restricted categories like HFSS foods, to ensure competitiveness and compliance if we operate in similar advertising spaces.",
    "last_updated": "2025-07-21T01:01:07.330327Z"
  },
  "instagram-community-guidelines": {
    "policy_name": "Instagram Community Guidelines",
    "initial_summary": "# Competitor Policy Summary:\n\nThis document outlines Meta's Community Standards, encompassing policies for Facebook, Instagram, Messenger, and Threads.  Key areas covered include:\n\n* **Content Moderation:**  Policies define acceptable and unacceptable content, addressing issues like hate speech, violence, harassment, misinformation, and illegal activities.  A three-part enforcement approach (remove, reduce, inform) is used.  Newsworthiness and public interest are considered when evaluating potentially violating content.\n\n* **Account Integrity:** Policies cover authentic identity, inauthentic behavior, and account security.\n\n* **Safety & Well-being:**  Emphasis is placed on user safety, privacy, and dignity.  Specific attention is given to protecting minors, addressing issues like child exploitation and suicide/self-harm.\n\n* **Transparency & Enforcement:**  The document details how Meta detects and addresses policy violations, including technological solutions and human review.  Transparency reports on enforcement, intellectual property, government data requests, and content restrictions are publicly available.\n\n* **Governance & Appeals:**  Information is provided about Meta's Oversight Board, its role in policy appeals, and its impact.\n\n* **Research & Data:** Access to research tools and datasets related to content and advertising is highlighted.\n\n\nThe policy aims to balance freedom of expression with the need to maintain a safe and respectful online environment.  The US English version is considered the primary and most up-to-date document.\n",
    "last_update_summary": "### Competitor Policy Page Analysis: Instagram Community Guidelines (2025-07-21)\n\nThis diff represents the **initial publication** of the Instagram Community Guidelines on 2025-07-21. While presented as an Instagram page, these guidelines broadly apply to **all Meta platforms** (Facebook, Instagram, Messenger, and Threads).\n\n**Key Policy Highlights:**\n\n*   **Scope:** Policies are global and apply to *all content types, including AI-generated content*.\n*   **Guiding Principles:** Emphasis on balancing user expression with core values: Authenticity, Safety, Privacy, and Dignity.\n*   **Policy Structure:** Each policy includes a rationale, outlines prohibited content, and specifies content allowed with warnings or age restrictions (18+).\n*   **Transparency Hub:** The page functions as a central \"Transparency Center\" linking to a wide array of T&S-related information including:\n    *   Detailed policies (Community Standards, Ad Standards, Other).\n    *   Enforcement methodologies (detection, action).\n    *   Security efforts (threat disruptions, reporting).\n    *   Feature-specific approaches (e.g., dangerous organizations, misinformation, newsworthy content).\n    *   Governance structures (Oversight Board).\n    *   Research tools and extensive transparency reports (enforcement, IP, government requests, widely viewed content, etc.).\n*   **Primary Document:** Notes that the US English version is the most up-to-date and primary reference.\n\n**Key Change based on Diff:**\n\nThe primary change is the **creation and publication of this comprehensive Community Guidelines page** itself on 2025-07-21. This indicates a strategic move to centralize and enhance transparency around Meta's T&S policy framework, explicitly extending its scope to **AI-generated content** and providing a highly navigable hub for all related policies, enforcement, security, and reporting.",
    "last_updated": "2025-07-21T00:59:24.141149Z"
  },
  "instagram-appeal-process": {
    "policy_name": "Instagram Appeal Process",
    "initial_summary": "Here's a concise summary of Instagram's Oversight Board appeal policy for a Product Manager:\n\n### Instagram Oversight Board Appeal Policy Summary\n\n**Key Points:**\n\n*   **Purpose:** Allows users to appeal Instagram's content decisions (both on their own content or content they reported) to an independent Oversight Board (OB).\n*   **Prerequisite:** Users **must** first exhaust Instagram's internal review process, including two internal reviews of the decision, before becoming eligible to appeal to the OB.\n*   **Appeal Types:**\n    *   Decisions to take down a user's content.\n    *   Decisions not to remove content a user reported.\n*   **Eligibility & Selection:** Not all content decisions are eligible for OB appeal. The OB itself selects only a limited number of eligible appeals for review and may not choose a specific case.\n*   **Timeline:** Appeals to the OB must be submitted within **15 days** of Instagram's final decision.\n*   **Status Check:** Users can track their appeal status on the Oversight Board's website using a reference number.",
    "last_update_summary": "**Summary for Product Manager: Instagram Oversight Board Appeal Policy Page**\n\nThis new policy page formalizes and centralizes the process for Instagram users to appeal content moderation decisions to the Oversight Board (OB).\n\n**Key Takeaways:**\n\n*   **Two Appeal Paths:** Users can appeal decisions regarding: 1) their own content that was removed, or 2) content they reported that was *not* removed.\n*   **Mandatory Internal Review:** Before appealing to the OB, users **must** first exhaust Instagram's internal \"request a review\" process. Eligibility for OB appeal requires our team to have reviewed the content **twice**.\n*   **Time Limit:** Users have a **15-day window** from the final internal decision to submit an appeal to the Oversight Board.\n*   **Selective Review:** The OB does not guarantee review of all eligible appeals; they select a limited number of cases. Not all content decisions are eligible for OB appeal.\n\nThis page clearly defines the multi-stage appeal hierarchy, reinforcing our internal review process as the mandatory first step before external escalation to the Oversight Board.",
    "last_updated": "2025-07-21T00:59:01.812184Z"
  },
  "instagram-blocking-people": {
    "policy_name": "Instagram Blocking People",
    "initial_summary": "Here's a concise summary of the provided policy text for a Product Manager:\n\n### Instagram \"Blocking People\" Policy Summary\n\nThis policy details Instagram's \"Blocking People\" feature, a core safety and privacy control.\n\n**Key Points:**\n\n*   **Core Functionality:** Explains how users can block and unblock other accounts.\n*   **Impact of Blocking:**\n    *   Removes all past comments and likes from the blocked user.\n    *   Clarifies that a blocked user generally cannot see the blocker's content, message them, or mention them.\n    *   Provides guidance on how to view and manage a list of blocked accounts.\n*   **Related Privacy & Safety Controls:** The document also references other related user controls available in the \"Privacy, Security & Reporting\" section, including:\n    *   Making an account private.\n    *   Removing followers.\n    *   Restricting users (a softer form of control than blocking).\n    *   Temporarily limiting interactions from others.\n    *   Reporting messages or accounts.\n\nThis policy emphasizes user control over their interactions and visibility on the platform.",
    "last_update_summary": "As a Trust & Safety analyst, here's a summary of the competitor's policy page for a product manager:\n\n---\n\n### **Summary: Competitor Policy - \"Blocking People\"**\n\n**Date of Policy:** 2025-07-21\n\n**Key Changes (based on diff):**\nThis is the **initial creation** of a dedicated \"Blocking People\" policy page, not an update to an existing one. This signifies a move to consolidate and clearly communicate all user-facing information related to blocking features and their effects.\n\n**Page Purpose:**\nThis new policy page serves as a comprehensive resource for users on how to manage their interactions and privacy by blocking individuals on Instagram.\n\n**Core Functionality Covered:**\nThe page explains:\n*   How to block and unblock users.\n*   The specific impact of blocking on comments, likes, and mentions (e.g., comments and likes are removed, blocked users cannot mention you).\n*   How to view and manage a list of blocked accounts.\n*   The ability to block users specifically from commenting on media.\n\n**Related Features Highlighted:**\nBeyond direct blocking, the page also provides quick links and information on other user safety and privacy tools, indicating a holistic approach to user control:\n*   Making an Instagram account private.\n*   Removing a follower.\n*   Restricting or unrestricting someone (a less severe interaction control).\n*   Temporarily limiting interactions.\n*   Reporting messages or chats.\n\n**Significance for Product Management:**\nThe creation of this consolidated page suggests a focus on user empowerment and clarity regarding safety features. It emphasizes transparency about the consequences of blocking and provides users with a central hub to understand and manage various interaction control options. It indicates a commitment to detailing the full scope of user control beyond just the basic \"block\" action.",
    "last_updated": "2025-07-21T00:59:08.081039Z"
  },
  "instagram-commerce-policies": {
    "policy_name": "Instagram Commerce Policies",
    "initial_summary": "### Competitor Policy Page Analysis: Unavailable Page\n\nThe provided text is an error message from Instagram's Help Center, indicating that a specific page is unavailable.\n\n**Key Points:**\n\n*   **Core Message:** \"This Page Isn't Available.\"\n*   **Reasons for Unavailability:** The page may be unavailable due to a broken link or because it has been removed.\n*   **User Guidance:** Users are advised to check if the link they are trying to open is correct.\n*   **Navigation Options:** The page provides clear calls to action to return to the Help Center Home or go back to the previous page.\n*   **T&S Relevance:** This page demonstrates how a competitor handles missing or removed content (potentially policy or help documentation), which impacts user experience and trust. It emphasizes the need for clear communication and alternative navigation when users encounter inaccessible information.",
    "last_update_summary": "### Policy Page Accessibility Snapshot\n\n**Summary of Change:**\nA new snapshot (dated 2025-07-21T005824Z) of what appears to be the Instagram Commerce Policies page shows that the page was unavailable, displaying a \"This Page Isn't Available\" error message.\n\n**Key Implications for PM:**\n*   This is **not a content policy change**, but an observation of the page's status.\n*   It indicates that, at the time of the snapshot, the Instagram Commerce Policies page was inaccessible (either down, moved, or the link used for the snapshot was broken).\n*   From a T&S perspective, the unavailability of core commerce policies is critical, impacting user transparency and potential enforcement challenges.\n\n**Actionable:** Investigate the root cause of this page unavailability at the specified timestamp.",
    "last_updated": "2025-07-21T00:59:12.809864Z"
  },
  "tiktok-blocking-users": {
    "policy_name": "Tiktok Blocking Users",
    "initial_summary": "Here's a concise summary of the competitor's policy page for a Product Manager:\n\n### Competitor Policy Page Summary\n\nThe competitor's policy documentation serves as a comprehensive help center, detailing an exceptionally broad range of platform functionalities, from core features to advanced creator tools and monetization.\n\n**Key Trust & Safety Takeaways:**\n\n*   **Robust User Control & Safety Tools:** A significant focus is placed on empowering users with safety mechanisms. Detailed instructions for blocking (individual users, multiple users from comments, unblocking) are prominently featured, alongside mentions of a \"Safety Center,\" \"Community Guidelines,\" and \"Report a problem\" functionality.\n*   **Comprehensive Feature & Content Coverage:** The policies span an extensive array of content types and features including user-generated videos, AI-generated content, creator tools, live streaming, e-commerce (\"TikTok Shop\"), messaging, and content discovery, indicating a complex ecosystem requiring broad T&S oversight.\n*   **Creator Monetization & Ecosystem:** Policies extend to creator monetization features (LIVE, Gifts, promotion tools), necessitating guidelines for commercial activities, fraud prevention, and responsible content creation related to earning.\n*   **Legal & Policy Framework:** The document points to a foundational set of legal and policy resources, including Terms of Use, Privacy, Copyright, and Law Enforcement guidelines, signifying a structured approach to compliance and trust.\n*   **Algorithmic Transparency & Global Reach:** It touches on content recommendation algorithms (\"How TikTok recommends content\") and highlights a vast global operational scope through an extensive list of supported languages, implying a need for culturally nuanced and legally compliant T&S policies worldwide.",
    "last_update_summary": "## Trust & Safety Analysis: TikTok \"Blocking Users\" Policy (New Page)\n\nThis diff introduces a **new policy page** detailing TikTok's user blocking functionalities, providing clear instructions for users to manage their interactions.\n\n**Key Features & Insights for Product Managers:**\n\n*   **Comprehensive Blocking:** The policy outlines how users can block and unblock individual accounts, emphasizing the simplicity of the process via the \"Share\" button on a profile.\n*   **New: Bulk Comment Blocking:** A significant addition is the detailed guidance on **blocking multiple users simultaneously** directly from the comments section of a user's own video. This feature, accessed by long-pressing a comment or using the \"Filters\" button, empowers users to efficiently manage and mitigate harassment or unwanted interactions from multiple accounts.\n*   **Clear Impact:** The policy explicitly states the consequences of blocking: blocked users cannot view the blocker's posts, send direct messages, comment, follow, or like their content.\n*   **User Empowerment for Safety:** This new page and its features demonstrate TikTok's focus on providing users with robust tools to control their on-platform experience and enhance personal safety by limiting unwanted engagement. The bulk blocking feature is particularly valuable for users experiencing coordinated harassment or spam.",
    "last_updated": "2025-07-21T00:59:31.141454Z"
  },
  "youtube-hiding-users": {
    "policy_name": "Youtube Hiding Users",
    "initial_summary": "As a Trust & Safety analyst, here is a concise summary of the provided policy document on YouTube's \"Hide users from your channel\" feature for a Product Manager:\n\n---\n\n### YouTube: \"Hide Users from Your Channel\" Policy Summary\n\nThis policy outlines a channel moderation feature allowing content creators to control who can interact with their content.\n\n**Key Functionality:**\n\n*   **Purpose:** Channel owners can \"hide\" specific viewers to prevent their comments from appearing on the channel and to stop them from creating clips from videos or live streams.\n*   **Impact on Hidden User:**\n    *   All previous comments from the hidden user on the channel will be hidden within 48 hours.\n    *   Future comments from the hidden user will not appear.\n    *   The hidden user will **not** receive a notification that they have been hidden.\n*   **Methods to Hide:**\n    1.  **From a Comment:** Select \"More\" next to a user's comment, then \"Hide user from channel.\"\n    2.  **Via YouTube Studio:** In \"Settings\" > \"Community\" > \"Automated Filters,\" paste the user's channel URL into the \"Hidden users\" box.\n*   **Managing Hidden Users:**\n    *   A list of hidden users is available in YouTube Studio under \"Settings\" > \"Community\" > \"Automated Filters.\"\n    *   Users can be \"shown\" (unhidden) from this list, which allows their *future* comments to appear. Previous comments remain hidden.\n*   **Scope:** This is a **channel moderation tool** for managing audience interaction. It is distinct from reporting abuse, harassment, or policy violations, which should be directed to the Safety Center.\n\n---",
    "last_update_summary": "This `diff` indicates the introduction of an *entirely new policy page* titled \"Hide users from your channel\".\n\n**Key Takeaways for Product Manager:**\n\n*   **New Policy Introduction:** YouTube has introduced a dedicated help page detailing how creators can \"hide\" users from their channels.\n*   **Impact of Hiding:** Hiding a user prevents their comments from appearing on the channel (including in YouTube Studio) and stops them from creating clips from the creator's videos or live streams.\n*   **Methods for Hiding:** Users can be hidden directly from a comment on the channel page or by adding their channel URL to a \"Hidden users\" list in YouTube Studio settings.\n*   **Management:** Creators can view and manage (unhide) their list of hidden users within YouTube Studio.\n*   **Comment Visibility:** When a user is hidden, their *previous* comments are removed within 48 hours. If a user is unhidden, *future* comments will appear, but *previous* comments from that user remain hidden.\n*   **No Notification:** Hidden users are not notified that they have been hidden.",
    "last_updated": "2025-07-21T01:00:58.162994Z"
  }
}